{"data":[{"id":26266,"name":"El Diego","sku":"9780224071901","description":"One of the world's greatest footballers finally tells his story in his own words Sometimes I think that my whole life is on film, that my whole life is in print. But it's not like that, there are things which are only in my heart - that no one knows. At last I have decided to tell everything Diego Armando Maradona needs little introduction. A poor boy from a Buenos Aires shanty-town, his genius with a ball took him to the heights of European and World football, and his struggle with the pressures of life inside and outside the game pulled him right back down again. Hero or villain, one thing is certain: he was the greatest footballer of his generation - and perhaps of all time. Never before has Maradona given us his extraordinary story in his own words. Until now. From his poverty-stricken origins to his greatest glories, Maradona recounts, with astonishing frankness, and brilliant footballing insight, the pivotal moments of a legendary life. We see inside the mind of one of the most controversial and complex sportsmen of our times - a man torn between the demands of corporate club bosses, the fans, the media, and his own tempestuous personal life. resurrections, the man behind the madness is revealed - El Diego is a confessional, a revelation, an apology and a celebration.","sale_price":958,"quantity":2,"category_id":6,"enabled":1,"author":"Diego Maradona","edition":1,"is_used_book":0,"publisher":"Random House","published_at":"2005-01-01","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/16208","created_at":"2021-02-26 06:05:47","updated_at":"2021-10-07 06:28:31","deleted_at":null,"number_of_pages":320,"weight":275,"slug":"el-diego","is_hard_cover":0,"path":"\/books\/el-diego","shareable_url":"https:\/\/booksmandala.com\/books\/el-diego","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":16208,"disk":"uploads","directory":"1\/items","filename":"9780224071901","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":13447,"created_at":"2021-02-26 06:05:47","updated_at":"2021-02-26 06:05:47","deleted_at":null,"pivot":{"mediable_id":26266,"media_id":16208,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":3483,"name":"The Dirty Girls Book Club","sku":"9781405911900","description":"Loved Bared to You by Sylvia Day and Fifty Shades of Grey by E.L. James? Then erotic romance The Dirty Girls Book Club by Savanna Fox is definitely the next thing to put on your reading list! Georgia Malone joined a book club to expand her literary horizons. But when they swap serious classics for steamy fiction, she discovers just how much fun reading can be . . . When Georgia is widowed at the age of 25, her world falls apart. Three years on, and she has thrown herself completely into her job, leaving no time for love. But this suits her just fine - she'd prefer to read about fictional romances than face the real thing. But when she discovers that her new client is gorgeous sportsman of the moment, Woody Hanrahan, Georgia finds that her long-buried libido is awakened. Woody is charming and cocky - the sort of man Georgia usually avoids. But while her head is telling her to stay away, her body wants something else. And as her book club explores the tantalizing extremes of fiction, Georgia is exploring the limits of pleasures and beyond. Woody is hers to command in a hundred deliciously wicked ways, but when it comes to writing her own happy ending, this girl doesn't just need his body - she wants his heart. A tale of lust, love and literature with a sexy twist, The Dirty Girls Book Club is unputdownable. Savanna Fox splits her time between her homes in Vancouver and Victoria, British Columbia. She has degrees in law and psychology, and has had a variety of careers, including perennial student, computer consultant, and legal editor. Fiction writer is by far her favourite, giving her an outlet to demonstrate her belief in the power of love, friendship, and a sense of humour. Visit her website at www.savannafox.com for excerpts, behind-the-scenes notes, discussion guides, recipes, articles, newsletter sign-up, contests, and give-aways.","sale_price":560,"quantity":2,"category_id":6,"enabled":1,"author":"Savanna Fox","edition":0,"is_used_book":0,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/5489","created_at":"2016-08-28 09:26:21","updated_at":"2020-09-23 06:53:09","deleted_at":null,"number_of_pages":368,"weight":280,"slug":"the-dirty-girls-book-club","is_hard_cover":0,"path":"\/books\/the-dirty-girls-book-club","shareable_url":"https:\/\/booksmandala.com\/books\/the-dirty-girls-book-club","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":5489,"disk":"uploads","directory":"1\/items","filename":"9781405911900","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":15816,"created_at":"2019-08-28 07:27:51","updated_at":"2019-08-28 07:27:51","deleted_at":null,"pivot":{"mediable_id":3483,"media_id":5489,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":12455,"name":"Summit","sku":"9789386224330","description":"Summit - a novel. In the autumn of 1938 Germany’s Reichsführer, Heinrich Himmler, is growing frustrated at the British using their regional power in India to block passage of an SS expedition to Tibet. Determined to spite them, he plots to steal something the British hold dear and have failed for the seventh time that spring to achieve – a first summit of Mount Everest. Seventy years later, seasoned mountain guide Neil Quinn's ninth visit to the top of the world’s highest mountain in the charge of the sixteen-year old son of a Long Island billionaire begins to unravel. As a desperate fight for their lives begins in the freezing air high above Tibet, Quinn stumbles across a clue to a story that questions everything he thinks he knows about the great mountain. When the bitter aftermath of Quinn’s disastrous climb turns to violent tragedy in Kathmandu, his discovery pushes him into a relentless journey that takes him from the dangerous heights of Everest to the equally treacherous margins of a new Europe where history hungers to repeat itself. Amidst a rich and diverse cast of characters, each with their own reason to possess the mystery of his discovery, Neil Quinn has to fight, increasingly desperately, for order and the truth. In doing so, he reveals an older story of man and mountain to its shocking conclusion.","sale_price":560,"quantity":2,"category_id":6,"enabled":1,"author":"Harry Farthing","edition":0,"is_used_book":0,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/4669","created_at":"2017-03-29 11:16:49","updated_at":"2020-08-31 06:19:41","deleted_at":null,"number_of_pages":632,"weight":485,"slug":"summit","is_hard_cover":0,"path":"\/books\/summit","shareable_url":"https:\/\/booksmandala.com\/books\/summit","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":4669,"disk":"uploads","directory":"1\/items","filename":"9789386224330","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":42442,"created_at":"2019-08-20 10:59:15","updated_at":"2019-08-20 10:59:15","deleted_at":null,"pivot":{"mediable_id":12455,"media_id":4669,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":19367,"name":"Neymar the ultimate fan book","sku":"9781787391987","description":null,"sale_price":798,"quantity":2,"category_id":6,"enabled":1,"author":"Nick Callow","edition":0,"is_used_book":0,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/covers.openlibrary.org\/b\/isbn\/9781787391987-L.jpg","created_at":"2019-01-31 13:14:03","updated_at":"2021-02-20 09:42:58","deleted_at":null,"number_of_pages":null,"weight":null,"slug":"neymar-the-ultimate-fan-book","is_hard_cover":0,"path":"\/books\/neymar-the-ultimate-fan-book","shareable_url":"https:\/\/booksmandala.com\/books\/neymar-the-ultimate-fan-book","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[]},{"id":4011,"name":"England Away","sku":"9780099739616","description":"Having examined England's twin obsessions - violence and sex - in THE FOOTBALL FACTORY and HEADHUNTERS, John King completes his trilogy with ENGLAND AWAY- sex and violence abroad, under the Union Jack. The novel works on three levels - past, present and future - as pensioner Bill Farrell remembers his war experiences in a London pub, Tommy Johnson fights his way through Holland and Germany for an England football match in Berlin, and Harry considers the future fuelled by doses of Dutch skunk and German speed. John King's powerful new novel looks at notions of what it means to be English. Exploring stereotypes of language and nationalism, the primal pulls of lust and aggression, ENGLAND AWAY culminates in a unity of the tribes and a blitzkreig in the streets of Berlin.","sale_price":467,"quantity":2,"category_id":6,"enabled":1,"author":"John King","edition":0,"is_used_book":0,"publisher":"Vintage Books","published_at":null,"thumbnail_url":"https:\/\/covers.openlibrary.org\/b\/isbn\/9780099739616-L.jpg","created_at":"2016-08-29 12:34:05","updated_at":"2020-09-29 08:13:59","deleted_at":null,"number_of_pages":282,"weight":230,"slug":"england-away","is_hard_cover":0,"path":"\/books\/england-away","shareable_url":"https:\/\/booksmandala.com\/books\/england-away","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[]},{"id":18347,"name":"Griezmann - 2019 Updated Edition","sku":"9781785784262","description":"Quick, incisive and versatile, Antoine Griezmann is the ultimate modern forward. Arriving in 2014 to join an Atlético Madrid side persistently challenging for the biggest trophies in Spanish and European football, he quickly established himself as the team's key player and main goal threat. A Super Cup win over city rivals Real Madrid was just the start but an inspired tilt at the Champions League the following season ended in heartbreak - as did a Euro 2016 campaign in which his performances for France saw him named player of the tournament. In this first biography of the Atléti and France star, Madrid-based journalist Luca Caioli examines the story behind Griezmann's rise to the top.","sale_price":638,"quantity":2,"category_id":6,"enabled":1,"author":"Luca Caioli","edition":0,"is_used_book":0,"publisher":"Icon Books","published_at":"2018-10-04","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/2881","created_at":"2018-12-20 13:20:41","updated_at":"2020-08-30 07:19:00","deleted_at":null,"number_of_pages":240,"weight":190,"slug":"griezmann-2019-updated-edition","is_hard_cover":0,"path":"\/books\/griezmann-2019-updated-edition","shareable_url":"https:\/\/booksmandala.com\/books\/griezmann-2019-updated-edition","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":2881,"disk":"uploads","directory":"1\/items","filename":"9781785784262","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":35945,"created_at":"2019-08-06 08:15:01","updated_at":"2019-08-06 08:15:01","deleted_at":null,"pivot":{"mediable_id":18347,"media_id":2881,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":18348,"name":"Mbappe","sku":"9781785784187","description":null,"sale_price":638,"quantity":2,"category_id":6,"enabled":1,"author":"Luca Caioli,Cyril Collot","edition":0,"is_used_book":0,"publisher":"Icon Books","published_at":"2018-09-06","thumbnail_url":"https:\/\/covers.openlibrary.org\/b\/isbn\/9781785784187-L.jpg","created_at":"2018-12-20 13:21:43","updated_at":"2019-10-16 11:02:31","deleted_at":null,"number_of_pages":null,"weight":null,"slug":"mbappe","is_hard_cover":null,"path":"\/books\/mbappe","shareable_url":"https:\/\/booksmandala.com\/books\/mbappe","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[]},{"id":21676,"name":"Ascent","sku":"9781471157578","description":"BRITAIN'S GREATEST CLIMBER.  'He is the David Attenborough of mountaineering . . . Bonington's most personal memoir yet.' The Times.  'This is a compelling tale of fortitude and endurance.' - The Sunday Times  'He is the icon of British climbing.' The Daily Mirror  Sir Chris Bonington memoir Ascent will chart not only his many triumphs in the climbing world - such as the Eiger, and the Himalaya - but also the struggles he has faced in his life bringing up a family, and maintaining a successful and loving marriage over the decades of travelling the world to conquer mountains.  He has undertaken nineteen Himalayan expeditions, including four to Mount Everest which he climbed in 1985 at the age of fifty, and has made many first ascents in the Alps and greater ranges of the world. Along the way we will be fascinated by his many daring climbs, near-death adventures, and the many luminaries of the mountain fraternity he has climbed with, and in some cases - witness their deaths on the rock. The mercurial Dougal Haston; the legendary-tough Don Whillans, the philosopher of the rock Stephen Venables, and the enigmatic Doug Scott, plus many more - this will be an expert's opinion on the past sixty years of British\/ world mountaineering.  In Ascent Chris also discusses his first wife (Wendy) who tragically passed away after a long battle with motor neuron disease - his many years of caring for her, and then in his twilight years deciding to return to an iconic climb from his past - The Old Man of Hoy - to summit at the age of 80 years of age. He has now also found love again amidst the sadness and grief. It is a truly inspirational tale.  Ascent will be a memoir like no other. Not only a cerebral narrative on what it takes to conquer fear, and learn\/ develop the technical skills necessary to climb the world's greatest peaks; what it is like to survive in places no human being can ultimately reside in for longer than a few months at very high altitude, but also how one overcomes emotional obstacles, too, and rediscover what drives us on to happiness.","sale_price":798,"quantity":2,"category_id":6,"enabled":1,"author":"Chris Bonington","edition":1,"is_used_book":0,"publisher":"Simon & Schuster","published_at":"2018-05-31","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/8230","created_at":"2019-11-23 16:37:42","updated_at":"2020-08-31 05:05:41","deleted_at":null,"number_of_pages":432,"weight":340,"slug":"ascent-1","is_hard_cover":0,"path":"\/books\/ascent-1","shareable_url":"https:\/\/booksmandala.com\/books\/ascent-1","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":8230,"disk":"uploads","directory":"1\/items","filename":"9781471157578","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":38032,"created_at":"2019-11-23 16:37:42","updated_at":"2019-11-23 16:37:42","deleted_at":null,"pivot":{"mediable_id":21676,"media_id":8230,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":4014,"name":"Headhunters","sku":"9780099739517","description":"Following on from his bestselling study of violence, THE FOOTBALL FACTORY, John King considers Britain`s other obsession-sex. Formed in the chemical mists of New year`s Eve, The Sex Division sees the once=sacred act of procreation at its most material, as five men devise system based on the sexual act. In this lagerosoaked league, the most that women can offer man is 4 points-unless, that is, she leaves her handbag unattended. . . From its base in the asset-stripped, emotionally castrated 90s, HEADHUNTRS shows the dreams of The Sex Devision members breaking through the heavy media cloud of anorexic pin-ups and paedophile fashion. A missing brother, prophetic visions, a love affair, and tit-for-tat confrontation draw the characters out into the open-revealing the men behind the machismo, their need for mutual respect, and their recognition of the hidden or suppressed affinities.","sale_price":463,"quantity":2,"category_id":6,"enabled":1,"author":"John King","edition":0,"is_used_book":0,"publisher":"Vintage Books","published_at":"1998-05-07","thumbnail_url":"https:\/\/covers.openlibrary.org\/b\/isbn\/9780099739517-L.jpg","created_at":"2016-08-29 12:38:02","updated_at":"2020-09-29 08:13:38","deleted_at":null,"number_of_pages":307,"weight":255,"slug":"headhunters","is_hard_cover":0,"path":"\/books\/headhunters","shareable_url":"https:\/\/booksmandala.com\/books\/headhunters","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[]},{"id":18111,"name":"K2 Life and death on the world's most dangerous mountain","sku":"9780767932608","description":"Ed Viesturs, one of the world's premier high-altitude mountaineers, explores the remarkable history of K2 and of those who have attempted to conquer it. At the same time, he probes the mountain's most memorable sagas in order to illustrate lessons about the fundamental questions mountaineering raises—questions of risk, ambition, loyalty to one's teammates, self-sacrifice, and the price of glory. Viesturs knows the mountain firsthand. He and renowned alpinist Scott Fischer climbed it in 1992 and got caught in an avalanche that sent them sliding to almost certain death before Ed managed to get into a self-arrest position with his ice ax and stop both his fall and Scott's.\r\n\r\nFocusing on seven of the mountain's most dramatic campaigns, from his own troubled ascent to the 2008 tragedy, Viesturs crafts an edge-of-your-seat narrative that climbers and armchair travelers alike will find unforgettably compelling. With photographs from Viesturs's personal collection and from historical sources, this is the definitive account of the world's ultimate mountain, and of the lessons that can be gleaned from struggling toward its elusive summit.","sale_price":560,"quantity":2,"category_id":6,"enabled":1,"author":"Ed Viesturs","edition":0,"is_used_book":0,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/4693","created_at":"2018-11-01 13:12:07","updated_at":"2020-10-11 06:57:35","deleted_at":null,"number_of_pages":342,"weight":345,"slug":"k2-life-and-death-on-the-worlds-most-dangerous-mountain","is_hard_cover":0,"path":"\/books\/k2-life-and-death-on-the-worlds-most-dangerous-mountain","shareable_url":"https:\/\/booksmandala.com\/books\/k2-life-and-death-on-the-worlds-most-dangerous-mountain","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":4693,"disk":"uploads","directory":"1\/items","filename":"9780767932608","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":39327,"created_at":"2019-08-20 12:16:22","updated_at":"2019-08-20 12:16:22","deleted_at":null,"pivot":{"mediable_id":18111,"media_id":4693,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":31195,"name":"Luka Modric","sku":"9781472977946","description":"THE FIRST AND ONLY AUTOBIOGRAPHY FROM REAL MADRID GALÁCTICO AND WORLD CUP SUPERSTAR LUKA MODRIC.\r\n\r\nFor the first time, Real Madrid galáctico and Croatian legend Luka Modric tells the story of his journey from a childhood in his war-torn homeland to becoming a serial UEFA Champions League winner and one of the most celebrated footballers in the world.\r\n\r\nRegarded as one of the great midfield players of the last 20 years, Luka reveals the difficulties of growing up during the Croatian War of Independence and his beginnings as a footballer. The FIFA World Cup finalist sets the record straight regarding key moments at Dinamo Zagreb, Tottenham Hotspur and Real Madrid; he gives us intimate insights into his treasured home life; and he brings us his personal account of his career peak - Croatia's dramatic path to the 2018 FIFA World Cup Final.\r\n\r\nWhat were his thoughts during decisive matches? What was his relationship with key players and coaches? What is the inner determination that keeps him on the pitch? What does it take to become the best footballer in the world?\r\n\r\nLuka was consistently underestimated in his early career, but through grit and determination ha has defied the expectations of everyone who doubted him, and reached the ultimate heights of world football. This is Luka Modric in his own words.","sale_price":1438,"quantity":2,"category_id":6,"enabled":1,"author":"Luka Modric","edition":1,"is_used_book":0,"publisher":"Bloomsbury Publishing","published_at":"2020-08-20","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/22143","created_at":"2022-01-30 12:35:31","updated_at":"2022-06-16 09:16:56","deleted_at":null,"number_of_pages":304,"weight":700,"slug":"luka-modric","is_hard_cover":1,"path":"\/books\/luka-modric","shareable_url":"https:\/\/booksmandala.com\/books\/luka-modric","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":22143,"disk":"uploads","directory":"1\/items","filename":"55334313._SY475_","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":26592,"created_at":"2022-01-30 12:35:31","updated_at":"2022-01-30 12:35:31","deleted_at":null,"pivot":{"mediable_id":31195,"media_id":22143,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":9694,"name":"Speaking with the angel","sku":"9780140297799","description":"Hear the Prime Minister explain to the House why he did a runner from Greenford Park service station and hitched a lift with a fifteen-year-old girl, as imagined by Robert Harris. Listen to someone who has a small hostile creature in his room, as told by Roddy Doyle.\r\n\r\nTwelve voices. Twelve completely new stories, narrated by twelve different characters. All written by twelve of the most exciting and popular writers around - including Helen Fielding, Zadie Smith, John O'Farrell, Patrick Marber, Irvine Welsh, Melissa Bank and Colin Firth.\r\n\r\nThis sparkling collection has been put together by Nick Hornby who also contributes an introduction about TreeHouse, an organisation that offers a unique and pioneering approach to the education of children with autism. £1 will go to TreeHouse with every copy sold of Speaking with the Angel.","sale_price":600,"quantity":2,"category_id":6,"enabled":1,"author":"Nick Hornby Robert Harris","edition":0,"is_used_book":0,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/9692","created_at":"2016-11-14 10:00:54","updated_at":"2020-09-25 08:25:57","deleted_at":null,"number_of_pages":240,"weight":145,"slug":"speaking-with-the-angel","is_hard_cover":0,"path":"\/books\/speaking-with-the-angel","shareable_url":"https:\/\/booksmandala.com\/books\/speaking-with-the-angel","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":9692,"disk":"uploads","directory":"1\/items","filename":"9780140297799","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":9050,"created_at":"2020-05-06 06:14:44","updated_at":"2020-05-06 06:14:44","deleted_at":null,"pivot":{"mediable_id":9694,"media_id":9692,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":6391,"name":"The great tamasha","sku":"9789382951162","description":"Bloomsbury Publishing, 2013. Soft cover. Condition: New. Dust Jacket Condition: New. 1st Edition. On a Bangalore night in April 2008, cricket and India changed forever. It was the first night of the Indian Premier League cricket, but not as we knew it. It involved big money, glitz, prancing girls and Bollywood stars. It was not so much sport as tamasha: a great entertainment.How a game and a country, both regarded as synonymous with infinite patience, managed to produce such an event. James Astill explains how India's economic surge and cricketing obsession made it the dominant power in world cricket, off the field if rarely on it. He tells how cricket has become the central focus of the world's second biggest nation: the place where power and money and celebrity and corruption all meet, to the rapt attention of a billion eyeballs.Astill crosses the subcontinent and over endless cups of tea, meets the people who make up modern India from faded princes to backstreet bookmakers, slum kids to squillionaires and sees how cricket shapes their lives and that of their country. Finally, in London he meets Indian cricket's fallen star, Lalit Modi, whose driving energy helped build this new form of cricket before he was dismissed in disgrace: a story that says much about modern India.It is a fascinating examination of the most important development in cricket today. A brilliant evocation of an endlessly beguiling country, it is also essential reading for anyone who wants to understand the workings of modern India. Seller Inventor","sale_price":638,"quantity":2,"category_id":6,"enabled":1,"author":"james astill","edition":0,"is_used_book":0,"publisher":"Bloomsbury Publishing","published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/5006","created_at":"2016-09-07 08:23:24","updated_at":"2022-06-14 07:50:31","deleted_at":null,"number_of_pages":290,"weight":440,"slug":"the-great-tamasha-1","is_hard_cover":0,"path":"\/books\/the-great-tamasha-1","shareable_url":"https:\/\/booksmandala.com\/books\/the-great-tamasha-1","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":5006,"disk":"uploads","directory":"1\/items","filename":"9789382951162","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":28870,"created_at":"2019-08-23 10:04:56","updated_at":"2019-08-23 10:04:56","deleted_at":null,"pivot":{"mediable_id":6391,"media_id":5006,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":19463,"name":"Football Leaks","sku":"9781783351404","description":"One anonymous football fan.  18.6 million confidential documents.  This is the explosive story of the biggest leak in sporting history - and the shady underworld of modern football. In 2016, a whistle-blower known only as 'John' started to leak a treasure trove of top-secret files to German newspaper Der Spiegel. These documents reveal the clandestine dealings of clubs, players and agents at the highest echelons of international football. And the story they tell is astonishing. From the eye-popping details of player transfers, including Neymar Jr, Pogba and Coutinho, to the loopholes and opaque tax structures that ensure maximum earnings for players and agents alike, this is a tale rife with rapacious greed and questionable deals. At the same time, it is the gripping story of a fan who wanted to free football from its corrupt overlords - and now finds himself on the run.","sale_price":798,"quantity":1,"category_id":6,"enabled":1,"author":"Rafael Buschmann","edition":0,"is_used_book":0,"publisher":"Guardian Faber Publishing","published_at":"2018-05-24","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/2235","created_at":"2019-02-05 13:14:13","updated_at":"2022-03-24 06:00:10","deleted_at":null,"number_of_pages":314,"weight":280,"slug":"football-leaks","is_hard_cover":0,"path":"\/books\/football-leaks","shareable_url":"https:\/\/booksmandala.com\/books\/football-leaks","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":2235,"disk":"uploads","directory":"1\/items","filename":"9781783351404","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":60624,"created_at":"2019-08-03 05:51:14","updated_at":"2019-08-03 05:51:14","deleted_at":null,"pivot":{"mediable_id":19463,"media_id":2235,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":12559,"name":"True to Form","sku":"9780062315311","description":"Radical in its simplicity, Dr. Eric Goodman’s visionary approach to mindful movement corrects the complacent adaptations that lead to back and joint pain, and teaches us to harness the body’s natural movement patterns into daily activities to make us fit, healthy, and pain free.Our sedentary lifestyle has led to an epidemic of chronic pain. By adapting to posture and movement that have us out of balance—including sitting all day at a keyboard, tilting our heads forward to look at our phones—we consistently compromise our joints, give our organs less room to function, and weaken our muscles. How we hold and live in our bodies is fundamental to our overall health, and the good news is that we all hold the key to a healthier body.Dr. Goodman has spent years studying human physiology and movement. He has trained world-class athletes for better performance, and has healed people of all ages and occupations of lifelong debilitating pain. His theory of self-healing is now available to everyone. His practical program trains the posterior muscle chain—shoulders, back, butt, and legs—shifting the burden of support away from joints and putting it back where it belongs: into large muscle groups.Filled with helpful diagrams and sixty color photographs, True to Form shows readers how to successfully integrate these powerful movements into everyday life—from playing with the kids to washing dishes to long hours in the office—transforming ordinary physical actions into active and mindful movements that help to eliminate pain, up your game, or simply feel more energetic. True to Form shows you how to move better, breathe better, and get back to using your body the way nature intended.","sale_price":958,"quantity":1,"category_id":6,"enabled":1,"author":"Eric Goodman","edition":0,"is_used_book":0,"publisher":"Harper Wave","published_at":"2016-05-17","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/7104","created_at":"2017-05-01 09:50:09","updated_at":"2020-06-10 06:58:17","deleted_at":null,"number_of_pages":224,"weight":760,"slug":"true-to-form","is_hard_cover":null,"path":"\/books\/true-to-form","shareable_url":"https:\/\/booksmandala.com\/books\/true-to-form","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":7104,"disk":"uploads","directory":"1\/items","filename":"9780062315311","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":16562,"created_at":"2019-09-27 10:57:18","updated_at":"2019-09-27 10:57:18","deleted_at":null,"pivot":{"mediable_id":12559,"media_id":7104,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":5136,"name":"The Beckoning Silence","sku":"9780099422433","description":"\"\"I had to stand there and watch while the rest of my life was determined by the shaky adhesion of a few millimetres of fractured ice and the dubious friction of a tiny point of metal in a hairline crack in a rock wall...\" Marking the climax of his climbing career, Joe Simpson confronts his fears and mountaineering history in an assault on the North Face of the Eiger. Since his epic battle for survival in the Andes, recounted in Touching the Void, Joe Simpson has experienced a life filled with adventure but marred by death. He has endured the painful attrition of climbing friends in accidents which call into question the perilously exhilarating activity to which he has devoted his whole life. Probability is inexorably closing in. The tragic loss of a close friend forces a momentous decision. It is time to turn his back on the mountains that he has loved. Never more alive than when most at risk, he has come to see a last climb on the mile-high North Face of the Eiger as the cathartic finale to his climbing career. In a narrative that takes the reader through extreme experiences from an avalanche in Bolivia, ice-climbing in the Alps and Colorado and paragliding in Spain -- before his final confrontation with the Eiger -- Simpson reveals the inner truth of climbing, exploring the power of the mind and the frailties of the body through intensely lived accounts of exhilaration and despair. The subject of his new book is the siren song of fear and his struggle to come to terms with it.","sale_price":638,"quantity":1,"category_id":6,"enabled":1,"author":"Joe Simpson","edition":0,"is_used_book":0,"publisher":"Random House","published_at":"2016-08-31","thumbnail_url":"https:\/\/covers.openlibrary.org\/b\/isbn\/9780099422433-L.jpg","created_at":"2016-08-31 13:19:09","updated_at":"2020-10-10 06:09:44","deleted_at":null,"number_of_pages":304,"weight":265,"slug":"the-beckoning-silence","is_hard_cover":0,"path":"\/books\/the-beckoning-silence","shareable_url":"https:\/\/booksmandala.com\/books\/the-beckoning-silence","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[]}],"links":{"first":"https:\/\/booksmandala.com\/api\/books?page=1","last":"https:\/\/booksmandala.com\/api\/books?page=13","prev":"https:\/\/booksmandala.com\/api\/books?page=6","next":"https:\/\/booksmandala.com\/api\/books?page=8"},"meta":{"current_page":7,"from":97,"last_page":13,"path":"https:\/\/booksmandala.com\/api\/books","per_page":16,"to":112,"total":200}}