{"data":[{"id":11794,"name":"Chinaman","sku":"9788184002850","description":"Some remember his impressive career stats ... others recall his on-field arrogance. Some say he fixed matches . . . others say he was dropped for being Tamil! Who exactly was Pradeep Mathew? And what became of him?\r\n\r\nWG Karunasena, a man who spent 64 years drinking arrack and watching cricket decides to find out ...If you have never seen a cricket match; or if you have and it has made you snore ...If you can’t understand why anyone would watch, let alone obsess over this dull game ...... then this IS the book for you","sale_price":560,"quantity":1,"category_id":6,"enabled":1,"author":"Shehan Karunatilaka","edition":0,"is_used_book":0,"publisher":null,"published_at":"2011-01-01","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/1658","created_at":"2017-02-03 08:14:05","updated_at":"2022-02-13 07:34:26","deleted_at":null,"number_of_pages":529,"weight":385,"slug":"chinaman","is_hard_cover":0,"path":"\/books\/chinaman","shareable_url":"https:\/\/booksmandala.com\/books\/chinaman","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":1655,"disk":"uploads","directory":"1\/items","filename":"9788184002850\t","extension":"jpeg","mime_type":"image\/jpeg","aggregate_type":"image","size":10697,"created_at":"2019-07-31 11:25:49","updated_at":"2019-07-31 11:31:55","deleted_at":"2019-07-31 11:31:55","pivot":{"mediable_id":11794,"media_id":1655,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}},{"id":1658,"disk":"uploads","directory":"1\/items","filename":"9788184002850","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":41589,"created_at":"2019-07-31 11:32:04","updated_at":"2019-07-31 11:32:04","deleted_at":null,"pivot":{"mediable_id":11794,"media_id":1658,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":2}}]},{"id":21015,"name":"Selection Day","sku":"9781501150838","description":"AN NPR BEST BOOK OF THE YEAR A NEW YORK TIMES and WASHINGTON POST NOTABLE BOOK From Aravind Adiga, the bestselling, Booker Prize­–winning author of The White Tiger, a dazzling new novel about two brothers in a Mumbai slum who are raised by their obsessive father to become cricket stars, and whose coming-of-age threatens their relationship, future, and sense of themselves.Manjunath Kumar is fourteen and living in a slum in Mumbai. He knows he is good at cricket—if not as good as his older brother, Radha. He knows that he fears and resents his domineering and cricket-obsessed father, admires his brilliantly talented sibling, and is fascinated by curious scientific facts and the world of CSI. But there are many things, about himself and about the world, that he doesn’t know. Sometimes it even seems as though everyone has a clear idea of who Manju should be, except Manju himself. When Manju meets Radha’s great rival, a mysterious Muslim boy privileged and confident in all the ways Manju is not, everything in Manju’s world begins to change, and he is faced by decisions that will challenge his understanding of it, as well as his own self. Filled with unforgettable characters from across India’s social strata—the old scout everyone calls Tommy Sir; Anand Mehta, the big-dreaming investor; Sofia, a wealthy, beautiful girl and the boys’ biggest fan—this book combines the best of The Art of Fielding and Slumdog Millionaire for a compulsive, moving story of adolescence and ambition, fathers, sons, and brothers. Selection Day is Adiga’s most absorbing, big-hearted novel to date, and proves why “with his gripping, amusing glimpse into the contradictions and perils of modern India, Aravind Adiga has cemented his reputation as the preeminent chronicler of his country’s messy present” (Newsweek).","sale_price":638,"quantity":1,"category_id":6,"enabled":1,"author":"Aravind Adiga","edition":1,"is_used_book":0,"publisher":"Simon and Schuster","published_at":"2017-01-03","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/7330","created_at":"2019-09-30 16:24:15","updated_at":"2020-09-06 11:43:30","deleted_at":null,"number_of_pages":304,"weight":565,"slug":"selection-day","is_hard_cover":1,"path":"\/books\/selection-day","shareable_url":"https:\/\/booksmandala.com\/books\/selection-day","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":7330,"disk":"uploads","directory":"1\/items","filename":"9781501150838","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":21287,"created_at":"2019-09-30 16:24:15","updated_at":"2019-09-30 16:24:15","deleted_at":null,"pivot":{"mediable_id":21015,"media_id":7330,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":1309,"name":"The Longest Climb","sku":"9780753515600","description":"The Longest Climb is the utterly compelling account of Dominic Faulkner's expedition from the Dead Sea to the peak of Everest. Dominic and his team, EverestMax, were the first ever to make this journey - a dangerous one, both politically and personally. Following much of the ancient Silk Road they cycled five thousand miles across Jordan, Syria, Turkey, Iran, Pakistan and India on the way to Tibet and the bottom of the world's highest mountain, where they prepared for the climb of their lives. \r\n\r\nFrom escaping the Syrian army and confronting Iranian mullahs, to deciding whether or not to share the little oxygen they have and risk their own lives in order to save another climber, The Longest Climb is a high-octane combination of the huge personal risk, fascinating cultural insight, and momentary farce that make up a major expedition. \r\n\r\nThe Longest Climb is not solely the story of an expedition. It is also the moving account of Dominic's struggle to finally accept the heartbreaking loss of his father when Dominic was just six. As he fights illness, broken equipment, lack of money and the gruelling demands of climbing Everest, Dominic also reflects upon what has driven him up this mountain. The answers are as affecting as they are extraordinary.","sale_price":1169,"quantity":1,"category_id":6,"enabled":1,"author":"Dominic Faulkner,Sir Ranulph Fiennes","edition":0,"is_used_book":0,"publisher":"Virgin Books Limited","published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/4700","created_at":"2016-08-22 12:05:02","updated_at":"2020-08-31 05:39:26","deleted_at":null,"number_of_pages":350,"weight":935,"slug":"the-longest-climb","is_hard_cover":0,"path":"\/books\/the-longest-climb","shareable_url":"https:\/\/booksmandala.com\/books\/the-longest-climb","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":4700,"disk":"uploads","directory":"1\/items","filename":"9780753515600","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":34285,"created_at":"2019-08-20 12:34:16","updated_at":"2019-08-20 12:34:16","deleted_at":null,"pivot":{"mediable_id":1309,"media_id":4700,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":10528,"name":"Climbing High","sku":"9781580050234","description":"On May 10, 1996, Lene Gammelgaard became the first female Scandinavian climber ever to make it to the top of Mount Everest. By nightfall, however, treacherous weather and human error conspired to turn triumph into catastrophe. Eight climbers, including her team leader and longtime friend, Scott Fischer, would ultimately perish. This gripping account, illustrated with photos, recounts vividly the author's experiences on Everest -- including the horrible night she spent huddled in the death zone with seven other climbers -- and puts the 1996 tragedy in a new perspective. Unlike Jon Krakauer, Gammelgaard was part of Fischer's team, and she sheds new light on this legendary climber's larger-than-life personality and leadership during the ascent. And unlike other climbers who wrote about the tragedy, Gammelgaard was an amateur whose only agenda was to conquer Everest.","sale_price":795,"quantity":1,"category_id":6,"enabled":1,"author":"Lene Gammelgaard","edition":0,"is_used_book":0,"publisher":"Seal Press (CA)","published_at":"1999-01-01","thumbnail_url":"https:\/\/covers.openlibrary.org\/b\/isbn\/9781580050234-L.jpg","created_at":"2016-11-27 08:01:13","updated_at":"2020-08-31 06:43:02","deleted_at":null,"number_of_pages":211,"weight":555,"slug":"climbing-high","is_hard_cover":1,"path":"\/books\/climbing-high","shareable_url":"https:\/\/booksmandala.com\/books\/climbing-high","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[]},{"id":28707,"name":"Bleachers","sku":"u9780099496595","description":"From the best-selling author of The Painted House, Skipping Christmas, and The Firm comes a nostalgic novel about high school football in a small Texas town, a place in which football has become a religion. High school all-American Neely Crenshaw was probably the best quarterback ever to play for the legendary Messina Spartans. Fifteen years have gone by since those glory days, and Neely has come home to Messina to bury Coach Eddie Rake, the man who molded the Spartans into an unbeatable football dynasty. Now, as Coach Rake's \"boys\" sit in the bleachers waiting for the dimming field lights to signal his passing, they replay the old games, relive the old glories, and try to decide once and for all whether they love Eddie Rake - or hate him. For Neely Crenshaw, a man who must finally forgive his coach, -- and himself, before he can get on with his life, the stakes are especially high.","sale_price":250,"quantity":1,"category_id":6,"enabled":1,"author":"John Grisham","edition":1,"is_used_book":1,"publisher":null,"published_at":"2004-01-01","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/19179","created_at":"2021-09-21 07:19:19","updated_at":"2021-09-21 07:19:19","deleted_at":null,"number_of_pages":181,"weight":130,"slug":"bleachers-3","is_hard_cover":0,"path":"\/books\/bleachers-3","shareable_url":"https:\/\/booksmandala.com\/books\/bleachers-3","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":19179,"disk":"uploads","directory":"1\/items","filename":"download - 2021-09-21T130410.684","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":7427,"created_at":"2021-09-21 07:19:19","updated_at":"2021-09-21 07:19:19","deleted_at":null,"pivot":{"mediable_id":28707,"media_id":19179,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":1317,"name":"A Slender Thread","sku":"9781560252986","description":"Stephen Venables and three companions made the first ascent of Panchu Chuli V—a remote Himalayan peak on the borders of India, Nepal and Tibet. A rappel anchor failed on the descent, pitching Venables into a 300-foot fall. Crashing through the black night, flung from rock to rock, he assumed that he was plunging to his death. Against all odds he survived, but was left stranded 19,000 feet above a labyrinth of glaciers and snow slopes with two broken legs, the threat of gangrene, and scant food or medical supplies. If he was to return to his wife and son waiting at home some 5000 miles away, Venables knew he had to draw on his reserve of courage and determination. The third Adrenaline Classic, A Slender Thread is a spellbinding account of Venables' survival—and his intense personal struggle to understand the risks he takes for the sake of his insatiable passion for climbing. He comes as close to anyone to answering the unanswerable question: Why do they do it?","sale_price":640,"quantity":1,"category_id":6,"enabled":1,"author":"Stephen Venables,Clint Willis","edition":0,"is_used_book":0,"publisher":"Da Capo Press","published_at":null,"thumbnail_url":"https:\/\/covers.openlibrary.org\/b\/isbn\/9781560252986-L.jpg","created_at":"2016-08-22 12:16:35","updated_at":"2020-08-31 05:36:10","deleted_at":null,"number_of_pages":237,"weight":425,"slug":"a-slender-thread","is_hard_cover":0,"path":"\/books\/a-slender-thread","shareable_url":"https:\/\/booksmandala.com\/books\/a-slender-thread","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[]},{"id":25642,"name":"The Autobiography","sku":"9780241401446","description":"He is the greatest batsman to ever play for England's Cricket Team, one of the most gifted players in the world, but in 2018 he played his final game. At 33, Alastair Cook announced his retirement from sport. The English Cricket Team was left reeling and, ahead of the Ashes, on a burning search for a player worthy of his place. Now, he tells a no-holds-barred, close-up account of his last chapter, his 33rd and last Test hundred, an intimate tale of his life: his family, of the man he is today and the man he will be - after cricket. An icon, a role model and one of the loveliest men alive, Alastair is lauded as a person as well as a player and this is his never-before-heard story.","sale_price":798,"quantity":1,"category_id":6,"enabled":1,"author":"Sir Alastair Cook","edition":1,"is_used_book":0,"publisher":"Penguin UK","published_at":"2020-05-14","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/14869","created_at":"2020-10-11 12:40:33","updated_at":"2022-03-27 08:58:35","deleted_at":null,"number_of_pages":384,"weight":320,"slug":"the-autobiography-1","is_hard_cover":0,"path":"\/books\/the-autobiography-1","shareable_url":"https:\/\/booksmandala.com\/books\/the-autobiography-1","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":14869,"disk":"uploads","directory":"1\/items","filename":"9780241401446","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":98501,"created_at":"2020-10-11 12:40:33","updated_at":"2020-10-11 12:40:33","deleted_at":null,"pivot":{"mediable_id":25642,"media_id":14869,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":21305,"name":"Bushcraft Illustrated","sku":"9781507209028","description":"From Dave Canterbury—wilderness expert, New York Times bestselling author, and YouTube sensation—comes a fully illustrated guide to everything you need to know to hone your bushcraft, or wilderness survival skills, from types of shelter, to useful tools, to edible plants—and much more!Before you venture into the wilderness, learn exactly what you need to bring and what you need to know with this ultimate outdoor reference guide, by survivalist expert Dave Canterbury. Filled with more than 300 illustrations, Bushcraft Illustrated showcases the necessary tools and skills for an awesome outdoor adventure, including such as: Packs: Learn the different types and how to craft and pack your own. Cordage: Essential knot knowledge for outdoor survival. Firecraft: How to start a fire with a variety of materials. Trapping: Tips for catching small game. Plants: A catalog of edible plants to forage.  …And much more! With its many helpful illustrations and detailed, easy-to-follow instructions, this illustrated Bushcraft guide is a must-have for the seasoned outdoor lover and adventure novice alike!","sale_price":1438,"quantity":1,"category_id":6,"enabled":1,"author":"Dave Canterbury","edition":1,"is_used_book":0,"publisher":"Adams Media","published_at":"2019-05-07","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/7745","created_at":"2019-10-22 11:32:13","updated_at":"2021-06-07 06:51:04","deleted_at":null,"number_of_pages":252,"weight":775,"slug":"bushcraft-illustrated","is_hard_cover":null,"path":"\/books\/bushcraft-illustrated","shareable_url":"https:\/\/booksmandala.com\/books\/bushcraft-illustrated","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":7745,"disk":"uploads","directory":"1\/items","filename":"9781507209028","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":23922,"created_at":"2019-10-22 11:32:13","updated_at":"2019-10-22 11:32:13","deleted_at":null,"pivot":{"mediable_id":21305,"media_id":7745,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":16191,"name":"Messi Vs Ronaldo 2018","sku":"9781785782770","description":"For years, the rivalry between Real Madrid and Barcelona has defined top-level European football. At its heart: a personal battle- Messi vs Ronaldo. Since they were first pitted against each other in 2007, the two men's domination of the record books has been unparalleled. Their styles, personalities and footballing allegiances continue to divide opinion but one thing is beyond doubt: this is football's greatest ever head-to-head. In this new edition of Messi vs Ronaldo, updated to include all the action from 2016\/17, Luca Caioli draws on the exclusive testimonies of managers, teammates, friends and family to tell the inside story of this momentous rivalry.","sale_price":638,"quantity":1,"category_id":6,"enabled":1,"author":"Luca Caioli","edition":0,"is_used_book":0,"publisher":"Icon Books","published_at":"2018-01-02","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/4478","created_at":"2018-03-28 12:39:49","updated_at":"2021-01-30 09:38:47","deleted_at":null,"number_of_pages":240,"weight":165,"slug":"messi-vs-ronaldo-2018","is_hard_cover":null,"path":"\/books\/messi-vs-ronaldo-2018","shareable_url":"https:\/\/booksmandala.com\/books\/messi-vs-ronaldo-2018","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":4478,"disk":"uploads","directory":"1\/items","filename":"9781785782770","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":149896,"created_at":"2019-08-18 10:27:25","updated_at":"2019-08-18 10:27:25","deleted_at":null,"pivot":{"mediable_id":16191,"media_id":4478,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":30017,"name":"BARCA","sku":"9781780725260","description":"\"From the bestselling co-author of Soccernomics comes the story of how FC Barcelona became the most successful football club in the world - and how that envied position now hangs in the balance. Barça is not just the world's most popular sports club, it is simply one of the most influential organisations on the planet. With almost 250 million followers on social media and 4 million visitors to its Camp Nou stadium each year, there's little wonder its motto is 'More than a club'. But it was not always so. In the past three decades, Barcelona has transformed from regional team to global powerhouse, becoming a model of sporting excellence and a consistent winner of silverware. Simon Kuper unravels exactly how these transformations took place. He outlines the organisational structure behind the club's business decisions, and details the work of its coaches, medics, data analysts and nutritionists who have revolutionised the sporting world. And, of course, he studies the towering influence of the club's two greatest legends, Johan Cruyff and Lionel Messi. Like many leading global businesses, FC Barcelona closely guards its secrets, granting few outsiders a view behind the scenes. But, after decades of writing about the sport and the club, Kuper was given unprecedented access to the inner sanctum and to the people who strive daily to keep Barcelona at the top. Erudite, personal, and capturing all the latest successes and upheavals, his portrait of this incredible institution goes beyond football to understand Bar a as a unique social, cultural, and political phenomenon\"--Publisher's description.","sale_price":1278,"quantity":1,"category_id":6,"enabled":1,"author":"SIMON. KUPER","edition":1,"is_used_book":0,"publisher":null,"published_at":"2021-01-01","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/20652","created_at":"2021-11-13 11:45:11","updated_at":"2022-06-21 08:19:03","deleted_at":null,"number_of_pages":360,"weight":515,"slug":"barca","is_hard_cover":0,"path":"\/books\/barca","shareable_url":"https:\/\/booksmandala.com\/books\/barca","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":20652,"disk":"uploads","directory":"1\/items","filename":"9781780725260","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":46656,"created_at":"2021-11-13 11:45:12","updated_at":"2021-11-13 11:45:12","deleted_at":null,"pivot":{"mediable_id":30017,"media_id":20652,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":31313,"name":"Miracle at Augusta","sku":"u9781780893730","description":"An inspiring story of hope, redemption, and trying to hit the ball straight  A little over a year ago, Travis McKinley, an unknown rookie, shocked the world by winning the US Senior Open at Pebble Beach. Now he's famous, he makes his living playing the game he loves, and everything should be perfect. Still, Travis can't shake the feeling that he's a fraud, an imposter who doesn't deserve his success - and after a series of disappointments and, to be honest, personal screw-ups, he might just prove himself right. A shot at redemption arrives in an unexpected form: a teenage outcast with troubles of his own - and a natural golf swing. As this unlikely duo sets out to achieve the impossible on the world's most revered golf course, Travis is about to learn that sometimes the greatest miracles of all take place when no one is watching.","sale_price":250,"quantity":1,"category_id":6,"enabled":1,"author":"James Patterson,Peter de Jonge","edition":1,"is_used_book":1,"publisher":"Random House","published_at":"2015-03-26","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/22315","created_at":"2022-02-13 09:08:32","updated_at":"2022-02-13 09:08:32","deleted_at":null,"number_of_pages":240,"weight":280,"slug":"miracle-at-augusta","is_hard_cover":0,"path":"\/books\/miracle-at-augusta","shareable_url":"https:\/\/booksmandala.com\/books\/miracle-at-augusta","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":22315,"disk":"uploads","directory":"1\/items","filename":"23346802","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":101597,"created_at":"2022-02-13 09:08:32","updated_at":"2022-02-13 09:08:32","deleted_at":null,"pivot":{"mediable_id":31313,"media_id":22315,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":12882,"name":"The inner Game of Golf","sku":"9781447288480","description":"Every golfer, whether amateur or pro, who has ever picked up a club knows what it's like to get the yips - that feeling when you inexplicably lose control of your shot, and become overwhelmed by self-doubt, tension, fear of failure and anxiety. With a new introduction from golf performance pro Peter Hudson, the multi-million bestselling The Inner Game of Golf resolves this mental interference. It is not a book about how to play golf; it is a book about how to learn golf, and its lessons can be applied to any sport. Putting aside the mechanics of golfing technique and laborious debates about strategy, this classic handbook for golfers of all levels tackles the psychological aspects of the game and reveals how you can perform to your true potential for more than brief moments at a time. Using only his Inner Game principles, without taking a single lesson and playing only once a week, Timothy Gallwey knocked 15 strokes off his game in a year. There is no physical reason why you can't hit perfect drives or sink long putts more consistently. By applying the Inner Game approach to your own game, you too can see phenomenal improvements to your scorecard. Author BiographyEver since Timothy Gallwey missed a heartbreakingly easy volley on match point in the National Junior Tennis Championship at the age of fifteen, he has been fascinated with the problem of how human beings interfere with their own ability to achieve and learn. His search for practical ways to overcome the mental obstacles that prevent maximum performance led to the basic discoveries first described in this, his bestselling classic. - The Inner Game Of Golf By W.timothy Gallwey (Paperback)","sale_price":638,"quantity":1,"category_id":6,"enabled":1,"author":"W. Timothy Gallwey","edition":0,"is_used_book":0,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/9632","created_at":"2017-06-22 11:49:32","updated_at":"2022-05-28 13:00:25","deleted_at":null,"number_of_pages":243,"weight":220,"slug":"the-inner-game-of-golf","is_hard_cover":0,"path":"\/books\/the-inner-game-of-golf","shareable_url":"https:\/\/booksmandala.com\/books\/the-inner-game-of-golf","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":9632,"disk":"uploads","directory":"1\/items","filename":"9781447288480","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":21783,"created_at":"2020-05-03 08:30:17","updated_at":"2020-05-03 08:30:17","deleted_at":null,"pivot":{"mediable_id":12882,"media_id":9632,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":13400,"name":"Simply Guitar","sku":"9781741575347","description":null,"sale_price":595,"quantity":1,"category_id":6,"enabled":1,"author":"Steve MacKay","edition":0,"is_used_book":0,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/covers.openlibrary.org\/b\/isbn\/9781741575347-L.jpg","created_at":"2017-07-16 13:35:57","updated_at":"2021-02-21 05:25:16","deleted_at":null,"number_of_pages":64,"weight":295,"slug":"simply-guitar","is_hard_cover":0,"path":"\/books\/simply-guitar","shareable_url":"https:\/\/booksmandala.com\/books\/simply-guitar","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[]},{"id":18522,"name":"Thierry Henry","sku":"9781447236832","description":"'The football book of the year' Ian Herbert, Independent Thierry Henry - gifted, charismatic and a genuinely world-class footballer - has passed into Arsenal legend as the hero of a team that finally ended Manchester United's dominance. But as he approached the autumn of his career, Thierry's crown began to slip - from the infamous 'Hand of Gaul' incident to a dismal World Cup 2010 campaign. Suddenly, a player who Arsene Wenger once dubbed 'the greatest striker ever', a man who had spent his career at the very top of the game, began to learn how lonely such a position could be. Drawing from numerous interviews and impeccable sources, as well as his own observations over the course of Henry's entire career, award-winning author Philippe Auclair has produced the most complete portrait of the Arsenal hero ever to be written. Clear-eyed, lyrical and passionately argued, Thierry Henry: Lonely at the Top is as raw, shocking and thought-provoking as it is celebratory of Henry's outstanding flair and talent. 'Superb ...a thoroughly recommended read' James Olley, Evening Standard 'Illuminated by finely turned phrases and vivid insights' Richard Williams, Guardian Sports Books of the Year","sale_price":798,"quantity":1,"category_id":6,"enabled":1,"author":"Philippe Auclair","edition":0,"is_used_book":0,"publisher":"Pan Macmillan Adult","published_at":"2013-07-18","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/7295","created_at":"2018-12-26 20:39:28","updated_at":"2021-12-14 11:05:29","deleted_at":null,"number_of_pages":336,"weight":255,"slug":"thierry-henry","is_hard_cover":0,"path":"\/books\/thierry-henry","shareable_url":"https:\/\/booksmandala.com\/books\/thierry-henry","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":7295,"disk":"uploads","directory":"1\/items","filename":"download (2)","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":10482,"created_at":"2019-09-30 15:25:59","updated_at":"2019-09-30 15:25:59","deleted_at":null,"pivot":{"mediable_id":18522,"media_id":7295,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":25200,"name":"Open","sku":"U9780751535969","description":"In June 2002, the US Open was played, for the first time in history, on a true public golf course. Bethpage State Park is owned by the state of New York, and no membership is required to play there. This is golf at its most populist, most pure - and most challenging. In what Tiger Woods himself would declare 'the most difficult national championship', Sergio Garcia, Phil Mickelson, Nick Faldo and the rest would, through days of rain and roughs, learn the hard way that while Bethpage may be open to the public, even for the pros the chance of winning can be closed off to mere mortals. The Bethpage course was so challenging that only one player finished under par; this was golf at its most intense. With unprecedented backstage access, John Feinstein finally removes the mystery shrouding golf's most famous event, unravelling how pairings are made; qualifiers; setting up the golf course; and all the complexities of bringing golf's most exclusive competition to a truly public setting. In fascinating detail, Feinstein takes readers through every step, every thorny hole, every bitter rivalry of one of golf's greatest tournaments.","sale_price":250,"quantity":1,"category_id":6,"enabled":1,"author":"John Feinstein","edition":1,"is_used_book":1,"publisher":"Sphere","published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/13770","created_at":"2020-08-21 09:54:47","updated_at":"2020-08-21 09:54:47","deleted_at":null,"number_of_pages":384,"weight":330,"slug":"open","is_hard_cover":0,"path":"\/books\/open","shareable_url":"https:\/\/booksmandala.com\/books\/open","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":13770,"disk":"uploads","directory":"1\/items","filename":"9780751535969","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":30506,"created_at":"2020-08-21 09:54:47","updated_at":"2020-08-21 09:54:47","deleted_at":null,"pivot":{"mediable_id":25200,"media_id":13770,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":18040,"name":"No Spin: My Autobiography","sku":"9781785037719","description":"'My story, without the spin.' From the start of his glittering career in 1992, to his official retirement from all formats of the game in 2013, Shane Warne has long desired to tell his incredible story without compromise. No Spin is that very story. It will offer a compelling intimate voice, true insight and a pitch-side seat to one of cricket's finest eras, making this one of the ultimate must-have sports autobiographies. Shane is not only one of the greatest living cricket legends: he is as close as the game has had since Botham to a maverick genius on the field and a true rebel spirit off it, who always gives audiences what they want. Despite being the talismanic thorn in England's side for nearly two decades of regular Ashes defeats, he was also much loved in the UK where he played cricket for Hampshire. He's also a much-admired figure in India and South Africa. Alongside his mesmerising genius as a bowler, Shane has often been a controversial figure, and in this book he's talk with brutal honesty about some of the most challenging times in his life as a player. Honest, thoughtful, fearless and loved by millions, Shane is always his own man and this book is a testament to his brilliant career.","sale_price":1118,"quantity":1,"category_id":6,"enabled":1,"author":"Shane Warne","edition":0,"is_used_book":0,"publisher":"Ebury Press","published_at":"2018-10-04","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/4594","created_at":"2018-10-30 17:21:52","updated_at":"2021-04-22 11:03:15","deleted_at":null,"number_of_pages":384,"weight":530,"slug":"no-spin-my-autobiography","is_hard_cover":0,"path":"\/books\/no-spin-my-autobiography","shareable_url":"https:\/\/booksmandala.com\/books\/no-spin-my-autobiography","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":4594,"disk":"uploads","directory":"1\/items","filename":"9781785037719","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":9022,"created_at":"2019-08-19 13:35:21","updated_at":"2019-08-19 13:35:21","deleted_at":null,"pivot":{"mediable_id":18040,"media_id":4594,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]}],"links":{"first":"https:\/\/booksmandala.com\/api\/books?page=1","last":"https:\/\/booksmandala.com\/api\/books?page=13","prev":"https:\/\/booksmandala.com\/api\/books?page=7","next":"https:\/\/booksmandala.com\/api\/books?page=9"},"meta":{"current_page":8,"from":113,"last_page":13,"path":"https:\/\/booksmandala.com\/api\/books","per_page":16,"to":128,"total":200}}