{"data":[{"id":20112,"name":"Rock Climbing","sku":"9781594858628","description":"* Approximately 35 new techniques, safety considerations, and subjects * National Outdoor Book Award winner in first edition * First edition of this popular title has sold 50,000 copies  Thousands of rock climbers have learned the sport using Craig Luebben's seminal and bestselling text, Rock Climbing: Mastering Basic Skills. Now Craig's friend and fellow climber Topher Donahue brings the content up to current standards and includes technological advances, while preserving Craig's comprehensive approach. An award-winning climber in his own right, Topher uses his writing and photography skills to simplify the complex world of modern climbing technique and reveals thethought process behind safe and practical climbing methods.  This second edition includes European climbing techniques that offer alternatives to those traditionally taught in North America. Topher has also incorporated new lessons derived from accidents due, in part, to the increased popularity of climbing. Also found in this edition:  * Over 10,000 more words and 125 more photos * Three never-before-published techniques: Adjustable Hitch, High Friction Tubes, and Bight Method * Detailed technical updates throughout * New distinction between \"anchor\" (a group of placements, pieces, or bolts used at the end of a pitch or for top rope or rappel setup) and \"placement\" or \"piece\" (individual cams, nuts, etc., used in groups to make an anchor or used individually as protection on a pitch)","sale_price":2747,"quantity":1,"category_id":6,"enabled":1,"author":"Topher Donahue,Craig Luebben","edition":0,"is_used_book":0,"publisher":null,"published_at":"2014-09-01","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/4706","created_at":"2019-04-25 16:20:51","updated_at":"2020-08-31 05:27:48","deleted_at":null,"number_of_pages":348,"weight":640,"slug":"rock-climbing","is_hard_cover":0,"path":"\/books\/rock-climbing","shareable_url":"https:\/\/booksmandala.com\/books\/rock-climbing","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":4706,"disk":"uploads","directory":"1\/items","filename":"9781594858628","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":14281,"created_at":"2019-08-20 12:43:50","updated_at":"2019-08-20 12:43:50","deleted_at":null,"pivot":{"mediable_id":20112,"media_id":4706,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":20117,"name":"The ABCs of Avalanche Safety","sku":"9780898868852","description":"A respected authority since 1961, this pocket sized guide about avoiding avalanches has been updated with the latest in technology and technique.","sale_price":951,"quantity":1,"category_id":6,"enabled":1,"author":"Sue A. Ferguson,Edward R. LaChapelle","edition":0,"is_used_book":0,"publisher":"The Mountaineers Books","published_at":"2003-01-01","thumbnail_url":"https:\/\/covers.openlibrary.org\/b\/isbn\/9780898868852-L.jpg","created_at":"2019-04-25 16:45:45","updated_at":"2020-08-31 06:43:00","deleted_at":null,"number_of_pages":141,"weight":115,"slug":"the-abcs-of-avalanche-safety","is_hard_cover":0,"path":"\/books\/the-abcs-of-avalanche-safety","shareable_url":"https:\/\/booksmandala.com\/books\/the-abcs-of-avalanche-safety","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[]},{"id":28312,"name":"My Manchester United Years","sku":"u9780755316205","description":"Bobby Charlton is Manchester United through and through. He was a member of the original Busby Babes and has devoted his career to the club, playing in 754 games over 17 years. During that period he won everything the game had to offer, played alongside some of the greats such as Best and Law, suffered devastating defeats and was involved in one of the greatest football tragedies of all time. Here, for the very first time, he tells the story of those United years. With his beloved Reds he tasted FA Cup victory in the emotional final of 1963, won three first division championships and in 1968 he reached the pinnacle of club success, winning the European Cup. Inevitably, such highs are balanced with no less dramatic lows, such as the 1957 European Cup semi-final, the highly charged 1958 FA Cup loss which followed only weeks after the horrors of the Munich Air disaster, and the 1969 European Cup defeat by Milan. He is one of the true gentlemen of football and the legacy that Bobby Charlton gives to United is beyond compare.","sale_price":250,"quantity":1,"category_id":6,"enabled":1,"author":"Bobby Charlton","edition":1,"is_used_book":1,"publisher":"Headline Book Pub Limited","published_at":"2008-01-01","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/18732","created_at":"2021-09-10 12:11:08","updated_at":"2022-05-03 08:29:00","deleted_at":null,"number_of_pages":437,"weight":360,"slug":"my-manchester-united-years","is_hard_cover":0,"path":"\/books\/my-manchester-united-years","shareable_url":"https:\/\/booksmandala.com\/books\/my-manchester-united-years","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":18732,"disk":"uploads","directory":"1\/items","filename":"3339733._SX318_SY475_","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":44935,"created_at":"2021-09-10 12:11:08","updated_at":"2021-09-10 12:11:08","deleted_at":null,"pivot":{"mediable_id":28312,"media_id":18732,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":16550,"name":"Your 15th Club","sku":"9781847392862","description":"All golfers have fourteen clubs in their bag, but the real winners have a little something extra—that mental attitude that puts their game above the others. Dr. Bob Rotella, author of the bestselling book Golf Is Not a Game of Perfect, brings together his skills and years of experience as a golf psychologist to give readers the insight they need to improve their game—before they ever step up to the tee.\r\n\r\nThe 15th Club is the tool that golf stars like Tiger Woods use to block out negative thoughts, doubt, and fear. It is what allows champions to perform at their peak both in practice and during the game. Golfers who lack it find the game elusive and frustrating. Confident golfers play the game as they have always sensed they could play it. Now, one of the most renowned golf writers offers up the foolproof methods that will allow golfers at any skill level to give their game that extra boost.\r\n\r\nDr. Rotella provides tips and techniques for how to learn from better golfers, overcome fear in pressure situations, and keep a clear mind, no matter what. He tells golfers that inner arrogance is not a negative trait, but instead is something that can improve performance on and off the course. In order to perform at peak levels and achieve your goals, you must believe that you can win. Positive thinking is an incredibly powerful tool, and it can change the way a player approaches the game. Knowing how to focus on the challenge at hand and understanding your own talent are crucial parts of becoming a confident golfer.\r\n\r\nDr. Rotella provides a detailed plan that anyone can use to build the self-image of a winner. He offers a one-year schedule in diary and calendar form that will incorporate the daily mental routines that he assigns to players on the PGA Tour. This is how the pros learn to ignore negative influences, focus on productive advice, and take pride in their abilities.\r\n\r\nYour 15th Club will tell golfers of all abilities how to develop the confidence they need to maximize their physical gifts and defeat the Tigers of their world, whether that world is the PGA Tour or the third flight of the club championship.","sale_price":798,"quantity":1,"category_id":6,"enabled":1,"author":"Bob Rotella,Robert J. Rotella","edition":0,"is_used_book":0,"publisher":"Pocket Books","published_at":"2009-06-01","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/10704","created_at":"2018-05-17 11:55:36","updated_at":"2020-08-30 09:12:18","deleted_at":null,"number_of_pages":191,"weight":160,"slug":"your-15th-club","is_hard_cover":0,"path":"\/books\/your-15th-club","shareable_url":"https:\/\/booksmandala.com\/books\/your-15th-club","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":10704,"disk":"uploads","directory":"1\/items","filename":"9781847392862","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":37082,"created_at":"2020-06-03 11:56:19","updated_at":"2020-06-03 11:56:19","deleted_at":null,"pivot":{"mediable_id":16550,"media_id":10704,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":3498,"name":"INSATIABLE","sku":"9780224076807","description":"Bill 'EL Wingador' Simmons, Sonya 'The Black Widow' Thomas, David 'Coondog' O'Karma, Bill 'EL Wingador' Simmons, Sonya 'The Black Widow' Thomas, David 'Coondog' O'Karma, Eric 'Badlands' Booker, Timothy 'Eater X' Janus - just a few of the stars of one of America's fastest growing sports: competitive eating. In a country in which a third of the population is clinically obese, competitive eating has made the leap from trestle tables and paper napkins to stadium arenas - in the past two years, more than 1.4 million households have tuned in to Nathan's hot dog contest on ESPN.  Beginning with a trip to Japan in search of the elusive (and surprising slim-line) champion Takeru Kobayashi and ending up at the sport's annual grand finale in Coney Island, Jason Fagone spends a year with the stars of the scene, watching as they eat their way into (or out of) oblivion, and finding out just what compels a 'gurgitator' to force down forty-six dozen oysters in ten minutes. Wickedly funny and devastatingly insightful, Jason Fagone uses this weirdest of sports as a lens through which to examine the dark side of the American Dream - the never-ending quest for wealth, celebrity, possessions and food. And along the way, he uncovers the wonderfully human stories at the heart of this seemingly unnourished corner of American culture. Bigger, better, richer, fatter, Insatiable unlocks a world we all need to face up to. Dig In.","sale_price":700,"quantity":1,"category_id":6,"enabled":1,"author":"JASON FAGONE","edition":0,"is_used_book":0,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/covers.openlibrary.org\/b\/isbn\/9780224076807-L.jpg","created_at":"2016-08-28 09:35:52","updated_at":"2020-09-22 08:32:31","deleted_at":null,"number_of_pages":302,"weight":255,"slug":"insatiable-1","is_hard_cover":0,"path":"\/books\/insatiable-1","shareable_url":"https:\/\/booksmandala.com\/books\/insatiable-1","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[]},{"id":24751,"name":"Hand of God","sku":"U9781784081591","description":"The beautiful game just got deadly. London City is playing in Athens, and football manager Scott Manson is keeping his team on a tight leash. He needs them home in one piece for a crucial match at Silvertown Docks. But Scott didn't plan for death on the pitch. As the Greek authorities are mounting a murder investigation, Scott must find the truth – and fast – to get his boys home in time.","sale_price":250,"quantity":1,"category_id":6,"enabled":1,"author":"Philip Kerr","edition":1,"is_used_book":1,"publisher":null,"published_at":"2015-11-01","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/13332","created_at":"2020-08-14 11:02:02","updated_at":"2021-02-01 13:06:16","deleted_at":null,"number_of_pages":400,"weight":295,"slug":"hand-of-god","is_hard_cover":0,"path":"\/books\/hand-of-god","shareable_url":"https:\/\/booksmandala.com\/books\/hand-of-god","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":13332,"disk":"uploads","directory":"1\/items","filename":"9781784081591","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":100878,"created_at":"2020-08-14 11:02:02","updated_at":"2020-08-14 11:02:02","deleted_at":null,"pivot":{"mediable_id":24751,"media_id":13332,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":1200,"name":"High Crimes","sku":"9781401309848","description":"High Crimes is journalist Michael Kodas's gripping account of life on top of the world--where man is every bit as deadly as Mother Nature. In the years following the publication of Into Thin Air, much has changed on Mount Everest. Among all the books documenting the glorious adventures in mountains around the world, none details how the recent infusion of wealthy climbers is drawing crime to the highest place on the planet. The change is caused both by a tremendous boom in traffic, and a new class of parasitic and predatory adventurer. It's likely that Jon Krakauer would not recognize the camps that he visited on Mount Everest almost a decade ago. This book takes readers on a harrowing tour of the criminal underworld on the slopes of the world's most majestic mountain. High Crimes describes two major expeditions: the tragic story of Nils Antezana, a climber who died on Everest after he was abandoned by his guide; as well as the author's own story of his participation in the Connecticut Everest Expedition, guided by George Dijmarescu and his wife and climbing partner, Lhakpa Sherpa. Dijmarescu, who at first seemed well-intentioned and charming, turned increasingly hostile to his own wife, as well as to the author and the other women on the team. By the end of the expedition, the three women could not travel unaccompanied in base camp due to the threat of violence. Those that tried to stand against the violence and theft found that the worst of the intimidation had followed them home to Connecticut. Beatings, thefts, drugs, prostitution, coercion, threats, and abandonment on the highest slopes of Everest and other mountains have become the rule rather than the exception. Kodas describes many such experiences, and explores the larger issues these stories raise with thriller-like intensity.","sale_price":512,"quantity":1,"category_id":6,"enabled":1,"author":"Michael Kodas","edition":0,"is_used_book":0,"publisher":"Hyperion","published_at":null,"thumbnail_url":"https:\/\/covers.openlibrary.org\/b\/isbn\/9781401309848-L.jpg","created_at":"2016-08-22 08:48:27","updated_at":"2022-05-03 14:08:51","deleted_at":null,"number_of_pages":357,"weight":340,"slug":"high-crimes","is_hard_cover":0,"path":"\/books\/high-crimes","shareable_url":"https:\/\/booksmandala.com\/books\/high-crimes","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[]},{"id":9136,"name":"50 years of Golfing Wisdom","sku":"9780060884765","description":"John Jacobs is one of golf's all-time great teachers, a true legend of the game who has passed on his words of wisdom to thousands of amateurs as well as to some of the world's greatest players over the last 50 years. Now, for the first time ever, the pick of his collective wisdom has been brought together in one seminal volume.   When the likes of Butch Harmon and David Leadbetter heap praise on your methods and credit you with having helped shape the way they learned their craft and how they applied those teachings, you know that you must be one of the most important and influential figures in the world of golf.   Not only a great teacher, John Jacobs was also good enough to play in the Ryder Cup and beat the best in the game. Those who witnessed his memorable victory over Grand Slam winner Gary Player in the final of the South African Match Play Championship knew they were in the presence of someone special -- a talent that was able to use all his experience as a top-level player and move seamlessly into the world of golf teaching.   50 Years of Golfing Wisdom features all the lessons and advice that made Jacobs the original and, many still say, the ultimate golfing guru. Every department of the game receives the Jacobs treatment -- from the fundamentals of grip and swing to problem solving and curing your bad shots, to instruction on hitting every shot from the longest drive to the shortest putt, including everything in between.   Simple, easy-to-understand, effective advice on how to maximize your potential and play your best golf -- this may just be the only golf instruction book you'll ever need.","sale_price":400,"quantity":1,"category_id":6,"enabled":1,"author":"John Jacobs","edition":0,"is_used_book":0,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/covers.openlibrary.org\/b\/isbn\/9780060884765-L.jpg","created_at":"2016-11-06 12:21:54","updated_at":"2022-06-10 06:39:21","deleted_at":null,"number_of_pages":272,"weight":430,"slug":"50-years-of-golfing-wisdom","is_hard_cover":1,"path":"\/books\/50-years-of-golfing-wisdom","shareable_url":"https:\/\/booksmandala.com\/books\/50-years-of-golfing-wisdom","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[]},{"id":30130,"name":"White Cap and Bails","sku":"u9780340750889","description":"In this new anecdotal book, the unstoppable Dickie Bird takes one County Cricket Club at a time and revisits each with the aid of memorabilia, statistics, books and videos. A mass of new hilarious stories flow from Dickie as he flexes his memory: he describes the cricketers, the matches and the character of these clubs. Dickie also relives his journeys as a umpire to clubs and Test match arenas overseas and recalls the humorous times that have filled his unique career. A must have for cricket enthusiasts everywhere.","sale_price":250,"quantity":1,"category_id":6,"enabled":1,"author":"Dickie Bird","edition":1,"is_used_book":1,"publisher":"Hodder Paperback","published_at":"2000-01-01","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/20780","created_at":"2021-11-27 07:36:48","updated_at":"2021-11-27 07:36:48","deleted_at":null,"number_of_pages":480,"weight":315,"slug":"white-cap-and-bails","is_hard_cover":0,"path":"\/books\/white-cap-and-bails","shareable_url":"https:\/\/booksmandala.com\/books\/white-cap-and-bails","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":20780,"disk":"uploads","directory":"1\/items","filename":"2728259","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":23535,"created_at":"2021-11-27 07:36:48","updated_at":"2021-11-27 07:36:48","deleted_at":null,"pivot":{"mediable_id":30130,"media_id":20780,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":10164,"name":"Open; an autobiography","sku":"9780007416790","description":"From Andre Agassi, one of the most beloved athletes in history and one of the most gifted men ever to step onto a tennis court, a beautiful, haunting autobiography.\r\n\r\nAgassi’s incredibly rigorous training begins when he is just a child. By the age of thirteen, he is banished to a Florida tennis camp that feels like a prison camp. Lonely, scared, a ninth-grade dropout, he rebels in ways that will soon make him a 1980s icon. He dyes his hair, pierces his ears, dresses like a punk rocker. By the time he turns pro at sixteen, his new look promises to change tennis forever, as does his lightning-fast return. \r\n\r\nAnd yet, despite his raw talent, he struggles early on. We feel his confusion as he loses to the world’s best, his greater confusion as he starts to win. After stumbling in three Grand Slam finals, Agassi shocks the world, and himself, by capturing the 1992 Wimbledon. Overnight he becomes a fan favorite and a media target.\r\n\r\nAgassi brings a near-photographic memory to every pivotal match and every relationship. Never before has the inner game of tennis and the outer game of fame been so precisely limned. Alongside vivid portraits of rivals from several generations—Jimmy Connors, Pete Sampras, Roger Federer—Agassi gives unstinting accounts of his brief time with Barbra Streisand and his doomed marriage to Brooke Shields. He reveals a shattering loss of confidence. And he recounts his spectacular resurrection, a comeback climaxing with his epic run at the 1999 French Open and his march to become the oldest man ever ranked number one.\r\n\r\nIn clear, taut prose, Agassi evokes his loyal brother, his wise coach, his gentle trainer, all the people who help him regain his balance and find love at last with Stefanie Graf. Inspired by her quiet strength, he fights through crippling pain from a deteriorating spine to remain a dangerous opponent in the twenty-first and final year of his career. Entering his last tournament in 2006, he’s hailed for completing a stunning metamorphosis, from nonconformist to elder statesman, from dropout to education advocate. And still he’s not done. At a U.S. Open for the ages, he makes a courageous last stand, then delivers one of the most stirring farewells ever heard in a sporting arena.\r\n\r\nWith its breakneck tempo and raw candor, Open will be read and cherished for years. A treat for ardent fans, it will also captivate readers who know nothing about tennis. Like Agassi’s game, it sets a new standard for grace, style, speed, and power.","sale_price":720,"quantity":1,"category_id":6,"enabled":1,"author":"Andre Agassi","edition":0,"is_used_book":0,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/4497","created_at":"2016-11-18 09:43:46","updated_at":"2022-03-18 07:34:54","deleted_at":null,"number_of_pages":388,"weight":310,"slug":"open-an-autobiography","is_hard_cover":0,"path":"\/books\/open-an-autobiography","shareable_url":"https:\/\/booksmandala.com\/books\/open-an-autobiography","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":4497,"disk":"uploads","directory":"1\/items","filename":"9780007416790","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":7674,"created_at":"2019-08-18 11:38:07","updated_at":"2019-08-18 11:38:07","deleted_at":null,"pivot":{"mediable_id":10164,"media_id":4497,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":16309,"name":"The Insider","sku":"9789351365662","description":"Please Read Notes: Brand New, International Softcover Edition, Printed in black and white pages, minor self wear on the cover or pages, Sale restriction may be printed on the book, but Book name, contents, and author are exactly same as Hardcover Edition.","sale_price":632,"quantity":1,"category_id":6,"enabled":1,"author":"Aakash Chopra","edition":0,"is_used_book":0,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/4555","created_at":"2018-04-19 13:52:15","updated_at":"2020-08-30 10:30:50","deleted_at":null,"number_of_pages":240,"weight":265,"slug":"the-insider-2","is_hard_cover":0,"path":"\/books\/the-insider-2","shareable_url":"https:\/\/booksmandala.com\/books\/the-insider-2","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":4555,"disk":"uploads","directory":"1\/items","filename":"9789351365662","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":32483,"created_at":"2019-08-19 10:36:17","updated_at":"2019-08-19 10:36:17","deleted_at":null,"pivot":{"mediable_id":16309,"media_id":4555,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":27319,"name":"Dickie Bird","sku":"u9780340684580","description":"Dickie Bird's retirement was an international event shown on TV screens and newspapers throughout the world. He is a household name, an eccentric, and one of the most loved and respected characters in world cricket. His idiosyncratic style and infectious humour has endeared him to millions, transcending his sport.  Fiercely proud of his background as a Yorkshire miner's son, his account follows his youth in Barnsley, his early days as a cricketer, through to his career as an umpire and his experiences of the international scene, all told with total honesty by this very private person. As the most respected umpire in the game, Dickie has serious and constructive points to make about modern cricket. He has fearlessly berated fast-bowlers when necessary. He has some sharp comments to make about ball tampering and he has mixed feelings about the introduction of the third umpire. Dickie wanted to go out at the top and he has certainly done so - after standing at 66 Test matches, three World Cup finals and 92 one-day Internationals.  Combining forthright views on the game and those involved in it, compelling accounts of what it is like behind the scenes in cricket at the highest level, and the hilarious stories for which Dickie is so well known, here is the refreshing and enjoyable autobiography of a sporting legend.","sale_price":250,"quantity":1,"category_id":6,"enabled":1,"author":"Dickie Bird,Keith Lodge","edition":1,"is_used_book":1,"publisher":"Coronet","published_at":"1998-01-01","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/17667","created_at":"2021-08-14 07:44:08","updated_at":"2021-08-14 07:44:08","deleted_at":null,"number_of_pages":479,"weight":325,"slug":"dickie-bird","is_hard_cover":0,"path":"\/books\/dickie-bird","shareable_url":"https:\/\/booksmandala.com\/books\/dickie-bird","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":17667,"disk":"uploads","directory":"1\/items","filename":"9780340684580","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":15583,"created_at":"2021-08-14 07:44:08","updated_at":"2021-08-14 07:44:08","deleted_at":null,"pivot":{"mediable_id":27319,"media_id":17667,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":22969,"name":"Bleachers","sku":"U9780099468196","description":"High school All-American Neely Crenshaw was probably the best quarterback ever to play for the legendary Messina Spartans. Fifteen years have gone by since those glory days, and Neely has come home to Messina to bury Coach Eddie Rake, the man who molded the Spartans into an unbeatable football dynasty. As Coach Rake's 'boys' sit in the bleachers waiting for the dimming field lights to signal his passing, they replay the old glories, and try to decide once and for all whether they love Eddie Rake - or hate him. For Neely Crenshaw, still struggling to come to terms with his explosive relationship with the Coach, his dreams of a great career in the NFL, and the choices he made as a young man, the stakes could not be higher.","sale_price":250,"quantity":1,"category_id":6,"enabled":1,"author":"John Grisham","edition":1,"is_used_book":1,"publisher":"Random House","published_at":"2004-01-01","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/11459","created_at":"2020-07-06 10:08:17","updated_at":"2021-06-17 09:52:26","deleted_at":null,"number_of_pages":181,"weight":135,"slug":"bleachers-2","is_hard_cover":null,"path":"\/books\/bleachers-2","shareable_url":"https:\/\/booksmandala.com\/books\/bleachers-2","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":11459,"disk":"uploads","directory":"1\/items","filename":"9780099468196 (1)","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":17618,"created_at":"2020-07-06 10:08:17","updated_at":"2020-07-06 10:08:17","deleted_at":null,"pivot":{"mediable_id":22969,"media_id":11459,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":9916,"name":"Where the mountain casts its shadow","sku":"9780312339012","description":"Without risk, say mountaineers, there would be none of the self-knowledge that comes from pushing life to its extremes. For them, perhaps, it is worth the cost. But when tragedy strikes, what happens to the people left behind? Why would anyone choose to invest in a future with a high-altitude risk-taker? What is life like in the shadow of the mountain? Such questions have long been taboo in the world of mountaineering. Now, the spouses, parents and children of internationally renowned climbers finally break their silence, speaking out about the dark side of adventure. Maria Coffey confronted one of the harshest realities of mountaineering when her partner Joe Tasker disappeared on the Northeast Ridge of Everest in 1982. In Where the Mountain Casts Its Shadow, Coffey offers an intimate portrait of adventure and the conflicting beauty, passion, and devastation of this alluring obsession. Through interviews with the world's top climbers, or their widows and families-Jim Wickwire, Conrad Anker, Lynn Hill, Joe Simpson, Chris Bonington, Ed Viesturs, Anatoli Boukreev, Alex Lowe, and many others-she explores what compels men and women to give their lives to the high mountains. She asks why, despite the countless tragedies, the world continues to laud their exploits. With an insider's understanding, Coffey reveals the consequences of loving people who pursue such risk-the exhilarating highs and inevitable lows, the stress of long separations, the constant threat of bereavement, and the lives shattered in the wake of climbing accidents. Where the Mountain Casts Its Shadow is a powerful, affecting and important book that exposes the far reaching personal costs of extreme adventure.","sale_price":480,"quantity":1,"category_id":6,"enabled":1,"author":"Maria Coffey","edition":0,"is_used_book":0,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/covers.openlibrary.org\/b\/isbn\/9780312339012-L.jpg","created_at":"2016-11-16 09:07:08","updated_at":"2020-08-31 05:53:13","deleted_at":null,"number_of_pages":234,"weight":250,"slug":"where-the-mountain-casts-its-shadow-1","is_hard_cover":0,"path":"\/books\/where-the-mountain-casts-its-shadow-1","shareable_url":"https:\/\/booksmandala.com\/books\/where-the-mountain-casts-its-shadow-1","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[]},{"id":18109,"name":"Mountains of the Mind","sku":"9780375714061","description":"Combining accounts of legendary mountain ascents with vivid descriptions of his own forays into wild, high landscapes, Robert McFarlane reveals how the mystery of the world’s highest places has came to grip the Western imagination—and perennially draws legions of adventurers up the most perilous slopes. His story begins three centuries ago, when mountains were feared as the forbidding abodes of dragons and other mysterious beasts. In the mid-1700s the attentions of both science and poetry sparked a passion for mountains; Jean-Jacques Rousseau and Lord Byron extolled the sublime experiences to be had on high; and by 1924 the death on Mt Everest of an Englishman named George Mallory came to symbolize the heroic ideals of his day. Macfarlane also reflects on fear, risk, and the shattering beauty of ice and snow, the competition and contemplation of the climb, and the strange alternate reality of high altitude, magically enveloping us in the allure of mountains at every level.","sale_price":640,"quantity":1,"category_id":6,"enabled":1,"author":"Robert Macfarlane","edition":0,"is_used_book":0,"publisher":"Vintage Books","published_at":"2004-01-01","thumbnail_url":"https:\/\/covers.openlibrary.org\/b\/isbn\/9780375714061-L.jpg","created_at":"2018-11-01 12:34:50","updated_at":"2022-01-07 11:26:50","deleted_at":null,"number_of_pages":306,"weight":325,"slug":"mountains-of-the-mind","is_hard_cover":0,"path":"\/books\/mountains-of-the-mind","shareable_url":"https:\/\/booksmandala.com\/books\/mountains-of-the-mind","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[]},{"id":1216,"name":"The Everest Years","sku":"9780297842736","description":"The first volume of Chris Bonington's memoirs, I Chose to Climb, was published in 1966 and told of his initiation into mountaineering, from schoolboy beginnings, culminating in the British ascent of the North Face of the Eiger and his decision to turn professional. The Next Horizon picks up where that volume left off and relates his subsequent adventures as a mountaineer, photographer, journalist and expedition leader. This final volume in the series explores the dangerous and fraught terrain of Tibet and a love affair with the world's highest peak. In 1985 Chris Bonington crowned an already distinguished mountaineering career by reaching the summit of Everest at the age of fifty - an achievement which won him enormous popular acclaim and affection. Here he tells of his fascination with the highest point on earth and why it meant so much to him to finally stand there himself.","sale_price":1011,"quantity":1,"category_id":6,"enabled":1,"author":"Chris Bonington","edition":0,"is_used_book":0,"publisher":"Orion","published_at":null,"thumbnail_url":"https:\/\/covers.openlibrary.org\/b\/isbn\/9780297842736-L.jpg","created_at":"2016-08-22 09:34:33","updated_at":"2020-08-31 06:19:29","deleted_at":null,"number_of_pages":230,"weight":410,"slug":"the-everest-years","is_hard_cover":0,"path":"\/books\/the-everest-years","shareable_url":"https:\/\/booksmandala.com\/books\/the-everest-years","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[]}],"links":{"first":"https:\/\/booksmandala.com\/api\/books?page=1","last":"https:\/\/booksmandala.com\/api\/books?page=13","prev":"https:\/\/booksmandala.com\/api\/books?page=8","next":"https:\/\/booksmandala.com\/api\/books?page=10"},"meta":{"current_page":9,"from":129,"last_page":13,"path":"https:\/\/booksmandala.com\/api\/books","per_page":16,"to":144,"total":200}}