{"data":[{"id":16784,"name":"Modern Yoga Bible","sku":"9781841814667","description":"Yoga brings not only a suppleness to the body but also a sense of well-being to those who practise it. Featuring over 350 postures from the main schools of yoga, The Modern Yoga Bible is the ultimate step-by-step guide to active flowing sequences, slower, more restorative floor-based postures (yin-yoga) and meditation. From luscious limbering to blissful backbends, this book offers beginners and expert yogis alike tips to on how to deepen their practice and modify poses to suit their individual needs and experiences. Learn to utilise body, energy and mind to find a yoga philosophy tailored to modern life.","sale_price":1200,"quantity":5,"category_id":6,"enabled":1,"author":"Christina Brown","edition":0,"is_used_book":0,"publisher":"Godsfield Press","published_at":"2017-01-12","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/10988","created_at":"2018-06-06 13:27:54","updated_at":"2021-02-20 13:49:27","deleted_at":null,"number_of_pages":400,"weight":640,"slug":"modern-yoga-bible","is_hard_cover":0,"path":"\/books\/modern-yoga-bible","shareable_url":"https:\/\/booksmandala.com\/books\/modern-yoga-bible","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":10988,"disk":"uploads","directory":"1\/items","filename":"9781841813837 (1)","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":24704,"created_at":"2020-06-17 11:26:13","updated_at":"2020-06-17 11:26:13","deleted_at":null,"pivot":{"mediable_id":16784,"media_id":10988,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":14744,"name":"A short at history","sku":"9789352645756","description":"Abhinav Bindra s journey to become the first Indian to win an individual Olympic gold, and the first Indian to win a World Championship gold in shooting, is an example of a single-minded quest for perfection. Shattered by his failure at the 2004 Athens Olympics when a gold medal seemed imminent, he changed as a shooter: he became an athlete bent on redemption, a scientist who would try anything to win at the Beijing Olympics in 2008. His victory was not just a personal one, it broke a sporting barrier that had haunted a nation for a century. This revised edition brings the story up to date, including what happened at the Rio Olympics in 2016, where he narrowly missed being among the medals. Bindra also reveals, for the first time, how he started to suffer from epileptic seizures while in the middle of preparing for Rio, and how he overcame this hurdle. Closely involved in telling this remarkable story is sportswriter Rohit Brijnath, who gets into Bindra's mind to help produce one of the finest autobiographies written yet of an Indian sportsman.","sale_price":560,"quantity":5,"category_id":6,"enabled":1,"author":"Abhinav BINDRA","edition":0,"is_used_book":0,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/455","created_at":"2017-10-16 10:01:13","updated_at":"2020-08-30 10:52:24","deleted_at":null,"number_of_pages":269,"weight":330,"slug":"a-short-at-history","is_hard_cover":0,"path":"\/books\/a-short-at-history","shareable_url":"https:\/\/booksmandala.com\/books\/a-short-at-history","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":455,"disk":"uploads","directory":"1\/items","filename":"9789352645756","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":28548,"created_at":"2019-07-16 08:53:14","updated_at":"2019-07-16 08:53:14","deleted_at":null,"pivot":{"mediable_id":14744,"media_id":455,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":9143,"name":"Round Kangchenjunga","sku":"b1300","description":"This is a reproduction of a book published before 1923. This book may have occasional imperfections such as missing or blurred pages, poor pictures, errant marks, etc. that were either part of the original artifact, or were introduced by the scanning process. We believe this work is culturally important, and despite the imperfections, have elected to bring it back into print as part of our continuing commitment to the preservation of printed works worldwide. We appreciate your understanding of the imperfections in the preservation process, and hope you enjoy this valuable book.","sale_price":1200,"quantity":5,"category_id":6,"enabled":1,"author":"Douglas William Freshfield","edition":0,"is_used_book":0,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/10392","created_at":"2016-11-07 06:30:26","updated_at":"2020-08-31 07:26:15","deleted_at":null,"number_of_pages":373,"weight":715,"slug":"round-kangchenjunga-1","is_hard_cover":0,"path":"\/books\/round-kangchenjunga-1","shareable_url":"https:\/\/booksmandala.com\/books\/round-kangchenjunga-1","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":10392,"disk":"uploads","directory":"1\/items","filename":"V (14)","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":6375,"created_at":"2020-05-26 11:33:35","updated_at":"2020-05-26 11:33:35","deleted_at":null,"pivot":{"mediable_id":9143,"media_id":10392,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":32194,"name":"My Turn: the Autobiography","sku":"9781509813926","description":"'I knew nothing about football before knowing Cruyff.' - Pep Guardiola\r\n\r\nJohan Cruyff is widely regarded as one of the greatest players in football history. Throughout his playing career, he was synonymous with Total Football, a style of play in which every player could play in any position on the pitch. Today, his philosophy lives on in teams across Europe, from Barcelona to Bayern Munich and players from Lionel Messi to Cesc Fabrecas.\r\n\r\nMy Turn tells the story of Cruyff's life starting at Ajax, where he won eight national titles and three European Cups before moving to Barcelona where he won La Liga in his first season, in 1973, and was named European Footballer of the Year. He won the Ballon d'Or three times, and led the Dutch national team to the final of the 1974 World Cup, famously losing to West Germany, and receiving the Golden Ball as the player of the tournament.\r\n\r\nOff the field his life was more turbulent, surviving a kidnapping attempt and bankruptcy. This honest and unflinching autobiography also explores his life after retirement, when he became a hugely successful manager of Ajax and then Barcelona when he won the Champions league with a young Pep Guardiola in his team. My Turn is the inspirational account of a legendary football hero, voted European Player of the Century, in his own words.\r\n\r\nIn March 2016 Cruyff died after a short battle with lung cancer bringing world football to a standstill in an outpouring of emotions. A brilliant teacher and analyst of the game he love, My Turn is Johan Cruyff's legacy.","sale_price":880,"quantity":5,"category_id":6,"enabled":1,"author":"JOHAN. CRUYFF","edition":1,"is_used_book":0,"publisher":"Pan Macmillan","published_at":"2017-06-01","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/23417","created_at":"2022-05-08 11:34:32","updated_at":"2022-07-12 15:31:25","deleted_at":null,"number_of_pages":320,"weight":275,"slug":"my-turn-the-autobiography","is_hard_cover":0,"path":"\/books\/my-turn-the-autobiography","shareable_url":"https:\/\/booksmandala.com\/books\/my-turn-the-autobiography","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":23417,"disk":"uploads","directory":"1\/items","filename":"35661419._SY475_","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":28822,"created_at":"2022-05-08 11:34:32","updated_at":"2022-05-08 11:34:32","deleted_at":null,"pivot":{"mediable_id":32194,"media_id":23417,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":18372,"name":"Why Soccer Matters","sku":"9780451468758","description":"\"Soccer. Football. The beautiful game. The world's most popular sport goes by many names, but for decades, fans have agreed on one thing: the greatest player of all time was Pelae. Now the legendary star, ambassador, and humanitarian shares a global vision for what soccer can accomplish. Now he shares his story, his experience, and his insights on the game for the very first time. Before Messi, before Ronaldo, before Beckham, there was Edson Arantes do Nascimento- known simply as Pelae. A national treasure, he created pure magic with his accomplishments on the field: an unprecedented three World Cup championships and the all-time scoring record, with 1,282 goals in his twenty year career. Now, with the World Cup returning after more than sixty years to Brazil- the country often credited with perfecting the sport- soccer has a unique opportunity to encourage change on a global level. And as the tournament's official ambassador, Pelae is ready to be the face of progress.\" --","sale_price":958,"quantity":5,"category_id":6,"enabled":1,"author":"Pelé","edition":0,"is_used_book":0,"publisher":"Celebra Hardcover","published_at":"2015-04-07","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/4551","created_at":"2018-12-20 15:40:54","updated_at":"2020-08-30 10:21:55","deleted_at":null,"number_of_pages":292,"weight":340,"slug":"why-soccer-matters","is_hard_cover":0,"path":"\/books\/why-soccer-matters","shareable_url":"https:\/\/booksmandala.com\/books\/why-soccer-matters","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":4551,"disk":"uploads","directory":"1\/items","filename":"9780451468758","extension":"jpeg","mime_type":"image\/jpeg","aggregate_type":"image","size":29758,"created_at":"2019-08-19 10:32:51","updated_at":"2019-08-19 10:32:51","deleted_at":null,"pivot":{"mediable_id":18372,"media_id":4551,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":14802,"name":"Unbreakable","sku":"9789351160090","description":"India's best known boxer, five times World Champion and an Olympic medallist, Mary Kom tells the moving and inspiring story of her life with surprising honesty. My years of hard work, the refusal to give up, pushing every boundary there was. The thrill, the joy of winning, the successes. The Olympic bronze, my most prized possession. And boxing, the sport I gave myself to. All of it is real. I was the David who took on the Goliaths in the boxing ring - and I won, most of the time.' Born to parents who were landless agricultural labourers in the state of Manipur in Northeast India, Mary's story is one of relentless struggle and unflagging passion for boxing. A childhood of hard labour prepared her body for the sport as well as any fitness training might have. Her own will and aggression carried her through the minefield of politics that any sport in India is. Nimble of foot and pulling no punches, the boxing ring was her domain. M.C. Mary Kom is not yet ready to call it a day, but here she tells her story so far, no holds barred - her tough childhood, her rebellions and how she held her own in the male world of boxing. It's all packed into this inspiring, exhilarating tale of a woman who faced impossible odds in a man's world - and won.","sale_price":318,"quantity":5,"category_id":6,"enabled":1,"author":"Mary Kom,Dina Serto","edition":0,"is_used_book":0,"publisher":null,"published_at":"2013-01-01","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/4528","created_at":"2017-10-16 13:25:22","updated_at":"2021-10-07 06:28:31","deleted_at":null,"number_of_pages":155,"weight":160,"slug":"unbreakable","is_hard_cover":0,"path":"\/books\/unbreakable","shareable_url":"https:\/\/booksmandala.com\/books\/unbreakable","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":4528,"disk":"uploads","directory":"1\/items","filename":"9789351160090","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":29976,"created_at":"2019-08-19 08:31:38","updated_at":"2019-08-19 08:31:38","deleted_at":null,"pivot":{"mediable_id":14802,"media_id":4528,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":15069,"name":"Triple Crown","sku":"9781471162992","description":"The richest prize in racing. The perfect motive to commit a crime ...  Jeff Hinkley, a British Horseracing Authority investigator, has been seconded to the US Federal Anti-Corruption in Sports Agency (FACSA) where he has been asked to find a mole in their organisation, an informant who is passing on confidential information to fix races.   Jeff goes in search of answers, taking on an undercover role as a groom on the backstretch at Belmont Park racetrack in New York. But he discovers far more than he was bargaining for, finding himself as the meat in the sandwich between FACSA and corrupt individuals who will stop at nothing, including murder, to capture the most elusive and lucrative prize in the world - the Triple Crown.","sale_price":638,"quantity":5,"category_id":6,"enabled":1,"author":"FELIX. FRANCIS","edition":0,"is_used_book":0,"publisher":null,"published_at":"2017-06-01","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/9593","created_at":"2017-11-09 07:28:59","updated_at":"2020-09-08 05:55:33","deleted_at":null,"number_of_pages":400,"weight":255,"slug":"triple-crown","is_hard_cover":0,"path":"\/books\/triple-crown","shareable_url":"https:\/\/booksmandala.com\/books\/triple-crown","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":9593,"disk":"uploads","directory":"1\/items","filename":"9781471162992","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":45290,"created_at":"2020-05-01 06:29:37","updated_at":"2020-05-01 06:29:37","deleted_at":null,"pivot":{"mediable_id":15069,"media_id":9593,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":21243,"name":"Miracle Men","sku":"9789388322232","description":"The year was 1983, and Team India was in its first-ever World Cup final. They were the minnows of the cricketing world so much so that the bookmakers were offering 66:1 odds against Indian winning the title. Yet, despite the odds stacked against them, Kapil Devs inspirational captaincy took a bunch of no-hopers to World Cup glory. As Dev held the trophy in his hand on 25 June that year, India ushered in an era during which cricket would go on to dominate all sporting activity in the country and the 14 men who played the winning innings would be venerated as demigods. Based on first-hand accounts of the players themselves of the days leading up to that historic win, Miracle Men will enable readers to relive the most glorious moments in Indian cricket, from dressing-room disagreements to selectorial intrigues to on-field strategy and is as entertaining and full of unexpected turns as the best game of cricket.","sale_price":638,"quantity":5,"category_id":6,"enabled":1,"author":"Nikhil Naz","edition":1,"is_used_book":0,"publisher":"Hachette","published_at":"2019-10-19","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/7669","created_at":"2019-10-19 13:08:03","updated_at":"2020-08-30 09:34:52","deleted_at":null,"number_of_pages":216,"weight":175,"slug":"miracle-men","is_hard_cover":0,"path":"\/books\/miracle-men","shareable_url":"https:\/\/booksmandala.com\/books\/miracle-men","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":7669,"disk":"uploads","directory":"1\/items","filename":"9789388322232","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":49728,"created_at":"2019-10-19 13:08:03","updated_at":"2019-10-19 13:08:03","deleted_at":null,"pivot":{"mediable_id":21243,"media_id":7669,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":25863,"name":"Federer - Completely Revised and Updated edition","sku":"9789381506844","description":" Roger Federer's astounding all-around ability has led to him being referred to as one of the most complete players the game has ever seen and with 17 Grand Slam wins and an Olympic Gold Medal under his belt, the Swiss star has already achieved legendary status in the game. This authoritative and affectionate biography traces Federer's rise, from his first tentative strokes with a tennis racket to how he dealt with being sent away to a training academy where he struggled to communicate in a French-speaking part of Switzerland, as well as how he handled the sudden death of his first real coach and mentor. It also examines how Roger has bounced back from arguably one of the most challenging periods of his career following a serious illness and a dip in form, he broke his run of successive Wimbledon championship wins and was toppled from the number one spot by rival Rafael Nadal—but in characteristic style, silenced his critics by once again returning to winning form. This biography explains how Roger's professionalism and charm, as well as the time he devotes to his charitable foundation, have won him huge amounts of respect from both his fellow athletes and tennis professionals alike.","sale_price":798,"quantity":4,"category_id":6,"enabled":1,"author":"Chris Bowers","edition":1,"is_used_book":0,"publisher":"Amaryllis - an imprint of Manjul Publishing House","published_at":"2016-07-29","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/15176","created_at":"2020-11-30 12:16:15","updated_at":"2022-05-16 09:06:00","deleted_at":null,"number_of_pages":472,"weight":360,"slug":"federer-completely-revised-and-updated-edition","is_hard_cover":0,"path":"\/books\/federer-completely-revised-and-updated-edition","shareable_url":"https:\/\/booksmandala.com\/books\/federer-completely-revised-and-updated-edition","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":15176,"disk":"uploads","directory":"1\/items","filename":"9789381506844","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":33443,"created_at":"2020-11-30 12:16:15","updated_at":"2020-11-30 12:16:15","deleted_at":null,"pivot":{"mediable_id":25863,"media_id":15176,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":5139,"name":"This Game of Ghosts","sku":"9780099380115","description":"When mountain climber Simon Yates cut the rope and sent his friend and climbing partner Joe Simpson plummeting to an ordeal few mountaineers can have contemplated, the outcome was totally unpredictable. That Simpson survived his experience on Peru's Siula Grande is a revelation of the power of the human spirit to overcome fear, pain and deprivation of almost unimaginable intensity. He did not expect to live it all over again - more than once. The first test was to write his award-winning account of the ordeal in Touching the Void. That meant dragging the terrifying experience out of the deeper shadows of his memory. Next, another fall in the Himalaya crippled and almost broke him. He felt forced to test his nerve again, and struggled on crutches to 20,000 feet on Pumori, near Everest. On his descent he heard that a young, first-time climber had been killed by a chance rockfall. What sense could he make now of this game of ghosts that had claimed the lives of so many of his friends over the years he had been climbing, while he had survived so many events that should have meant certain death? In an attempt to find catharsis for his confused emotions he wrote this e xtraordinary memoir, revealing his early ife and his fifteen years of climbing on three continents, before and after the life-changing experience of Siula Grande. His gripping story recounts, with total honesty, experiences that range from hilarious to poignant to nearly unbelievable. Here are the signposts that have directed him since childhood to measure fear and embrace the unknown. He wonders about the luck or the choices along the way that have caused the loss of so many climbing friends: \"Ghosts everywhere I look, all Isee are ghosts - or perhaps I am the ghost, a spectre of my past, standing in the rubble of my present, anxiously awaiting the future.\" This is a compelling work of adventure and introspection that will hold both moutaineers and armchair travelers spellbound.","sale_price":550,"quantity":4,"category_id":6,"enabled":1,"author":"Joe Simpson","edition":0,"is_used_book":0,"publisher":"Random House","published_at":null,"thumbnail_url":"https:\/\/covers.openlibrary.org\/b\/isbn\/9780099380115-L.jpg","created_at":"2016-08-31 14:31:40","updated_at":"2020-10-10 06:10:01","deleted_at":null,"number_of_pages":330,"weight":285,"slug":"this-game-of-ghosts","is_hard_cover":0,"path":"\/books\/this-game-of-ghosts","shareable_url":"https:\/\/booksmandala.com\/books\/this-game-of-ghosts","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[]},{"id":27168,"name":"Why We Kneel How We Rise","sku":"9781398503243","description":"Through the prism of sport and conversations with its legends, including Usain Bolt, Adam Goodes, Thierry Henry, Michael Johnson, Ibtihaj Muhammad, Makhaya Ntini, Naomi Osaka and Hope Powell, Michael Holding explains how racism dehumanises people; how it works to achieve that end; how it has been ignored by history and historians; and what it is like to be treated differently just because of the colour of your skin.\r\n\r\nRarely can a rain delay in a cricket match have led to anything like the moment when Holding spoke out in the wake of the #BlackLivesMatter protests about the racism he has suffered and has seen all around him throughout his life. But as he spoke, he sought not only to educate but to propose a way forward that inspired so many. Within minutes, he was receiving calls from famous sports stars from around the world offering to help him to spread the message further.\r\n\r\nNow, in Why We Kneel, How We Rise, Holding shares his story together with those of some of the most iconic athletes in the world. He delivers a powerful and inspiring message of hope for the future and a vision for change, and takes you through history to understand the racism of today. He adds: 'To say I was surprised at the volume of positive feedback I received from around the world after my comments on Sky Sports is an understatement. I came to realise I couldn’t just stop there; I had to take it forward – hence the book, as I believe education is the way forward.'","sale_price":1118,"quantity":4,"category_id":6,"enabled":1,"author":"Michael Holding","edition":1,"is_used_book":0,"publisher":null,"published_at":"2021-06-24","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/17515","created_at":"2021-08-12 09:20:25","updated_at":"2021-08-12 09:20:25","deleted_at":null,"number_of_pages":320,"weight":410,"slug":"why-we-kneel-how-we-rise","is_hard_cover":0,"path":"\/books\/why-we-kneel-how-we-rise","shareable_url":"https:\/\/booksmandala.com\/books\/why-we-kneel-how-we-rise","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":17515,"disk":"uploads","directory":"1\/items","filename":"9781398503243","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":9048,"created_at":"2021-08-12 09:20:25","updated_at":"2021-08-12 09:20:25","deleted_at":null,"pivot":{"mediable_id":27168,"media_id":17515,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":19500,"name":"At Home with Muhammad Ali","sku":"9780593078358","description":"At Home with Muhammad Ali is an intimate, behind-the-scenes portrait of a legend, a man admired and respected as the greatest sporting icon of our age, written by Ali’s daughter Hana.\r\n\r\nAs Muhammad Ali approached the end of his astonishing boxing career, he strove to embrace a new purpose and role in life beyond the ring. It was a role that would see him take centre stage as an ambassador for peace and friendship, whilst at the same time attempting to find balance and harmony with his many commitments and responsibilities as a husband, devoted father, son and friend.\r\n\r\nIn the 1970s Ali began recording a series of audio diaries, mostly in his LA home. Through these private tapes, as well as personal journals, love lettersand many never-before-seen photographs, we discover Ali the family man and see how, despite the complexities of his personal life, he went to extraordinary lengths to keep all of his nine children united and to help others – be they family, friend or stranger. We also hear of the everyday adventures the family experienced, with visitors such as Michael Jackson, Clint Eastwood and John Travolta dropping by.\r\n\r\nCandid and revealing, At Home with Muhammad Ali is more than Hana’s family memoir. It is a moving and poignant letter of love and affection from a daughter to a father.","sale_price":1118,"quantity":4,"category_id":6,"enabled":1,"author":"Hana Ali","edition":0,"is_used_book":0,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/994","created_at":"2019-02-05 16:26:48","updated_at":"2021-08-01 07:36:56","deleted_at":null,"number_of_pages":460,"weight":505,"slug":"at-home-with-muhammad-ali-1","is_hard_cover":0,"path":"\/books\/at-home-with-muhammad-ali-1","shareable_url":"https:\/\/booksmandala.com\/books\/at-home-with-muhammad-ali-1","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":994,"disk":"uploads","directory":"1\/items","filename":"9780593078358","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":16372,"created_at":"2019-07-27 06:29:52","updated_at":"2019-07-27 06:29:52","deleted_at":null,"pivot":{"mediable_id":19500,"media_id":994,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":26174,"name":"Maradona","sku":"9781408810620","description":"Diego Maradona, is arguably the greatest and certainly the most widely-known footballer of the modern age. During his tempestuous career he played for top clubs in South America and Europe, and was a central figure in four World Cups. With the fortunes he has earned from sponsorship and transfer deals, he personified football, both as popular sport and big business. Jimmy Burns pursued his research in several countries on both sides of the Atlantic, gaining access to Maradona's inner circle, and to other key witnesses, such as players, managers, trainers, doctors and officials. The result is a story straddling the international scene, from the slums of Buenos Aires, where Maradona was born, to the huge stadiums of the United States from where, in 1994, he was ignobly expelled after undergoing a positive drugs test. In his rise to fame - and notoriety - Maradona played for some of the world's greatest teams: Boca Juniors, Napoli and Barcelona. He scored some brilliant goals - and cheated with others. He provoked fans into a mass hysteria of adulation, and his enemies into sinister campai. Now, as coach of Argentina, he is leading the country into the 2010 World Cup in South Africa. This new edition brings the story of Maradona completely up to date.","sale_price":798,"quantity":4,"category_id":6,"enabled":1,"author":"Jimmy Burns","edition":1,"is_used_book":0,"publisher":"Bloomsbury Publishing UK","published_at":"2010-06-07","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/15887","created_at":"2021-02-07 09:32:54","updated_at":"2022-03-24 14:14:13","deleted_at":null,"number_of_pages":272,"weight":270,"slug":"maradona","is_hard_cover":0,"path":"\/books\/maradona","shareable_url":"https:\/\/booksmandala.com\/books\/maradona","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":15887,"disk":"uploads","directory":"1\/items","filename":"9060928","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":28191,"created_at":"2021-02-07 09:32:54","updated_at":"2021-02-07 09:32:54","deleted_at":null,"pivot":{"mediable_id":26174,"media_id":15887,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":30020,"name":"THE NEXT EVEREST","sku":"9789389104554","description":"A dramatic account of the deadly earthquake on Everest--and a return to reach the summit.\r\n\r\nOn April 25, 2015, Jim Davidson was climbing Mount Everest when a 7.8 magnitude earthquake released avalanches all around him and his team, destroying their only escape route and trapping them at nearly 20,000 feet. It was the largest earthquake in Nepal in eighty-one years and killed about 8,900 people. That day also became the deadliest in the history of Everest, with eighteen people losing their lives on the mountain.\r\n\r\nAfter spending two unsettling days stranded on Everest, Davidson's team was rescued by helicopter. The experience left him shaken, and despite his thirty-three years of climbing and serving as an expedition leader, he wasn't sure that he would ever go back. But in the face of risk and uncertainty, he returned in 2017 and finally achieved his dream of reaching the summit.\r\n\r\nSuspenseful and engrossing, The Next Everest portrays the experience of living through the biggest disaster to ever hit the mountain. Davidson's background in geology and environmental science makes him uniquely qualified to explain how this natural disaster unfolded and why the seismic threats lurking beneath Nepal are even greater today. But this story is not about \"conquering\" the world's highest peak. Instead, it reveals how embracing change, challenge, and uncertainty prepares anyone to face their \"next Everest\" in life.","sale_price":1118,"quantity":4,"category_id":6,"enabled":1,"author":"Jim Davidson","edition":1,"is_used_book":0,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/20655","created_at":"2021-11-13 12:03:19","updated_at":"2022-01-26 05:35:20","deleted_at":null,"number_of_pages":408,"weight":470,"slug":"the-next-everest","is_hard_cover":0,"path":"\/books\/the-next-everest","shareable_url":"https:\/\/booksmandala.com\/books\/the-next-everest","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":20655,"disk":"uploads","directory":"1\/items","filename":"9789389104554","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":17315,"created_at":"2021-11-13 12:03:19","updated_at":"2021-11-13 12:03:19","deleted_at":null,"pivot":{"mediable_id":30020,"media_id":20655,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":31571,"name":"How Life Imitates Chess","sku":"9781529156294","description":"____ *THE STRATEGIES BEHIND A SUCCESSFUL LIFE FROM THE LEGENDARY GRANDMASTER AND ADVISOR TO NETFLIX'S THE QUEEN'S GAMBIT, NOW WITH A NEW FOREWORD*  'In this book, chess is a teacher, and I aim to show it is a great one.'  For over twenty years, Garry Kasparov dominated the world of chess. As the youngest ever undisputed World Champion, known for confounding his opponents at every move and breaking record after record, Kasparov was asked the same question time and time again: what makes a champion?  Drawing on a wealth of revealing and instructive stories, from the most intense moments of his greatest games to the world-changing decisions of history's greatest strategists such as Winston Churchill and Steve Jobs, Kasparov reveals the strategic ways of thinking that always give a player - in the game of life as well as chess - the edge.  PRAISE FOR GARRY KASPAROV 'I've never seen someone with such a feel for dynamics in complex positions' - Magnus Carlsen, World Chess Champion  'There is nothing in chess he has been unable to deal with' - Vladimir Kramnik, Chess Grandmaster  'Mr. Kasparov is not only one of the world's smartest men, he is also among its bravest.' - Hillel Neuer, executive director of UN Watch","sale_price":958,"quantity":4,"category_id":6,"enabled":1,"author":"Garry Kasparov","edition":1,"is_used_book":0,"publisher":null,"published_at":"2022-01-13","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/22592","created_at":"2022-03-01 11:58:14","updated_at":"2022-05-27 08:00:41","deleted_at":null,"number_of_pages":271,"weight":225,"slug":"how-life-imitates-chess","is_hard_cover":0,"path":"\/books\/how-life-imitates-chess","shareable_url":"https:\/\/booksmandala.com\/books\/how-life-imitates-chess","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":22592,"disk":"uploads","directory":"1\/items","filename":"9781529156294","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":18687,"created_at":"2022-03-01 11:58:14","updated_at":"2022-03-01 11:58:14","deleted_at":null,"pivot":{"mediable_id":31571,"media_id":22592,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":16490,"name":"Zidane The Biography","sku":"9781785038488","description":"Get inside the mind of football's most enigmatic icon     'Zidane is the master' Pele  One of modern football's most brilliant players - and one of its most iconic and mysterious figures - Zinedine Zidane's football career is the stuff of legend. A World Cup-winner with France, he became the world's most expensive player in 2001 when he moved from Juventus to Real Madrid for £46million, where his exceptional talent earned him a reputation as one of the greatest players of all-time. His playing career concluded explosively when he retired after being sent off for head-butting Marco Materazzi in the 2006 World Cup final.  But his football career was far from over. After a spell coaching in Spain, he was appointed manager of Real Madrid in 2015 and immediately demonstrated that his skill as a manager matched his talent on the pitch, leading the team to successive Champions League victories and establishing him as one of the new managerial greats. Rarely speaking to the press, Zidane is known as a man who 'speaks only with the ball'. In this definitive biography, Patrick Fort and Jean Philippe take us behind the scenes of his exceptional career, revealing the man behind the legend.","sale_price":1118,"quantity":4,"category_id":6,"enabled":1,"author":"Patrick Fort,Jean Philippe","edition":0,"is_used_book":0,"publisher":"Ebury Press","published_at":"2018-05-15","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/4609","created_at":"2018-05-16 19:38:25","updated_at":"2021-12-05 07:40:05","deleted_at":null,"number_of_pages":352,"weight":395,"slug":"zidane-the-biography","is_hard_cover":0,"path":"\/books\/zidane-the-biography","shareable_url":"https:\/\/booksmandala.com\/books\/zidane-the-biography","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":4609,"disk":"uploads","directory":"1\/items","filename":"9781785038488","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":30388,"created_at":"2019-08-20 06:21:58","updated_at":"2019-08-20 06:21:58","deleted_at":null,"pivot":{"mediable_id":16490,"media_id":4609,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]}],"links":{"first":"https:\/\/booksmandala.com\/api\/books?page=1","last":"https:\/\/booksmandala.com\/api\/books?page=13","prev":"https:\/\/booksmandala.com\/api\/books?page=3","next":"https:\/\/booksmandala.com\/api\/books?page=5"},"meta":{"current_page":4,"from":49,"last_page":13,"path":"https:\/\/booksmandala.com\/api\/books","per_page":16,"to":64,"total":200}}