{"data":[{"id":1211,"name":"My Quest for the Yeti","sku":"9780330390866","description":"For over 20 years Reinhold Messner has been obsessed with the secret of the Yeti, the Himilayan creature of legend, who in the West became infamously known as the abominable snowman. Rather than fruitless speculation, Messner - the first person to climb Mount Everest without oxygen and the first to climb all 14 of the world's tallest peaks - provides his own first hand account. He begins by recouting his own terrifying run-ins with the Yeti - while hiking alone in remote parts of Nepal - and how they led to his determination to solve their mystery through seubsequent expeditions. This is an account of a quest, taking readers on hair-raising climbs through Nepal, Bhutan, Ladakh, Northern India, and even Tibet - where Messner was a fugitive from Chinese authorities.","sale_price":638,"quantity":197,"category_id":6,"enabled":1,"author":"Reinhold Messner","edition":0,"is_used_book":0,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/covers.openlibrary.org\/b\/isbn\/9780330390866-L.jpg","created_at":"2016-08-22 09:12:10","updated_at":"2022-07-13 05:51:37","deleted_at":null,"number_of_pages":169,"weight":165,"slug":"my-quest-for-the-yeti","is_hard_cover":0,"path":"\/books\/my-quest-for-the-yeti","shareable_url":"https:\/\/booksmandala.com\/books\/my-quest-for-the-yeti","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[]},{"id":1238,"name":"Above the Clouds","sku":"9780312291372","description":"When Anatoli Boukreev died on the slopes of Annapurna on Christmas day, 1997, the world lost one of the greatest adventurers of our time.In Above the Clouds, both the man and his incredible climbs on Mt. McKinley, K2, Makalu, Manaslu, and Everest-including his diary entries on the infamous 1996 disaster, written shortly after his return-are immortalized. There also are minute technical details about the skill of mountain climbing, as well as personal reflections on what life means to someone who risks it every day. Fully illustrated with gorgeous color photos, Above the Clouds is a unique and breathtaking look at the world from its most remote peaks.","sale_price":798,"quantity":142,"category_id":6,"enabled":1,"author":"Anatoli Boukreev,Linda Wylie","edition":0,"is_used_book":0,"publisher":"Macmillan","published_at":null,"thumbnail_url":"https:\/\/covers.openlibrary.org\/b\/isbn\/9780312291372-L.jpg","created_at":"2016-08-22 10:22:12","updated_at":"2022-05-06 07:36:44","deleted_at":null,"number_of_pages":239,"weight":340,"slug":"above-the-clouds","is_hard_cover":0,"path":"\/books\/above-the-clouds","shareable_url":"https:\/\/booksmandala.com\/books\/above-the-clouds","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[]},{"id":11472,"name":"Storms of Silence","sku":"9780898865127","description":"In Storms of Silence Joe Simpson brings up to date, in the vivid anecdotal style of This Game of Ghosts, his thoughtful, funny and moving account of his maverick life as a mountaineer. But behind the rich tapestry of adventures lies a dark and brooding disquiet.He recalls the terrifying avalanche that nearly wiped out his base camp during an attempt on the unclimbed north face of Gangchempo in the Himalaya. While climbing on Cho Oyo he meets a band of Khampas, including a four-year-old boy, fleeing over the high Nangpa La pass from the brutality of Chinese oppression in Tibet. Joe's love of Himalayan life contrasts with the ruthless Chinese destruction of the Tibetan culture and people. A violent brush with a skinhead in his home town of Sheffield is mirrored in his chilling encounter with the Peruvian police. On Huascaran, Peru's highest mountain, he hears unnerving ghostly voices and learns of the earthquake which buried 18,000 people and wiped out the town of Yungay below him. It reminds him of his boyhood visit to the Nazi concentration camp at Belsen. The book ends with the trauma of reliving, in quite unexpected circumstances, the dance with death he described so vividly in his bestselling book Touching the Void.","sale_price":450,"quantity":110,"category_id":6,"enabled":1,"author":"Joe Simpson","edition":0,"is_used_book":0,"publisher":"The Mountaineers Books","published_at":"1996-01-01","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/10828","created_at":"2017-01-08 08:38:56","updated_at":"2022-06-26 10:40:47","deleted_at":null,"number_of_pages":304,"weight":710,"slug":"storms-of-silence","is_hard_cover":null,"path":"\/books\/storms-of-silence","shareable_url":"https:\/\/booksmandala.com\/books\/storms-of-silence","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":10828,"disk":"uploads","directory":"1\/items","filename":"9780898865127","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":49250,"created_at":"2020-06-08 06:34:47","updated_at":"2020-06-08 06:34:47","deleted_at":null,"pivot":{"mediable_id":11472,"media_id":10828,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":31209,"name":"The Shisha Pangma","sku":"9780898867237","description":"This adventure classic captures everything from the historical to the deeply personal in a gripping account of the ambitious first ascent of the Southwest Face of Shishapangma.","sale_price":800,"quantity":96,"category_id":6,"enabled":1,"author":"Doug Scott,Alex MacIntyre","edition":1,"is_used_book":0,"publisher":"The Mountaineers Books","published_at":"2000-01-01","thumbnail_url":"https:\/\/covers.openlibrary.org\/b\/isbn\/9780898867237-L.jpg","created_at":"2022-02-01 07:42:42","updated_at":"2022-02-01 07:42:42","deleted_at":null,"number_of_pages":321,"weight":700,"slug":"the-shisha-pangma","is_hard_cover":0,"path":"\/books\/the-shisha-pangma","shareable_url":"https:\/\/booksmandala.com\/books\/the-shisha-pangma","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[]},{"id":16212,"name":"Everest Summit Of Achievement","sku":"9781408841983","description":"Every day, the path up the South Col route to the summit of Everest becomes a little more worn by the tread of dozens of package-tour climbers, but few dare to try the East, or Kangshung, Face, a sheer, avalanche-swept wall of snow and ice only first conquered in 1983. Five years later, Stephen Venables intensified the challenge by leading three unknown American climbers up the East Face - this time without oxygen. The question to most climbing experts wasn't whether they would summit, but whether they would live. They nearly didn't Everest: Alone at the Summit is Venables' rousing account of one of the greatest feats of twentieth century mountaineering, a triumph over doubt, the elements and the limits of human endurance that has never been repeated. \"Climbers or not, all will be interested in this mountaineering thriller of a tiny band pulling off an incredible victory-an account so stirring it will be put down only to obtain a moment's breather.\" -- American Alpine Journal","sale_price":2500,"quantity":79,"category_id":6,"enabled":1,"author":"Stephen Venables","edition":0,"is_used_book":0,"publisher":null,"published_at":"2013-05-09","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/1794","created_at":"2018-03-31 19:35:37","updated_at":"2020-05-09 10:56:58","deleted_at":null,"number_of_pages":252,"weight":2400,"slug":"everest-summit-of-achievement","is_hard_cover":null,"path":"\/books\/everest-summit-of-achievement","shareable_url":"https:\/\/booksmandala.com\/books\/everest-summit-of-achievement","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":1794,"disk":"uploads","directory":"1\/items","filename":"9781408841983","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":48631,"created_at":"2019-08-01 07:43:33","updated_at":"2019-08-01 07:43:33","deleted_at":null,"pivot":{"mediable_id":16212,"media_id":1794,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":1224,"name":"Left for Dead","sku":"9780375504044","description":"I am neither churchly nor a particularly spiritual person, but I can tell you that some force within me rejected death at the last moment and then guided me, blind and stumbling-- quite literally a dead man walking-- into camp and the shaky start of my return to life. On May 10, 1996, nine climbers perished in a blizzard high on Mount Everest, the single deadliest day ever on the peak. The following day, one of those victims was given a second chance. His name was Beck Weathers.The tale of Dr. Seaborn Beck Weathers's miraculous awakening from a deep hypothermic coma was widely reported. But the hidden story of what led the pathologist to Everest in the first place, and his painful recovery after his dramatic rescue, has not been told until now.  Brilliant and gregarious, Weathers discovered in his thirties that mountain climbing helped him cope with the black dog of depression that had shadowed him since college. But the self-prescribed therapy came at a steep cost: estrangement from his wife, Peach, and their two children. By the time he embarked for Everest, his home life had all but disintegrated. Yet when he was reported dead after lying exposed on the mountain for eighteen hours in subzero weather, it was Peach who orchestrated the daring rescue that brought her husband home. Only then, facing months of surgery and the loss of his hands, did Beck Weathers also begin to face himself, his family, his past and uncertain future. Told in Beck Weathers's inimitably direct and engaging voice-- with frequent commentary from Peach, their family, their friends and others involved in this unique journey-- Left for Dead shows how one man's drive to conquer themost daunting physical challenges ultimately forced him to confront greater challenges within himself. Framed by breathtaking accounts of his near death and resurrection, and of his slow and agonizing physical and emotional recovery, Left for Dead offers a fascinating look at the seductive danger of extreme sports, as in rapid succession a seemingly unstoppable Weathers attacks McKinley, Elbrus, Aconcagua, Kilimanjaro-- before fate stops him cold, high in the Death Zone of the world's tallest peak. Full of deep insight and warm humor, Left for Dead tells the story of a man, a marriage and a family that survived the unsurvivable. Candid and uncompromising, it is a deeply compelling saga of crisis and change, and of the abiding power of love and family-- a story few readers will soon forget.","sale_price":750,"quantity":52,"category_id":6,"enabled":1,"author":"Beck Weathers","edition":0,"is_used_book":0,"publisher":"Random House Digital, Inc.","published_at":null,"thumbnail_url":"https:\/\/covers.openlibrary.org\/b\/isbn\/9780375504044-L.jpg","created_at":"2016-08-22 09:55:06","updated_at":"2020-08-31 06:48:39","deleted_at":null,"number_of_pages":292,"weight":605,"slug":"left-for-dead","is_hard_cover":1,"path":"\/books\/left-for-dead","shareable_url":"https:\/\/booksmandala.com\/books\/left-for-dead","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[]},{"id":12575,"name":"Facing up","sku":"9780330392266","description":"'No one could fail to be gripped by his heartfelt excitement and emotion over what was the adventure of a lifetime.' Independent At the age of twenty-three, Bear Grylls became the youngest Briton to reach the summit of Mount Everest. At extreme altitude youth holds no advantage over experience, and it is generally acknowledged that younger climbers have more difficulty coping with the adverse effects of mountaineering. Nevertheless, only two years after breaking his back in a freefall parachuting accident, Bear Grylls overcame severe weather conditions, fatigue, dehydration and a last minute illness to stand on top of the world's highest mountain. Facing Up is the story of his adventure, his courage and humour, his friendship and faith. PRAISE FOR BEAR GRYLLS\"Bear's tale is by turns, hilarious and horrific.\" Daily Telegraph \"Written with refreshing humility, this is a briskly told account not of conquering Everest, but of realising its power.\" Daily Mail \"He writes convincingly of fear and doubt. This is an honest and compelling story.\" Ranulph Fiennes","sale_price":720,"quantity":48,"category_id":6,"enabled":1,"author":"Bear Grylls","edition":0,"is_used_book":0,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/covers.openlibrary.org\/b\/isbn\/9780330392266-L.jpg","created_at":"2017-05-03 05:04:17","updated_at":"2022-04-05 05:26:49","deleted_at":null,"number_of_pages":289,"weight":245,"slug":"facing-up","is_hard_cover":0,"path":"\/books\/facing-up","shareable_url":"https:\/\/booksmandala.com\/books\/facing-up","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[]},{"id":1229,"name":"The mountain my time on everest","sku":"9781451694734","description":"In national bestseller The Mountain, world-renowned climber and bestselling author Ed Viesturs and cowriter David Roberts paint a vivid portrait of obsession, dedication, and human achievement in a true love letter to the world’s highest peak.In The Mountain, veteran world-class climber and bestselling author Ed Viesturs—the only American to have climbed all fourteen of the world’s 8,000-meter peaks—trains his sights on Mount Everest in richly detailed accounts of expeditions that are by turns personal, harrowing, deadly, and inspiring. The highest mountain on earth, Everest remains the ultimate goal for serious high-altitude climbers. Viesturs has gone on eleven expeditions to Everest, spending more than two years of his life on the mountain and reaching the summit seven times. No climber today is better poised to survey Everest’s various ascents—both personal and historic. Viesturs sheds light on the fate of Mallory and Irvine, whose 1924 disappearance just 800 feet from the summit remains one of mountaineering’s greatest mysteries, as well as the multiple tragic last days of Rob Hall and Scott Fischer in 1996, the stuff of which Into Thin Air was made. Informed by the experience of one who has truly been there, The Mountain affords a rare glimpse into that place on earth where Heraclitus’s maxim—“Character is destiny”—is proved time and again.","sale_price":958,"quantity":45,"category_id":6,"enabled":1,"author":"Ed Viesturs","edition":0,"is_used_book":0,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/4674","created_at":"2016-08-22 10:05:09","updated_at":"2020-08-31 06:28:27","deleted_at":null,"number_of_pages":352,"weight":570,"slug":"the-mountain-my-time-on-everest","is_hard_cover":1,"path":"\/books\/the-mountain-my-time-on-everest","shareable_url":"https:\/\/booksmandala.com\/books\/the-mountain-my-time-on-everest","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":4674,"disk":"uploads","directory":"1\/items","filename":"9781451694734","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":4276,"created_at":"2019-08-20 11:16:42","updated_at":"2019-08-20 11:16:42","deleted_at":null,"pivot":{"mediable_id":1229,"media_id":4674,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":3792,"name":"Calico Joe","sku":"9781444757187","description":"Thirty years have passed since eleven-year-old Paul Tracy watched his troubled father, Warren, a pitcher for the New York Mets, clash with his childhood hero, the Cubs' golden-boy Joe Castle, in a contest from which no winners emerged. Now the news that his father is dying brings the memory of that day flooding back. Deciding that it's time to face up to what really happened on that baseball field in 1973, father and son make their way to Calico Rock, Arkansas, where either redemption or rejection awaits them.","sale_price":560,"quantity":45,"category_id":6,"enabled":1,"author":"John Grisham","edition":0,"is_used_book":0,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/1154","created_at":"2016-08-29 08:53:19","updated_at":"2020-09-08 07:43:07","deleted_at":null,"number_of_pages":246,"weight":165,"slug":"calico-joe-1","is_hard_cover":0,"path":"\/books\/calico-joe-1","shareable_url":"https:\/\/booksmandala.com\/books\/calico-joe-1","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":1154,"disk":"uploads","directory":"1\/items","filename":"9781444757187","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":25203,"created_at":"2019-07-28 07:08:57","updated_at":"2019-07-28 07:08:57","deleted_at":null,"pivot":{"mediable_id":3792,"media_id":1154,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":1235,"name":"The Epic of Mount Everest","sku":"9780330482851","description":"Francis Younghusband was the first chairman of the Mount Everest Committee of the Royal Geographical Society. This is his account of the three separate expeditions to Mount Everest in 1921, 1922 and 1924—the expedition in which Mallory and Irving lost their lives.","sale_price":638,"quantity":41,"category_id":6,"enabled":1,"author":"Sir Francis Edward Younghusband","edition":0,"is_used_book":0,"publisher":"Pan Macmillan Adult MM","published_at":null,"thumbnail_url":"https:\/\/covers.openlibrary.org\/b\/isbn\/9780330482851-L.jpg","created_at":"2016-08-22 10:15:51","updated_at":"2022-05-06 07:36:43","deleted_at":null,"number_of_pages":254,"weight":220,"slug":"the-epic-of-mount-everest","is_hard_cover":0,"path":"\/books\/the-epic-of-mount-everest","shareable_url":"https:\/\/booksmandala.com\/books\/the-epic-of-mount-everest","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[]},{"id":1264,"name":"Everest","sku":"9780898866704","description":"This complete history tells the truth about many of those who have attempted to climb to the roof of the world.","sale_price":800,"quantity":40,"category_id":6,"enabled":1,"author":"Walt Unsworth","edition":0,"is_used_book":0,"publisher":"Mountaineers Books","published_at":null,"thumbnail_url":"https:\/\/covers.openlibrary.org\/b\/isbn\/9780898866704-L.jpg","created_at":"2016-08-22 11:19:54","updated_at":"2021-12-11 06:25:36","deleted_at":null,"number_of_pages":789,"weight":1410,"slug":"everest","is_hard_cover":1,"path":"\/books\/everest","shareable_url":"https:\/\/booksmandala.com\/books\/everest","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[]},{"id":18546,"name":"I Am Football","sku":"9780241297155","description":"I AM FOOTBALL.\r\n\r\nA photographic journey around planet Zlatan including interviews with: POGBA, MINO RAIOLA, JOSE MOUINHO AND MANY OTHERS.\r\n\r\n\"He is an amazing talent, one of the best around.\" Pep Guardiola\r\n\r\n\"He is skillful. He is outspoken. He is Zlatan.\" New York Times\r\n\r\n\"Wonderful. The best footballer's autobiography of recent years . . . and the bestselling European immigrant's tale since Zadie Smith's White Teeth and Philip Roth's Portnoy's Complaint.\" Simon Kuper,Financial Times\r\n\r\n\"I came like a hero. I left like a legend.\" Zlatan Ibrahimovic\r\n\r\nFrom Malmo, to becoming the Ligue 1's highest ever goal scorer with Paris Saint-Germain, before on further triumph at Manchester United.\r\n\r\nZLATAN IS FOOTBALL!","sale_price":2078,"quantity":34,"category_id":6,"enabled":1,"author":"Zlatan Ibrahimovic","edition":0,"is_used_book":0,"publisher":"Viking","published_at":"2018-11-22","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/3759","created_at":"2018-12-27 17:17:52","updated_at":"2022-06-03 08:45:38","deleted_at":null,"number_of_pages":256,"weight":1810,"slug":"i-am-football","is_hard_cover":1,"path":"\/books\/i-am-football","shareable_url":"https:\/\/booksmandala.com\/books\/i-am-football","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":3759,"disk":"uploads","directory":"1\/items","filename":"9780241297155","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":23819,"created_at":"2019-08-13 11:09:58","updated_at":"2019-08-13 11:09:58","deleted_at":null,"pivot":{"mediable_id":18546,"media_id":3759,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":1236,"name":"I Chose to Climb","sku":"9780297842743","description":"Mountaineering during the mid-20th century bred a new race of climbers when the era that began with Whymper¿s ascent of the Matterhorn in 1865 ended with the British ascent of Everest in 1953. In those days climbing had for most people the quality of heroic myth and climbers were larger than life figures. But peaks which were previously so inaccessible became increasingly available post-1953 and Chris Bonington was recognised then, as now, as one of the outstanding members of this generation. In I Chose to Climb, first published in 1966, he tells of his first climbing experiences as a schoolboy ¿ his first serious climbing at Harrison¿s Rocks in Kent and his progress to climbs in Wales and Scotland. Then, with celebrated mountaineering personalities such as Hamish MacInnes, Don Whillans and Ian Clough, Chris Bonington went on to make successful ascents all over the world, including the first British ascent of the North Face of the Eiger in 1962, Annapurna II in 1960 and in an unhappy expedition in 1961, Nuptse, the third peak of Everest. The story of Chris Bonington¿s many exploits finishes in this book at 1962 but is continued in his subsequent works of autobiography, The Next Horizon and The Everest Years, also reissued on 12 July 2001 by Weidenfeld & Nicolson.","sale_price":798,"quantity":25,"category_id":6,"enabled":1,"author":"Chris Bonington","edition":0,"is_used_book":0,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/4679","created_at":"2016-08-22 10:17:28","updated_at":"2020-08-31 06:12:26","deleted_at":null,"number_of_pages":224,"weight":340,"slug":"i-chose-to-climb","is_hard_cover":0,"path":"\/books\/i-chose-to-climb","shareable_url":"https:\/\/booksmandala.com\/books\/i-chose-to-climb","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":4679,"disk":"uploads","directory":"1\/items","filename":"9780297842743","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":44091,"created_at":"2019-08-20 11:39:57","updated_at":"2019-08-20 11:39:57","deleted_at":null,"pivot":{"mediable_id":1236,"media_id":4679,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":27166,"name":"You Are A Champion","sku":"9781529068177","description":"An inspiring, positive and practical guide for kids from Marcus Rashford MBE, footballer and child food poverty campaigner.","sale_price":958,"quantity":16,"category_id":6,"enabled":1,"author":"Macmillan,Marcus Rashford","edition":1,"is_used_book":0,"publisher":"Macmillan Children's Books","published_at":"2021-05-27","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/17513","created_at":"2021-08-10 07:44:40","updated_at":"2022-03-06 10:07:33","deleted_at":null,"number_of_pages":240,"weight":225,"slug":"you-are-a-champion","is_hard_cover":0,"path":"\/books\/you-are-a-champion","shareable_url":"https:\/\/booksmandala.com\/books\/you-are-a-champion","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":17513,"disk":"uploads","directory":"1\/items","filename":"9781529068177","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":34469,"created_at":"2021-08-10 07:44:40","updated_at":"2021-08-10 07:44:40","deleted_at":null,"pivot":{"mediable_id":27166,"media_id":17513,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":1201,"name":"K2","sku":"9780767932509","description":"A thrilling chronicle of the tragedy-ridden history of climbing K2, the world's most difficult and unpredictable mountain, by the bestselling authors of No Shortcuts to the TopAt 28,251 feet, the world's second-tallest mountain, K2 thrusts skyward out of the Karakoram Range of northern Pakistan. Climbers regard it as the ultimate achievement in mountaineering, with good reason. Four times as deadly as Everest, K2 has claimed the lives of seventy-seven climbers since 1954. In August 2008 eleven climbers died in a single thirty-six-hour period on K2–the worst single-event tragedy in the mountain's history and the second-worst in the long chronicle of mountaineering in the Himalaya and Karakoram ranges. Yet summiting K2 remains a cherished goal for climbers from all over the globe. Before he faced the challenge of K2 himself, Ed Viesturs, one of the world's premier high-altitude mountaineers, thought of it as \"the holy grail of mountaineering.\"In K2: Life and Death on the World's Most Dangerous Mountain, Viesturs explores the remarkable history of the mountain and of those who have attempted to conquer it. At the same time he probes K2's most memorable sagas in an attempt to illustrate the lessons learned by confronting the fundamental questions raised by mountaineering–questions of risk, ambition, loyalty to one's teammates, self-sacrifice, and the price of glory. Viesturs knows the mountain firsthand. He and renowned alpinist Scott Fischer climbed it in 1992 and were nearly killed in an avalanche that sent them sliding to almost certain death. Fortunately, Ed managed to get into a self-arrest position with his ice ax and stop both his fall and Scott' s.Focusing on seven of the mountain's most dramatic campaigns, from his own troubled ascent to the 2008 tragedy, Viesturs and Roberts crafts an edge-of-your-seat narrative that climbers and armchair travelers alike will find unforgettably compelling. With photographs from Viesturs's personal collection and from historical sources, this is the definitive account of the world's ultimate mountain, and of the lessons that can be gleaned from struggling toward its elusive summit.","sale_price":520,"quantity":15,"category_id":6,"enabled":1,"author":"Ed Viesturs","edition":0,"is_used_book":0,"publisher":"Random House LLC","published_at":null,"thumbnail_url":"https:\/\/covers.openlibrary.org\/b\/isbn\/9780767932509-L.jpg","created_at":"2016-08-22 08:50:19","updated_at":"2020-08-31 06:29:30","deleted_at":null,"number_of_pages":342,"weight":695,"slug":"k2","is_hard_cover":1,"path":"\/books\/k2","shareable_url":"https:\/\/booksmandala.com\/books\/k2","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[]},{"id":30004,"name":"RAFA My Story","sku":"9780751547733","description":"This autobiography gives Nadal's millions of fans what they've been waiting for - a glimpse behind the racquet to learn what really makes Nadal - an intensely private person who until now has never talked about his personal and family life - tick.","sale_price":958,"quantity":13,"category_id":6,"enabled":1,"author":"Rafael Nadal,John Carlin","edition":1,"is_used_book":0,"publisher":null,"published_at":"2012-01-01","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/20639","created_at":"2021-11-13 09:28:57","updated_at":"2022-06-01 13:06:52","deleted_at":null,"number_of_pages":304,"weight":270,"slug":"rafa-my-story","is_hard_cover":0,"path":"\/books\/rafa-my-story","shareable_url":"https:\/\/booksmandala.com\/books\/rafa-my-story","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":20639,"disk":"uploads","directory":"1\/items","filename":"14814721","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":18604,"created_at":"2021-11-13 09:28:57","updated_at":"2021-11-13 09:28:57","deleted_at":null,"pivot":{"mediable_id":30004,"media_id":20639,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]}],"links":{"first":"https:\/\/booksmandala.com\/api\/books?page=1","last":"https:\/\/booksmandala.com\/api\/books?page=13","prev":null,"next":"https:\/\/booksmandala.com\/api\/books?page=2"},"meta":{"current_page":1,"from":1,"last_page":13,"path":"https:\/\/booksmandala.com\/api\/books","per_page":16,"to":16,"total":200}}