{"data":[{"id":17806,"name":"Cristiano Ronaldo","sku":"9781409155065","description":"The definitive biography of Cristiano Ronaldo, named Football Book of the Year at the Cross Sports Book Awards 2016Fully updated to include the 2015-16 seasonCristiano Ronaldo is one of the greatest footballers of all time, a dream he pursued from the age of just twelve when he left his humble origins on Madeira behind.It wasn't long before he had the biggest clubs in Europe knocking on his door, but it was Manchester United who won the race for his signature. Under the tutelage of Sir Alex Ferguson, Ronaldo developed into the complete footballer and athlete, winning three league titles and a Champions League along the way.He then became the biggest galáctico of them all when he transferred to Real Madrid for a record-breaking fee. However, he has endured a difficult relationship with managers, teammates and the fans - and his time at the club has often been overshadowed by his fierce rivalry with Barcelona and Lionel Messi.Guillem Balagué, respected football journalist and expert on the Spanish game, provides the definitive account of what has made Ronaldo the player and man that he is today.","sale_price":792,"quantity":0,"category_id":6,"enabled":1,"author":"Guillem Balague","edition":0,"is_used_book":0,"publisher":"Orion","published_at":"2017-01-17","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/2402","created_at":"2018-10-14 11:42:13","updated_at":"2020-10-28 09:05:35","deleted_at":null,"number_of_pages":320,"weight":null,"slug":"cristiano-ronaldo","is_hard_cover":0,"path":"\/books\/cristiano-ronaldo","shareable_url":"https:\/\/booksmandala.com\/books\/cristiano-ronaldo","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":2402,"disk":"uploads","directory":"1\/items","filename":"9781409155065","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":34924,"created_at":"2019-08-03 09:48:34","updated_at":"2019-08-03 09:48:34","deleted_at":null,"pivot":{"mediable_id":17806,"media_id":2402,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":22160,"name":"Glorious Summers and Discontents","sku":"U9780857203496","description":"In this fascinating book, Mike Atherton selects the best pieces he has written over the last decade. Renowned as a shrewd and resolute captain of England, Atherton moved effortlessly into the commentary box and Fleet Street, proving himself every bit as capable with the pen as with the bat. It has been a dramatic period, seeing the rise of Twenty20 cricket and the IPL, as well as the revival of England's prospects, breaking a long era of Australian dominance in the Ashes. There has also been controversy, too, with terrorist attacks, Zimbabwe and allegations of Pakistani spot-fixing all distracting fans from the essence of the game. Through it all, Atherton comments with the true insight of one who has been there, the humane understanding of someone who has genuine empathy for the issues involved and, above all, his opinions are based on a deep love for the game and sport in general. His writing has become essential reading for all sports fans. This book shows exactly why that is the case.","sale_price":250,"quantity":0,"category_id":6,"enabled":1,"author":"Mike Atherton","edition":1,"is_used_book":1,"publisher":"Simon & Schuster UK","published_at":"2012-07-17","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/8875","created_at":"2020-01-10 17:46:29","updated_at":"2021-02-24 13:41:51","deleted_at":null,"number_of_pages":288,"weight":290,"slug":"glorious-summers-and-discontents","is_hard_cover":null,"path":"\/books\/glorious-summers-and-discontents","shareable_url":"https:\/\/booksmandala.com\/books\/glorious-summers-and-discontents","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":8875,"disk":"uploads","directory":"1\/items","filename":"9780857203496","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":36782,"created_at":"2020-01-10 17:46:29","updated_at":"2020-01-10 17:46:29","deleted_at":null,"pivot":{"mediable_id":22160,"media_id":8875,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":15263,"name":"Messi 2018 Edition","sku":"9781785782305","description":null,"sale_price":638,"quantity":0,"category_id":6,"enabled":1,"author":"Luca Caioli","edition":0,"is_used_book":0,"publisher":"","published_at":null,"thumbnail_url":"https:\/\/covers.openlibrary.org\/b\/isbn\/9781785782305-L.jpg","created_at":"2017-11-18 07:00:22","updated_at":"2019-10-16 11:01:59","deleted_at":null,"number_of_pages":null,"weight":null,"slug":"messi-2018-edition","is_hard_cover":null,"path":"\/books\/messi-2018-edition","shareable_url":"https:\/\/booksmandala.com\/books\/messi-2018-edition","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[]},{"id":23974,"name":"Now is the Time for Running","sku":"U9781848530836","description":"Winner of the 2014 UKLA Award Deo is a great footballer, a fierce protector of his older brother, Innocent. His brother is easily nervous, easily happy but good at keeping score on the dusty fields of Zimbabwe where the boys play. Then Mugabe's soldiers come, destroying the only home the boys have known. Now, Deo has nothing but his brother, and a football stuffed with billions of worthless dollars. And so starts their journey to find their father. But with soldiers everywhere, they have only one chance to cross the border, one chance to escape. In face of such a challenge, it is Deo's brotherly love that endures, his belief that he will lead them both to safety. Micheal Williams's is a masterful storyteller who pulls you along the journey of a lifetime. Deo and Innocent's journey is a universal story of hope in the face of despair, and the search for a better life.","sale_price":250,"quantity":0,"category_id":6,"enabled":1,"author":"Michael Williams","edition":1,"is_used_book":1,"publisher":"Random House","published_at":"2012-06-01","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/12536","created_at":"2020-07-28 11:27:21","updated_at":"2021-08-02 13:09:15","deleted_at":null,"number_of_pages":233,"weight":180,"slug":"now-is-the-time-for-running","is_hard_cover":null,"path":"\/books\/now-is-the-time-for-running","shareable_url":"https:\/\/booksmandala.com\/books\/now-is-the-time-for-running","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":12536,"disk":"uploads","directory":"1\/items","filename":"9781848530836","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":33374,"created_at":"2020-07-28 11:27:21","updated_at":"2020-07-28 11:27:21","deleted_at":null,"pivot":{"mediable_id":23974,"media_id":12536,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":18351,"name":"Messi, Neymar, Ronaldo - 2019 Updated Edition","sku":"9781785784323","description":"FROM THE BESTSELLING AUTHOR OF MESSI , RONALDO ANDNEYMAR The world's greatest players, head to head. Lionel Messi, Neymar and Cristiano Ronaldo haverisen from humble beginnings in Argentina, Brazil and Portugal to rank amongthe most exciting talents football has ever seen. Now, Luca Caioli, author of bestselling individualbiographies of each player, asks: 'Who is the greatest'? Comparing their contrasting styles, stories, records andawards, he gives you everything you need to decide who comes out top. With exclusive insights from their friends, families,teammates and managers, Caioli presents a unique insight into what makes amodern player not just successful, but truly great. Includes all the action from the 2017\/18 season and the 2018World Cup","sale_price":638,"quantity":0,"category_id":6,"enabled":1,"author":"Luca Caioli","edition":0,"is_used_book":0,"publisher":null,"published_at":"2018-10-04","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/4484","created_at":"2018-12-20 13:25:48","updated_at":"2020-12-15 13:16:43","deleted_at":null,"number_of_pages":224,"weight":165,"slug":"messi-neymar-ronaldo-2019-updated-edition","is_hard_cover":null,"path":"\/books\/messi-neymar-ronaldo-2019-updated-edition","shareable_url":"https:\/\/booksmandala.com\/books\/messi-neymar-ronaldo-2019-updated-edition","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":4484,"disk":"uploads","directory":"1\/items","filename":"9781785784323","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":40385,"created_at":"2019-08-18 10:40:48","updated_at":"2019-08-18 10:40:48","deleted_at":null,"pivot":{"mediable_id":18351,"media_id":4484,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":25778,"name":"Arsene Wenger","sku":"9781471137921","description":"THE MOST COMPREHENSIVE BIOGRAPHY OF ARSENE WENGER EVER PUBLISHED.  When Arsene Wenger arrived at Arsenal in 1996, he was little known to fans at the club and many doubted he could bring back the glory days of George Graham. But soon he was transforming the way the team played, melding the famous English defensive spine of Tony Adams, Martin Keown, Lee Dixon, Nigel Winterburn and David Seaman with a hugely creative foreign attacking spirit, epitomised by Dennis Bergkamp, Thierry Henry and Robert Pires, that could both outplay and outmuscle their rivals. At the same time, he introduced new ideas on diet, exercise, training and tactics, which many players believe extended their careers.  Having won numerous trophies, and led the Invincibles to an unprecedented unbeaten league season in 2003-04, Wenger then had to help the Gunners through the next stage of their development when they moved from Highbury to the Emirates Stadium, a move that was followed by a nine-year trophy drought. Despite the financial constraints he faced, he still managed to keep the club playing in the Champions League year after year while remaining true to his philosophy of how the game should be played. Some began to question whether he had been left behind, despite picking up back-to-back FA Cups in 2014 and 2015, and from some quarters calls grew for him to retire, though in May 2017 he signed another two-year deal to stay at the club.   Now, in this updated edition of John Cross's acclaimed biography, the author provides a compelling account of the man and his methods. He assesses the scale of Wenger's achievements, as he reaches 20 years in charge of Arsenal, and provides the most complete portrait of the Frenchman yet written.","sale_price":798,"quantity":0,"category_id":6,"enabled":1,"author":"John Cross,","edition":1,"is_used_book":0,"publisher":null,"published_at":"2016-08-18","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/15077","created_at":"2020-11-14 12:48:32","updated_at":"2021-10-03 05:31:23","deleted_at":null,"number_of_pages":320,"weight":335,"slug":"arsene-wenger","is_hard_cover":0,"path":"\/books\/arsene-wenger","shareable_url":"https:\/\/booksmandala.com\/books\/arsene-wenger","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":15077,"disk":"uploads","directory":"1\/items","filename":"28248672._SY475_","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":30506,"created_at":"2020-11-14 12:48:32","updated_at":"2020-11-14 12:48:32","deleted_at":null,"pivot":{"mediable_id":25778,"media_id":15077,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":1208,"name":"View from the Summit","sku":"9780552151047","description":"The first man to set foot on the summit of Everest, the man who led a team of tractors to the South Pole, the man who jetboated up the Ganges from the ocean to the sky has, for the first time, gathered all the remarkable adventures of a long life into one volume. But there is more to Edmund Hillary than this. He is also the man who repaid his debt of fame to the Himalayas by inaugurating a programme of building schools, clinics, airstrips and bridges in Nepal. With his still active support, these have gone from strength to strength in the 50 years since he himself mastered the Hillary Step and led his companion Tenzing Norgay up Everest's final summit ridge.\r\n\r\nView from the Summit is a thoughtful and honest reappraisal of a life spent pushing human ability to its limits and relishing the challenges thrown down by the elements. It is also the story of a man whom the world has taken to its hear","sale_price":1278,"quantity":0,"category_id":6,"enabled":1,"author":"Edmund Hillary","edition":0,"is_used_book":0,"publisher":"Corgi Books","published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/4661","created_at":"2016-08-22 09:07:30","updated_at":"2022-06-20 10:28:45","deleted_at":null,"number_of_pages":382,"weight":305,"slug":"view-from-the-summit","is_hard_cover":0,"path":"\/books\/view-from-the-summit","shareable_url":"https:\/\/booksmandala.com\/books\/view-from-the-summit","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":4661,"disk":"uploads","directory":"1\/items","filename":"9780552151047","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":15299,"created_at":"2019-08-20 10:31:13","updated_at":"2019-08-20 10:31:13","deleted_at":null,"pivot":{"mediable_id":1208,"media_id":4661,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":18107,"name":"Leading","sku":"9780316268103","description":"From the winningest soccer coach ever, best known for 27 triumphant years with Manchester United, comes the book that decodes the key tools he used to deliver sustained success on and off the field. \r\n\r\nAfter an astonishing career-first in Scotland, and then over 27 years with Manchester United Football Club, Sir Alex Ferguson analyzes the pivotal leadership decisions of his 38 years as a manager and, with his friend and collaborator Sir Michael Moritz, draws out lessons that anyone can use in business and life to generate long-term transformational success.\r\n\r\nFrom hiring practices to firing decisions, from dealing with transition to teamwork, from mastering the boardroom to responding to failure and adversity, Leading is as inspiring as it is practical, and a go-to reference for any leader in business, sports, and life.","sale_price":800,"quantity":0,"category_id":6,"enabled":1,"author":"Alex Ferguson","edition":0,"is_used_book":0,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/4643","created_at":"2018-11-01 12:24:33","updated_at":"2021-03-09 09:25:41","deleted_at":null,"number_of_pages":405,"weight":530,"slug":"leading-2","is_hard_cover":0,"path":"\/books\/leading-2","shareable_url":"https:\/\/booksmandala.com\/books\/leading-2","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":4643,"disk":"uploads","directory":"1\/items","filename":"9780316268103","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":17531,"created_at":"2019-08-20 08:01:20","updated_at":"2019-08-20 08:01:20","deleted_at":null,"pivot":{"mediable_id":18107,"media_id":4643,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":15808,"name":"Pele: The Autobiography","sku":"9781416511212","description":"The legend. In his own words.   From the poverty-stricken streets of Sao Paulo to an international icon and one of the most celebrated footballers of all time, Pele's life story is as extraordinary as it is enrapturing. With his trademark wit and deference, the legend draws us into a wonderful story lit by insight and humour and encompassing everything you ever wanted to know about the great man himself.   From shining shoes for extra pennies at the Baru Athletic Club to triumph in several World Cups, the glory of being on top of the world -- and staying there -- is shared in what is undoubtedly one of the must-read autobiographies of the year. On top of his athletic achievements, Pele has also been a staunch campaigner for human rights and in particular the plight of street children in his home country, leading to an appointment as a UN Ambassador and an honorary knighthood from the British monarchy.   By turns addictive, moving and enlightening, this is the ultimate story of the rise of a star and an amazing testimony to how even the lowliest of society's people can reach the dizzying heights of worldwide adoration and success.","sale_price":638,"quantity":0,"category_id":6,"enabled":1,"author":"Pele","edition":0,"is_used_book":0,"publisher":"Simon & Schuster UK","published_at":"2007-07-01","thumbnail_url":"https:\/\/covers.openlibrary.org\/b\/isbn\/9781416511212-L.jpg","created_at":"2018-02-16 14:49:42","updated_at":"2021-09-22 06:00:02","deleted_at":null,"number_of_pages":352,"weight":330,"slug":"pele-the-autobiography","is_hard_cover":0,"path":"\/books\/pele-the-autobiography","shareable_url":"https:\/\/booksmandala.com\/books\/pele-the-autobiography","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[]},{"id":1218,"name":"Annapurna","sku":"9780898867381","description":"Messner is one of the most famous mountaineers of our time Annapurna represents a milestone in climbing history as the first 8,000-meter peak ever climbed\r\n\r\nThe only complete mountaineering history of Annapurna\r\n\r\nOn June 3, 1950, Maurice Herzog stood on the narrow sickle glacier of Annapurna (8,091m) in the Himalaya. With that first ascent of Annapurna, Herzog crossed the magic border-the Death Zone-of 8,000 meters. The ascent did not go undisputed.\r\n\r\nDuring the 50 years since Herzog’s ascent, climbing in the highest mountains of the world has changed and developed profoundly. Today it is possible to climb the notorious Annapurna even on the most demanding routes and to survive in the “Death Zone” beyond 8,000 meters.\r\n\r\nAnnapurna: 50 Years of Expeditions in the Death Zone begins with the thrilling story of the first ascent and goes on to highlight the history of the most exciting and significant ascents of the mountain, including Messner’s own successful first ascent of the difficult Northwest Face.","sale_price":800,"quantity":0,"category_id":6,"enabled":1,"author":"Reinhold Messner","edition":0,"is_used_book":0,"publisher":"Cambridge University Press","published_at":null,"thumbnail_url":"https:\/\/covers.openlibrary.org\/b\/isbn\/9780898867381-L.jpg","created_at":"2016-08-22 09:38:49","updated_at":"2021-10-09 11:56:16","deleted_at":null,"number_of_pages":172,"weight":520,"slug":"annapurna-1","is_hard_cover":1,"path":"\/books\/annapurna-1","shareable_url":"https:\/\/booksmandala.com\/books\/annapurna-1","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[]},{"id":19650,"name":"Pandolf Fini's Ultimate Guide to Chess","sku":"9780743226172","description":"From America's foremost chess teacher and author comes a new standard: a comprehensive course covering all aspects of the game, to improve your technique whether you are a newcomer or a longtime fan.  One of America's best-known chess masters, Bruce Pandolfini has helped millions learn the intricacies of chess through his acclaimed books and workshops. In this exciting volume, he presents a complete overview of the entire game and its culture. Structured as a dialogue between a beginning student and an expert teacher, Pandolfini's Ultimate Guide to Chess takes the student step-by-step from fundamentals to advanced, highly strategic play. Combining easy-to-follow diagrams with trenchant and up-to-date analysis, Pandolfini puts a new twist on accepted chess theory, offering a seamless beginning-to-end approach, including:  • a short introductory history of the game • the moves, rules, and contemporary notation forms • the basic principles of chess • how to develop an opening repertoire • the art of tactical play • pattern recognition and memory aids • traps and pitfalls to be avoided • middlegame play, strategy, and planning • defense and counterattack • transitions to the endgame and the endgame itself • computers and the future of chess • the best websites for playing chess online  With Pandolfini's expert insight into the history and modern world of chess, as well as several appendices to enhance play and appreciation, Pandolfini's Ultimate Guide to Chess makes the perfect gift for players of all ages and will be the benchmark title for chess players for years to come.","sale_price":638,"quantity":0,"category_id":6,"enabled":1,"author":"Bruce Pandolfini","edition":0,"is_used_book":0,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/covers.openlibrary.org\/b\/isbn\/9780743226172-L.jpg","created_at":"2019-02-14 18:59:05","updated_at":"2021-07-03 07:55:37","deleted_at":null,"number_of_pages":400,"weight":400,"slug":"pandolf-finis-ultimate-guide-to-chess","is_hard_cover":0,"path":"\/books\/pandolf-finis-ultimate-guide-to-chess","shareable_url":"https:\/\/booksmandala.com\/books\/pandolf-finis-ultimate-guide-to-chess","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[]},{"id":19911,"name":"Salah","sku":"9781785784637","description":"Mohamed Salah needed little time to settle in to life at Liverpool. Since signing for the Anfield club in 2017 for a then-club record fee, he has broken the club's scoring record for a debut season, as well as becoming the leading goalscorer in Europe's top five leagues, overtaking Lionel Messi and Harry Kane. He was the first player to ever win three Premier League Player of the Month awards in the same season and was the winner of the PFA Player's Player of the Year for 2017-18, scoring 32 goals in 36 league games. In this biography of the Egypt and Liverpool star, bestselling authors Luca Caioli and Cyril Collot examine his rise to success. Up to date with Russia World Cup 2018 analysis and featuring exclusive interviews and behind-the-scenes details","sale_price":638,"quantity":0,"category_id":6,"enabled":1,"author":"Luca Caioli","edition":0,"is_used_book":0,"publisher":"Icon Books","published_at":"2019-05-14","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/4476","created_at":"2019-03-24 15:41:35","updated_at":"2022-01-06 11:30:22","deleted_at":null,"number_of_pages":224,"weight":155,"slug":"salah","is_hard_cover":0,"path":"\/books\/salah","shareable_url":"https:\/\/booksmandala.com\/books\/salah","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":4476,"disk":"uploads","directory":"1\/items","filename":"9781785784637","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":54960,"created_at":"2019-08-18 10:24:20","updated_at":"2019-08-18 10:24:20","deleted_at":null,"pivot":{"mediable_id":19911,"media_id":4476,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":22987,"name":"The Secret Race","sku":"U9780552169172","description":"The Secret Race is the book that rocked the world of professional cycling--and exposed, at long last, the doping culture surrounding the sport and its most iconic rider, Lance Armstrong. Former Olympic gold medalist Tyler Hamilton was once one of the world's top-ranked cyclists--and a member of Lance Armstrong's inner circle. Over the course of two years, New York Times bestselling author Daniel Coyle conducted more than two hundred hours of interviews with Hamilton and spoke with numerous teammates, rivals, and friends. The result is an explosive page-turner of a book that takes us deep inside a shadowy, fascinating, and surreal world of unscrupulous doctors, anything-goes team directors, and athletes so relentlessly driven to win that they would do almost anything to gain an edge. For the first time, Hamilton recounts his own battle with depression and tells the story of his complicated relationship with Lance Armstrong. This edition features a new Afterword, in which the authors reflect on the developments within the sport, and involving Armstrong, over the past year. The Secret Race is a courageous, groundbreaking act of witness from a man who is as determined to reveal the hard truth about his sport as he once was to win the Tour de France.","sale_price":250,"quantity":0,"category_id":6,"enabled":1,"author":"Tyler Hamilton,Daniel Coyle","edition":1,"is_used_book":1,"publisher":"Random House","published_at":"2013-05-01","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/11478","created_at":"2020-07-06 11:01:14","updated_at":"2022-01-31 06:41:04","deleted_at":null,"number_of_pages":382,"weight":275,"slug":"the-secret-race","is_hard_cover":0,"path":"\/books\/the-secret-race","shareable_url":"https:\/\/booksmandala.com\/books\/the-secret-race","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":11478,"disk":"uploads","directory":"1\/items","filename":"9780552169172","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":12561,"created_at":"2020-07-06 11:01:14","updated_at":"2020-07-06 11:01:14","deleted_at":null,"pivot":{"mediable_id":22987,"media_id":11478,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":10447,"name":"If cricket is a religion, Sachin is God","sku":"9788172238216","description":"With hundred centuries and over 34,000 runs in international cricket, Sachin Tendulkar, the highest run-getter in both Tests and ODIs, is the God of the religion called cricket. His exploits on the field have brought hope and joy to millions of fans. And yet, like God, he has his set of detractors always willing to remove him from the pedestal. In this revised and updated edition, the authors, who consider themselves fans and analysts in equal measure, follow the career of the cricketing demigod - his advent, his peak, his fall, his resurrection and, finally, his retirement. They also talk about India's sensational WC 2011 triumph and Tendulkar's decision to retire from international cricket. Armed with irrefutable statistical data, which they contextualize and analyse with rigour, the authors seek to end all debate on Tendulkar's status as the greatest cricketer of the modern era. They compare him with his peers in both forms of the game, and provide the viewpoint of experts, players and commentators, so that the reader can independently draw conclusions. And if you still don't believe that Sachin is God's gift to the world of cricket, well, God help you!","sale_price":400,"quantity":0,"category_id":6,"enabled":1,"author":"Vijay Santhanam and Shyam Balasubramanian","edition":0,"is_used_book":0,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/3852","created_at":"2016-11-25 07:33:29","updated_at":"2020-12-15 13:16:42","deleted_at":null,"number_of_pages":200,"weight":270,"slug":"if-cricket-is-a-religion-sachin-is-god","is_hard_cover":0,"path":"\/books\/if-cricket-is-a-religion-sachin-is-god","shareable_url":"https:\/\/booksmandala.com\/books\/if-cricket-is-a-religion-sachin-is-god","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":3852,"disk":"uploads","directory":"1\/items","filename":"9788172238216","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":37121,"created_at":"2019-08-14 05:15:16","updated_at":"2019-08-14 05:15:16","deleted_at":null,"pivot":{"mediable_id":10447,"media_id":3852,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":18383,"name":"Ronaldo - 2019 Updated Edition","sku":"9781785784224","description":"FROM THE BESTSELLING AUTHOR OF MESSI AND NEYMAR  Strength, speed and dedication: Cristiano Ronaldo is known throughout theworld as a colossus of the modern game.  But did you know that he underwent laser heart surgery aged just fifteen to enable him to continue playing the game he loved?  Or that Nacional, his first professional club, donatedtwenty balls and two sets of kits to his youth team in order to sign him?  Or how he came to be known as abelhinha-'littlebee' -a name he would later pass on to his Yorkshire Terrier?  Find out all this and more in Luca Caioli's biography of theglobal superstar, featuring exclusive insights from those who know him best andeven the man himself.  Includes all the action from the 2017\/18season and the 2018 World Cup","sale_price":638,"quantity":0,"category_id":6,"enabled":1,"author":"Luca Caioli","edition":0,"is_used_book":0,"publisher":"Icon Books","published_at":"2018-10-04","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/7391","created_at":"2018-12-20 16:42:11","updated_at":"2019-10-16 11:02:31","deleted_at":null,"number_of_pages":316,"weight":null,"slug":"ronaldo-2019-updated-edition","is_hard_cover":null,"path":"\/books\/ronaldo-2019-updated-edition","shareable_url":"https:\/\/booksmandala.com\/books\/ronaldo-2019-updated-edition","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":7391,"disk":"uploads","directory":"1\/items","filename":"9781785784224","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":24750,"created_at":"2019-09-30 23:17:29","updated_at":"2019-09-30 23:17:29","deleted_at":null,"pivot":{"mediable_id":18383,"media_id":7391,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":18387,"name":"How to Watch Football","sku":"9780241978009","description":"From his unrivalled perspective as player, manager and pundit, the Dutch football legend shows us everything to look for in a 90 minute match. From formations and tactical decisions to player qualities and pivotal moments, Ruud Gullit unveils the hidden patterns on the pitch.\r\n\r\nPacked with his acute insights, original observations and talking points, How to Watch Football will quite simply change the way you see the beautiful game.","sale_price":798,"quantity":0,"category_id":6,"enabled":1,"author":"Ruud Gullit","edition":0,"is_used_book":0,"publisher":null,"published_at":"2017-08-03","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/3714","created_at":"2018-12-20 16:58:14","updated_at":"2019-12-06 11:50:02","deleted_at":null,"number_of_pages":288,"weight":235,"slug":"how-to-watch-football","is_hard_cover":null,"path":"\/books\/how-to-watch-football","shareable_url":"https:\/\/booksmandala.com\/books\/how-to-watch-football","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":3714,"disk":"uploads","directory":"1\/items","filename":"9780241978009","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":34176,"created_at":"2019-08-13 09:43:10","updated_at":"2019-08-13 09:43:10","deleted_at":null,"pivot":{"mediable_id":18387,"media_id":3714,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]}],"links":{"first":"https:\/\/booksmandala.com\/api\/books?page=1","last":"https:\/\/booksmandala.com\/api\/books?page=13","prev":"https:\/\/booksmandala.com\/api\/books?page=11","next":"https:\/\/booksmandala.com\/api\/books?page=13"},"meta":{"current_page":12,"from":177,"last_page":13,"path":"https:\/\/booksmandala.com\/api\/books","per_page":16,"to":192,"total":200}}