{"data":[{"id":20813,"name":"Fortnite: the Ultimate Unauthorised Guide","sku":"9781471178207","description":"Are you ready to take your game to the next level and dominate your opponents? Ready to learn how to destroy your fellow gamers and win the ultimate Battle Royale? If so, you're ready for Fortnite: The Ultimate Unauthorised Guide.  Starting with simple instructions on how to download and install the game on all platforms (Nintendo, PlayStation, Xbox and PC--and now on your mobile device!), Fortnite: The Ultimate Unauthorised Guide divulges all the essential information needed to navigate through the Fortnite world like a pro.  Whether playing Battle Royale or Save the Earth mode, readers will learn how and where to unearth the best items, discover essential combat strategies and weapons use, identify ideal landing zones and build the perfect fort or base. Also included are manoeuvring tactics and even advice on how to managing resources and cash, buying the coolest skin and flashing the best dance moves. With secret cheats, hacks, unlockables, and much more, this is an essential guide to everything Fortnite!","sale_price":638,"quantity":13,"category_id":6,"enabled":1,"author":"Grant Turner","edition":0,"is_used_book":0,"publisher":null,"published_at":"2018-06-21","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/2275","created_at":"2019-06-18 12:41:17","updated_at":"2020-08-30 11:01:36","deleted_at":null,"number_of_pages":208,"weight":215,"slug":"fortnite-the-ultimate-unauthorised-guide","is_hard_cover":0,"path":"\/books\/fortnite-the-ultimate-unauthorised-guide","shareable_url":"https:\/\/booksmandala.com\/books\/fortnite-the-ultimate-unauthorised-guide","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":2275,"disk":"uploads","directory":"1\/items","filename":"9781471178207","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":15374,"created_at":"2019-08-03 06:51:16","updated_at":"2019-08-03 06:51:16","deleted_at":null,"pivot":{"mediable_id":20813,"media_id":2275,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":22652,"name":"Relentless","sku":"9781476714202","description":"For more than two decades, legendary trainer Tim Grover has taken the greats—Michael Jordan, Kobe Bryant, Dwyane Wade, and hundreds of relentless competitors in sports, business, and every walk of life—and made them greater. Now, for the first time ever, he reveals what it takes to achieve total mental and physical dominance, showing you how to be relentless and achieve whatever you desire.Direct, blunt, and brutally honest, Grover breaks down what it takes to be unstoppable: you keep going when everyone else is giving up, you thrive under pressure, you never let your emotions make you weak. In “The Relentless 13,” he details the essential traits shared by the most intense competitors and achievers in sports, business, and all walks of life. Relentless shows you how to trust your instincts and get in the Zone; how to control and adapt to any situation; how to find your opponent’s weakness and attack. Grover gives you the same advice he gives his world-class clients—“don’t think”—and shows you that anything is possible. Packed with previously untold stories and unparalleled insight into the psyches of the most successful and accomplished athletes of our time, Relentless shows you how even the best get better . . . and how you can too.","sale_price":798,"quantity":12,"category_id":6,"enabled":1,"author":"Tim S. Grover,Shari Wenk","edition":0,"is_used_book":0,"publisher":"Simon and Schuster","published_at":"2014-03-11","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/9372","created_at":"2020-03-20 17:41:42","updated_at":"2022-05-12 05:33:00","deleted_at":null,"number_of_pages":233,"weight":245,"slug":"relentless-1","is_hard_cover":0,"path":"\/books\/relentless-1","shareable_url":"https:\/\/booksmandala.com\/books\/relentless-1","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":9372,"disk":"uploads","directory":"1\/items","filename":"9781476714202","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":16823,"created_at":"2020-03-20 17:41:42","updated_at":"2020-03-20 17:41:42","deleted_at":null,"pivot":{"mediable_id":22652,"media_id":9372,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":2083,"name":"Every Second Counts","sku":"9780224064736","description":"In 1999, Lance Armstrong made world headlines with the most stunning comeback in the history of sport after battling against life-threatening testicular cancer just eighteen months before returning to professional cycling. His first book, It's Not About the Bike, charted his journey back to life and went on to become an international bestseller. Now, in his much-anticipated follow-up, Armstrong shares more details of his extraordinary life story, including the births of his twin daughters Grace and Isabel. Never shy of controversy, Armstrong offers, with typical frankness, his thoughts on training, competing, winning and failure. He also tells of the work he did for the foundation he created following his dramatic recovery, addresses the daunting challenge of living in the aftermath of cancer and treatment, and shares further inspirational tales of survival. A fresh outlook on the spirit of survivors everywhere, Every Second Counts is an account of a man who strives every day to meet life's challenges - whether on his bike or off.  Every Second Counts was first published in October 2003. In an interview with Oprah Winfrey in January 2013, Lance Armstrong admitted to having taken performance enhancing drugs in all seven of the Tours de France in which he competed between 1999 and 2005. He was officially stripped of these wins by the UCI, the world governing body for cycling, in 2012.","sale_price":720,"quantity":11,"category_id":6,"enabled":1,"author":"Lance Armstrong,Sally Jenkins","edition":0,"is_used_book":0,"publisher":"Random House","published_at":null,"thumbnail_url":"https:\/\/covers.openlibrary.org\/b\/isbn\/9780224064736-L.jpg","created_at":"2016-08-25 07:50:31","updated_at":"2020-09-06 10:55:06","deleted_at":null,"number_of_pages":246,"weight":195,"slug":"every-second-counts","is_hard_cover":0,"path":"\/books\/every-second-counts","shareable_url":"https:\/\/booksmandala.com\/books\/every-second-counts","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[]},{"id":12861,"name":"K2 STORY OF THE SAVAGE MOUNTAIN","sku":"9780340606018","description":"Second only to Everest in height but more formidable, K2 has challenged the greatest names in climbing--and often won. K2: The Story of the Savage Mountain is the first comprehensive climbing history of this beautiful but deadly peak. From fateful first attempts to the harrowing events of 1986 and more recent ascents, the book examines the human and natural factors that have given the mountain its reputation. Author Jim Curran traces the earliest explorations of the Karakorum by Godwin-Austen and Younghusband, as well as the pioneering exploits of the Duke of the Abruzzi. A K2 climber himself, Curran interviewed Kurt Diemberger, Jim Wickwire, Charlie Houston and other climbers to help shed new light on past expeditions and to look at the many challenges that remain on the mountain.","sale_price":600,"quantity":11,"category_id":6,"enabled":1,"author":"JIM CURRAN","edition":0,"is_used_book":0,"publisher":"HODDER & STOUGHTON","published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/4757","created_at":"2017-06-22 07:50:22","updated_at":"2020-08-31 06:42:33","deleted_at":null,"number_of_pages":271,"weight":590,"slug":"k2-story-of-the-savage-mountain","is_hard_cover":1,"path":"\/books\/k2-story-of-the-savage-mountain","shareable_url":"https:\/\/booksmandala.com\/books\/k2-story-of-the-savage-mountain","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":4757,"disk":"uploads","directory":"1\/items","filename":"9780340606018","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":54804,"created_at":"2019-08-21 08:23:08","updated_at":"2019-08-21 08:23:08","deleted_at":null,"pivot":{"mediable_id":12861,"media_id":4757,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":1202,"name":"A Life on the Edge","sku":"9780898867541","description":"There have been many firsts in Jim Whittaker's life. He was the first North American to summit Mount Everest. As the first manager and employee, and ultimately the CEO, of fledgling Recreational Equipment, Inc. (REI), he guided the company through years of record-setting growth. He guided Bobby Kennedy up the newly named Mount Kennedy, helping him to become the first person to summit the Canadian peak. He lead the first and only International Peace Climb, which put climbers from the U.S., Russia, and China on the summit of Everest in the name of world peace.Contrary to what many people might think, Jim Whittaker's career neither began nor culminated with that famous first ascent of Everest. His achievement on Everest and his many successes before and after are, rather, the natural outcome of a life driven by a passion for outdoor adventure combined with strong leadership qualities and a commitment to making a difference. In A Life on the Edge, readers will discover a true hero -- someone who inspires others to seek challenges in their own lives.","sale_price":1305,"quantity":11,"category_id":6,"enabled":1,"author":"Jim Whittaker","edition":0,"is_used_book":0,"publisher":"The Mountaineers Books","published_at":null,"thumbnail_url":"https:\/\/covers.openlibrary.org\/b\/isbn\/9780898867541-L.jpg","created_at":"2016-08-22 08:52:14","updated_at":"2020-08-31 06:18:59","deleted_at":null,"number_of_pages":271,"weight":480,"slug":"a-life-on-the-edge","is_hard_cover":0,"path":"\/books\/a-life-on-the-edge","shareable_url":"https:\/\/booksmandala.com\/books\/a-life-on-the-edge","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[]},{"id":19262,"name":"The fall of the house of FIFA","sku":"9780224100458","description":"The Fall of the House of Fifa is the definitive story of Fifa's rise - and the most spectacular fall sport has ever seen.\r\n\r\n1904: 'No person should be allowed to arrange matches for personal profit' - Fifa congress\r\n\r\nA century later: 'Fifa is a Racketeering Influenced Corrupt Organisation (RICO) enterprise' - A judge in Brooklyn, using a term originally coined for the mafia\r\n\r\nFor forty years Joao Havelange and then Sepp Blatter presided over a Fifa now plagued with scandal - dawn raids, FBI investigations, allegations of money laundering, industrial-scale bribery, racketeering, tax evasion, vote-buying and theft. Now David Conn, football's most respected investigative journalist, chronicles the extraordinary history and staggering scale of corruption. He paints revealing portraits of the men at the centre of Fifa - the power brokers, the indicted, the legends like Franz Beckenbauer and Michel Platini - and puts the allegations to Blatter himself in an extended interview.","sale_price":798,"quantity":10,"category_id":6,"enabled":1,"author":"David Conn","edition":0,"is_used_book":0,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/4495","created_at":"2019-01-28 13:46:17","updated_at":"2020-08-30 08:35:02","deleted_at":null,"number_of_pages":328,"weight":255,"slug":"the-fall-of-the-house-of-fifa","is_hard_cover":0,"path":"\/books\/the-fall-of-the-house-of-fifa","shareable_url":"https:\/\/booksmandala.com\/books\/the-fall-of-the-house-of-fifa","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":4495,"disk":"uploads","directory":"1\/items","filename":"9780224100458","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":20386,"created_at":"2019-08-18 11:35:51","updated_at":"2019-08-18 11:35:51","deleted_at":null,"pivot":{"mediable_id":19262,"media_id":4495,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":14980,"name":"Prelude to Everest","sku":"9781906817749","description":"Acclaimed hillwalking writers Ian R Mitchell and George Rodway tell the fascinating story of Aberdeen-born Alexander Kellas, and his contribution to mountaineering from the 20th century to the present day. Now a largely neglected figure, Kellas is the pioneer of high altitude physiology, his climbing routes still in evidence today. Follow Kellas' journey, which takes him from the Scottish Cairngorms to the Himalaya, and discover how his struggles and explorations have impacted upon mountaineering today.","sale_price":1904,"quantity":10,"category_id":6,"enabled":1,"author":"Ian R. Mitchell,George W. Rodway","edition":0,"is_used_book":0,"publisher":"Luath Press Ltd","published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/4695","created_at":"2017-10-25 08:30:20","updated_at":"2020-08-30 11:12:15","deleted_at":null,"number_of_pages":285,"weight":650,"slug":"prelude-to-everest","is_hard_cover":1,"path":"\/books\/prelude-to-everest","shareable_url":"https:\/\/booksmandala.com\/books\/prelude-to-everest","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":4695,"disk":"uploads","directory":"1\/items","filename":"9781906817749","extension":"jpeg","mime_type":"image\/jpeg","aggregate_type":"image","size":8448,"created_at":"2019-08-20 12:18:25","updated_at":"2019-08-20 12:18:25","deleted_at":null,"pivot":{"mediable_id":14980,"media_id":4695,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":7168,"name":"A Day to Die For","sku":"9781780576411","description":"On the night of 10-11 May 1996, eight climbers perished in what remains the worst disaster in Everest's history. Following the tragedy, numerous accounts were published, with Jon Krakauer'sInto Thin Airbecoming an international bestseller. But has the whole story been told?  A Day to Die For reveals the full, startling facts that led to the tragedy. Graham Ratcliffe, the first British climber to reach the summit of Mount Everest twice, was a first-hand witness, having spent the night on Everest's South Col at 26,000 ft, sheltering from the deadly storm. For years, he has shouldered a burden of guilt, feeling that he and his teammates could have saved lives that fateful night. His quest for answers has led to discoveries so important to an understanding of the disaster that he now questions why these facts were not made public sooner.  History is dotted with high-profile disasters that both horrify and capture the attention of the public, but very rarely is our view of them revised to such devastating effect.","sale_price":798,"quantity":9,"category_id":6,"enabled":1,"author":"Graham Ratcliffe","edition":0,"is_used_book":0,"publisher":"Mainstream Publishing","published_at":null,"thumbnail_url":"https:\/\/covers.openlibrary.org\/b\/isbn\/9781780576411-L.jpg","created_at":"2016-10-07 09:17:18","updated_at":"2022-05-31 08:07:26","deleted_at":null,"number_of_pages":334,"weight":260,"slug":"a-day-to-die-for","is_hard_cover":0,"path":"\/books\/a-day-to-die-for","shareable_url":"https:\/\/booksmandala.com\/books\/a-day-to-die-for","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[]},{"id":1299,"name":"on the edge","sku":"9781845299248","description":"No one sees clearer than an individual whose life is hanging by the finger tips on the edge of an abyss. Probing the furthest reaches of human daring and endurance, here are 28 of the great first-hand accounts of extreme mountaineering, from legendary names. Featuring: ·Heinrich Harrer - first conqueror of the notorious Eigerwand. ·Robert Bates - the classic account of the ill-fated American 1953 expedition to K2. ·Maurice Herzog - his unstoppable ascent of Annapurna at the cost of frostbite. ·Walter Bonatti - tragedy on the Central Pillar of Freney on Mont Blanc. ·George Leigh Mallory - surviving an avalanche on the 1922 Everest expedition. ·René Desmaison - his epic story of 14 days stuck on The Grandes Jorasses in winter. ·Jon Krakauer - recalling his solo ascent of The Devil's Thumb in Alaska. The price of the summit is often measured in human suffering, yet for those who succeed the rewards can be incalculable. Nerve-wracking and unputdownable.","sale_price":720,"quantity":9,"category_id":6,"enabled":1,"author":"jon eE.lewis","edition":0,"is_used_book":0,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/4665","created_at":"2016-08-22 11:56:08","updated_at":"2022-01-17 10:19:59","deleted_at":null,"number_of_pages":494,"weight":680,"slug":"on-the-edge","is_hard_cover":0,"path":"\/books\/on-the-edge","shareable_url":"https:\/\/booksmandala.com\/books\/on-the-edge","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":4665,"disk":"uploads","directory":"1\/items","filename":"9781845299248","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":241099,"created_at":"2019-08-20 10:38:13","updated_at":"2019-08-20 10:38:13","deleted_at":null,"pivot":{"mediable_id":1299,"media_id":4665,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":19492,"name":"The Illustrated History of Football","sku":"9781780895581","description":"This is soccer comic-ery, but not as you know it. Welcome to the comically brilliant and politically engaging work of illustrator David Squires, artist extraordinaire. Soccer and comics. Once a hearty Saturday combination to match cartoons and cereal, in recent years they've drifted apart.Thankfully for us, David Squires is here to change all that. Based out of Sydney, his soccer comics have appeared everywhere from the Guardian to Pickles Magazine. In a sport full of handsome paychecks and corporate sponsors, his work casts a critical eye over corrupt backroom workings and helps pierce soccer's overblown balloon. This book is an anthology of some of David's best work. WARNING! Is sure to ignite debate and spark hilarity.","sale_price":958,"quantity":9,"category_id":6,"enabled":1,"author":"David Squires","edition":0,"is_used_book":0,"publisher":"Century","published_at":"2016-11-03","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/7322","created_at":"2019-02-05 16:09:57","updated_at":"2022-07-09 07:40:17","deleted_at":null,"number_of_pages":206,"weight":600,"slug":"the-illustrated-history-of-football","is_hard_cover":0,"path":"\/books\/the-illustrated-history-of-football","shareable_url":"https:\/\/booksmandala.com\/books\/the-illustrated-history-of-football","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":7322,"disk":"uploads","directory":"1\/items","filename":"8186z2EbtCL","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":331791,"created_at":"2019-09-30 16:18:58","updated_at":"2019-09-30 16:18:58","deleted_at":null,"pivot":{"mediable_id":19492,"media_id":7322,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":18772,"name":"Tiger Woods","sku":"9781471175374","description":"SHORTLISTED FOR THE WILLIAM HILL SPORTS BOOK OF THE YEAR 2018\r\nTHE OBSERVER BOOK OF THE YEAR\r\n\r\n'A rattling read... Superbly written' Derek Lawrenson, Daily Mail\r\n`Arguably the most serious attempt ever made to get behind golf's great enigma' Emma John, Guardian\r\n'Exhilarating, depressing, tawdry and moving... perfectly pitched biography' Dwight Garner, New York Times\r\n\r\nBased on three years of extensive research and reporting, two of today's most acclaimed investigative journalists, Jeff Benedict of Sports Illustrated and eleven-time Emmy Award winner Armen Keteyian, deliver the first major biography of Tiger Woods - sweeping in scope and packed with groundbreaking, behind-the-scenes details of the Shakespearean rise and epic fall of a global icon.\r\n\r\nIn 2009, Tiger Woods was the most famous athlete on the planet, a transcendent star of almost unfathomable fame and fortune living what appeared to be the perfect life - married to a Swedish beauty and the father of two young children. Winner of fourteen major golf championships and seventy-nine PGA Tour events, Woods was the first billion-dollar athlete, earning more than $100 million a year in endorsements from the likes of Nike, Gillette, AT&T and Gatorade.\r\n\r\nBut it was all a carefully crafted illusion. As it turned out, Woods had been living a double life for years - one that exploded in the aftermath of a late-night crash that exposed his serial infidelity and sent his personal and professional life off a cliff. In Tiger Woods, Jeff Benedict and Armen Keteyian dig deep behind the headlines to produce a richly reported answer to the question that has mystified millions of sports fans for nearly a decade: who is Tiger Woods?\r\n\r\nDrawing on more than four hundred interviews with people from every corner of Woods's life - friends, family members, teachers, romantic partners, swing coaches, business associates, Tour pros and members of Woods's inner circle - Benedict and Keteyian construct a captivating psychological profile of an African-American child programmed by an attention-grabbing father and the original Tiger Mom to be the 'chosen one', to change not just the game of golf, but the world as well. But at what cost?\r\n\r\nBenedict and Keteyian provide the startling answers in a biography destined to make headlines and linger in the minds of readers for years to come.","sale_price":1118,"quantity":9,"category_id":6,"enabled":1,"author":"Jeff Benedict, Armen Keteyian","edition":0,"is_used_book":0,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/4557","created_at":"2019-01-08 22:17:15","updated_at":"2020-10-03 11:13:03","deleted_at":null,"number_of_pages":490,"weight":620,"slug":"tiger-woods","is_hard_cover":0,"path":"\/books\/tiger-woods","shareable_url":"https:\/\/booksmandala.com\/books\/tiger-woods","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":4557,"disk":"uploads","directory":"1\/items","filename":"9781471175374","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":16546,"created_at":"2019-08-19 10:41:05","updated_at":"2019-08-19 10:41:05","deleted_at":null,"pivot":{"mediable_id":18772,"media_id":4557,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":10468,"name":"Yuvi","sku":"9789350295793","description":"Please Read Notes: Brand New, International Softcover Edition, Printed in black and white pages, minor self wear on the cover or pages, Sale restriction may be printed on the book, but Book name, contents, and author are exactly same as Hardcover Edition. Fast delivery through DHL\/FedEx express.","sale_price":318,"quantity":9,"category_id":6,"enabled":1,"author":"Makarand Waingankar","edition":0,"is_used_book":0,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/4503","created_at":"2016-11-25 08:36:43","updated_at":"2021-06-04 13:30:25","deleted_at":null,"number_of_pages":180,"weight":170,"slug":"yuvi","is_hard_cover":0,"path":"\/books\/yuvi","shareable_url":"https:\/\/booksmandala.com\/books\/yuvi","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":4503,"disk":"uploads","directory":"1\/items","filename":"9789350295793","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":23917,"created_at":"2019-08-18 12:12:06","updated_at":"2019-08-18 12:12:06","deleted_at":null,"pivot":{"mediable_id":10468,"media_id":4503,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":21250,"name":"The Fix","sku":"9789389109016","description":"Will the profusely talented Sanam Khan’s rise to the pinnacle of world cricket be interrupted by the bookies and the powerful match-fixing mafia?\r\n\r\nEver since she was fifteen years old, the talented Sanam Khan has only had one dream: to win a world cup for her country. Now, thanks to her own efforts as the captain, her team of talented misfits in the Pakistan Women’s cricket team stand on the verge of realizing that dream. But fate intervenes, and the team’s success attracts the great corruptors of the sport, the match-fixing syndicates that captured the men’s team two decades ago. Will Sanam and her girls succeed where the men failed, or will history repeat itself?","sale_price":638,"quantity":8,"category_id":6,"enabled":1,"author":"Omar Shahid Hamid","edition":1,"is_used_book":0,"publisher":"Pan Macmillan India","published_at":"2019-01-01","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/7677","created_at":"2019-10-19 14:39:33","updated_at":"2020-09-23 11:47:08","deleted_at":null,"number_of_pages":252,"weight":200,"slug":"the-fix-1","is_hard_cover":0,"path":"\/books\/the-fix-1","shareable_url":"https:\/\/booksmandala.com\/books\/the-fix-1","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":7677,"disk":"uploads","directory":"1\/items","filename":"9789389109016","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":35725,"created_at":"2019-10-19 14:39:33","updated_at":"2019-10-19 14:39:33","deleted_at":null,"pivot":{"mediable_id":21250,"media_id":7677,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":1283,"name":"Fallen Giants","sku":"9780300164206","description":"The story of the world's highest peaks and the remarkable people who have sought to climb them  The first successful ascent of Mount Everest in 1953 by Sir Edmund Hillary and his Sherpa teammate Tenzing Norgay is a familiar saga, but less well known are the tales of many other adventurers who also came to test their skills and courage against the world's highest and most dangerous mountains. In this lively and generously illustrated book, historians Maurice Isserman and Stewart Weaver present the first comprehensive history of Himalayan mountaineering in fifty years. They offer detailed, original accounts of the most significant climbs since the 1890s, and they compellingly evoke the social and cultural worlds that gave rise to those expeditions. The book recounts the adventures of such figures as Martin Conway, who led the first authentic Himalayan climbing expedition in 1892; Fanny Bullock Workman, the pioneer explorer of the Karakoram range; George Mallory, the romantic martyr of Mount Everest fame; Charlie Houston, who led American expeditions to K2 in the 1930s and 1950s; Ang Tharkay, the legendary Sherpa, and many others. Throughout, the authors discuss the effects of political and social change on the world of mountaineering, and they offer a penetrating analysis of a culture that once emphasized teamwork and fellowship among climbers, but now has been eclipsed by a scramble for individual fame and glory.","sale_price":1110,"quantity":8,"category_id":6,"enabled":1,"author":"Maurice Isserman,Stewart Weaver","edition":0,"is_used_book":0,"publisher":"Yale University Press","published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/1942","created_at":"2016-08-22 11:41:53","updated_at":"2020-08-31 06:24:45","deleted_at":null,"number_of_pages":579,"weight":1060,"slug":"fallen-giants","is_hard_cover":0,"path":"\/books\/fallen-giants","shareable_url":"https:\/\/booksmandala.com\/books\/fallen-giants","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":1942,"disk":"uploads","directory":"1\/items","filename":"9780300164206","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":36162,"created_at":"2019-08-01 11:12:50","updated_at":"2019-08-01 11:12:50","deleted_at":null,"pivot":{"mediable_id":1283,"media_id":1942,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":1290,"name":"south col: one man's adventure on the ascent of everest 1953","sku":"9781841582696","description":"Wilfrid Noyce was the first member of the 1953 Everest expedition to accomplish the ascent of the South Col, the small plateau just below the summit. His memoir captures the numbing feeling of intense cold, the shriek of high winds, and the austere beauty of glacier and snowfall and stone.","sale_price":632,"quantity":8,"category_id":6,"enabled":1,"author":"wilfrid noyce","edition":0,"is_used_book":0,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/covers.openlibrary.org\/b\/isbn\/9781841582696-L.jpg","created_at":"2016-08-22 11:48:54","updated_at":"2020-08-31 05:38:21","deleted_at":null,"number_of_pages":324,"weight":435,"slug":"south-col-one-mans-adventure-on-the-ascent-of-everest-1953","is_hard_cover":0,"path":"\/books\/south-col-one-mans-adventure-on-the-ascent-of-everest-1953","shareable_url":"https:\/\/booksmandala.com\/books\/south-col-one-mans-adventure-on-the-ascent-of-everest-1953","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[]},{"id":19598,"name":"Endure: Mind, Body And The Curiously Elastic Limits Of Human Performance","sku":"9780008277062","description":"From the National Magazine Award-winning Runner’s World columnist, frequent New Yorker online contributor, and Cambridge-trained physicist: a fascinating and definitive exploration of the extraordinary science of human endurance and the secrets of human performance, for fans of The Sports Gene, Born to Run, and Grit.\r\n\r\nFrom running a two-hour marathon to summiting Mount Everest, we’re fascinated by the extremes of human endurance, constantly testing both our physical and psychological limits.\r\n\r\nHow high or far or fast can humans go? And what about individual potential: what defines a person’s limits?\r\n\r\nFor years, physiology determined the answer: heart size, lung capacity, and muscle strength. But over the past decade, a wave of dramatic findings in the cutting-edge science of endurance has completely overturned our understanding of human limitation. Endure widely disseminates these findings for the first time: It’s the brain that dictates how far we can go—which means we can always push ourselves further.\r\n\r\nHutchinson presents an overview of science’s search for understanding human fatigue, from crude experiments with electricity and frogs’ legs to sophisticated brain imaging technology. Going beyond the traditional mechanical view of human limits (like a car with a brick on its gas pedal, we go until the tank runs out of gas), he instead argues that a key element in endurance is how the brain responds to distress signals—whether heat, or cold, or muscles screaming with lactic acid—and reveals that we can train to improve brain response.\r\n\r\nAn elite distance runner himself, Hutchinson takes us to the forefront of the new sports psychology—brain electrode jolts, computer-based training, subliminal messaging—and presents startling new discoveries enhancing the performance of athletes today and shows how anyone can utilize these tactics to bolster their own performance—and get the most out of their bodies.","sale_price":958,"quantity":8,"category_id":6,"enabled":1,"author":"Alex Hutchinson","edition":0,"is_used_book":0,"publisher":"Harper Collins","published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/3973","created_at":"2019-02-13 12:44:48","updated_at":"2022-05-08 12:41:13","deleted_at":null,"number_of_pages":306,"weight":345,"slug":"endure-mind-body-and-the-curiously-elastic-limits-of-human-performance","is_hard_cover":0,"path":"\/books\/endure-mind-body-and-the-curiously-elastic-limits-of-human-performance","shareable_url":"https:\/\/booksmandala.com\/books\/endure-mind-body-and-the-curiously-elastic-limits-of-human-performance","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":3973,"disk":"uploads","directory":"1\/items","filename":"9780008277062","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":11340,"created_at":"2019-08-15 05:01:42","updated_at":"2019-08-15 05:01:42","deleted_at":null,"pivot":{"mediable_id":19598,"media_id":3973,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]}],"links":{"first":"https:\/\/booksmandala.com\/api\/books?page=1","last":"https:\/\/booksmandala.com\/api\/books?page=13","prev":"https:\/\/booksmandala.com\/api\/books?page=1","next":"https:\/\/booksmandala.com\/api\/books?page=3"},"meta":{"current_page":2,"from":17,"last_page":13,"path":"https:\/\/booksmandala.com\/api\/books","per_page":16,"to":32,"total":200}}