{"data":[{"id":26152,"name":"The Mamba Mentality","sku":"9780374201234","description":"In the wake of his retirement from professional basketball, Kobe “The Black Mamba” Bryant has decided to share his vast knowledge and understanding of the game to take readers on an unprecedented journey to the core of the legendary “Mamba mentality.” Citing an obligation and an opportunity to teach young players, hardcore fans, and devoted students of the game how to play it “the right way,” The Mamba Mentality takes us inside the mind of one of the most intelligent, analytical, and creative basketball players ever.\r\n\r\nFor the first time, and in his own words, Bryant reveals his famously detailed approach and the steps he took to prepare mentally and physically to not just succeed at the game, but to excel. Readers will learn how Bryant studied an opponent, how he channeled his passion for the game, how he played through injuries. They’ll also get fascinating granular detail as he breaks down specific plays and match-ups from throughout his career.\r\n\r\nBryant’s detailed accounts are paired with stunning photographs by the Hall of Fame photographer Andrew D. Bernstein. Bernstein, long the Lakers and NBA official photographer, captured Bryant’s very first NBA photo in 1996 and his last in 2016—and hundreds of thousands in between, the record of a unique, twenty-year relationship between one athlete and one photographer.","sale_price":4158,"quantity":0,"category_id":6,"enabled":1,"author":"Kobe Bryant","edition":1,"is_used_book":0,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/15701","created_at":"2021-01-30 13:21:21","updated_at":"2021-02-02 06:30:39","deleted_at":null,"number_of_pages":208,"weight":1335,"slug":"the-mamba-mentality","is_hard_cover":1,"path":"\/books\/the-mamba-mentality","shareable_url":"https:\/\/booksmandala.com\/books\/the-mamba-mentality","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":15701,"disk":"uploads","directory":"1\/items","filename":"40230101._SX318_","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":37126,"created_at":"2021-01-30 13:21:21","updated_at":"2021-01-30 13:21:21","deleted_at":null,"pivot":{"mediable_id":26152,"media_id":15701,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":21290,"name":"Soccernomics","sku":"9780008236649","description":"'Magnificent... Freakonomics for football' - Guardian This is the revised and expanded 5th edition of the international bestseller about why Spain, Germany and Brazil win, and why the USA, Japan, Australia - and even Iraq - are destined to become the kings of the world's most popular sport. Football truly is the world's favourite game, followed in over 200 countries by hundreds of millions of people pouring their hearts and souls into supporting their chosen team every week. But behind the passion are questions that all true football aficionados want to know: why do England lose whilst German and Brazil win? How have Spain conquered the world? Why do so many clubs buy the wrong players? Fully revised and updated, Soccernomics is the revolutionary guide from an economist and a sports writer who answer all these questions and more.","sale_price":798,"quantity":0,"category_id":6,"enabled":1,"author":"Simon Kuper,Stefan Szymanski","edition":1,"is_used_book":0,"publisher":"HarperCollins","published_at":"2018-05-31","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/7728","created_at":"2019-10-21 14:28:06","updated_at":"2020-01-05 11:42:05","deleted_at":null,"number_of_pages":576,"weight":420,"slug":"soccernomics","is_hard_cover":null,"path":"\/books\/soccernomics","shareable_url":"https:\/\/booksmandala.com\/books\/soccernomics","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":7728,"disk":"uploads","directory":"1\/items","filename":"9780008236649","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":49863,"created_at":"2019-10-21 14:28:06","updated_at":"2019-10-21 14:28:06","deleted_at":null,"pivot":{"mediable_id":21290,"media_id":7728,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":28209,"name":"The Racer","sku":"u9780224100083","description":"What is it really like to be a racer? How does it feel to be reeled in from a solo breakaway meters from the line? What tactics must teams employ to win the day, the jersey, the grand tour? How does a domestique keep going to the end of a stage once his job is done and his body exhausted? What sacrifices must a cyclist make to reach the highest levels? What camaraderie is built in the confines of a team? What rivalries? How does it feel to be constantly on the road, away from loved ones, tasting one more calorie-counted hotel breakfast? David Millar offers us a unique insight into the mind of a professional cyclist during his last year before retirement. Over the course of a season on the World Tour, Millar puts us in touch with the sights, smells, and sounds of the sport--the barked instructions of a road captain in a sprint chain, the silence of a solo training ride. This is a book about youth and age, fresh-faced excitement and hard-earned experience. It is a love letter to cycling.","sale_price":250,"quantity":0,"category_id":6,"enabled":1,"author":"David Millar","edition":1,"is_used_book":1,"publisher":"Yellow Jersey Press","published_at":"2016-05-05","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/18625","created_at":"2021-09-07 12:44:46","updated_at":"2022-05-03 08:29:00","deleted_at":null,"number_of_pages":304,"weight":250,"slug":"the-racer","is_hard_cover":0,"path":"\/books\/the-racer","shareable_url":"https:\/\/booksmandala.com\/books\/the-racer","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":18625,"disk":"uploads","directory":"1\/items","filename":"27384097","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":47377,"created_at":"2021-09-07 12:44:46","updated_at":"2021-09-07 12:44:46","deleted_at":null,"pivot":{"mediable_id":28209,"media_id":18625,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":23091,"name":"It's Not About the Bike: My Journey Back to Life","sku":"U9780224060875","description":"People around the world have found inspiration in the story of Lance Armstrong--a world-class athlete nearly struck down by cancer, only to recover and win the Tour de France, the multiday bicycle race famous for its gruelling intensity. Armstrong is a thoroughgoing Texan jock, and the changes brought to his life by his illness are startling and powerful, but he's just not interested in wearing a hero suit. While his vocabulary is a bit on the he-man side (highest compliment to his wife: \"she's a stud\"), his actions will melt the most hard-bitten souls: a cancer foundation and benefit bike ride, his astonishing commitment to training that got him past countless hurdles, loyalty to the people and corporations that never gave up on him. There's serious medical detail here, which may not be for the faint of heart; from chemo to surgical procedures to his wife's in vitro fertilization, you won't be spared a single x-ray, IV drip, or unfortunate side effect. Athletes and coaches everywhere will benefit from the same extraordinary detail provided about training sessions--every aching tendon, every rainy afternoon, and every small triumph during his long recovery is here in living colour. It's Not About the Bike is the perfect title for this book about life, death, illness, family, setbacks, and triumphs, but not especially about the bike.","sale_price":250,"quantity":0,"category_id":6,"enabled":1,"author":"Lance Armstrong","edition":1,"is_used_book":1,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/11584","created_at":"2020-07-07 11:08:25","updated_at":"2020-07-07 15:10:46","deleted_at":null,"number_of_pages":294,"weight":240,"slug":"its-not-about-the-bike-my-journey-back-to-life","is_hard_cover":null,"path":"\/books\/its-not-about-the-bike-my-journey-back-to-life","shareable_url":"https:\/\/booksmandala.com\/books\/its-not-about-the-bike-my-journey-back-to-life","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":11584,"disk":"uploads","directory":"1\/items","filename":"9780224060875 (1)","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":31966,"created_at":"2020-07-07 11:08:25","updated_at":"2020-07-07 11:08:25","deleted_at":null,"pivot":{"mediable_id":23091,"media_id":11584,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":27189,"name":"The Tao Of Chess","sku":"9781593370688","description":"The real secrets to winning the game of chess - and the game of lifeChess mastery has been recognized since ancient times as an unparalleled way to learn political strategy, but until now no book has explored the life lessons chess teaches and how they can transform lives. In The Tao of Chess, the author seamlessly blends the wisdom of a time-honoured spiritual quest for truth with 200 principles that will improve anyone's chess game. By following the author's principles, readers not only come to enjoy the game more, they develop a habit of seeking underlying truth - whether in a chess game or a real-life situation.The Tao of Chess is full of conscise advice, such as:Understanding is more important than memoryFortune favors the braveWhen you see a good move, wait and look for a better moveMistakes tend to come in bunchesTrust your intuition; it's usually rightAuthoritative and easy to follow, this book will turn every reader into a master strategist.","sale_price":720,"quantity":0,"category_id":6,"enabled":1,"author":"Peter Kurzdorfer","edition":1,"is_used_book":0,"publisher":"Adams Media","published_at":"2004-07-12","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/17530","created_at":"2021-08-12 12:33:17","updated_at":"2022-04-27 13:43:35","deleted_at":null,"number_of_pages":256,"weight":200,"slug":"the-tao-of-chess","is_hard_cover":0,"path":"\/books\/the-tao-of-chess","shareable_url":"https:\/\/booksmandala.com\/books\/the-tao-of-chess","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":17530,"disk":"uploads","directory":"1\/items","filename":"9781593370688","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":26313,"created_at":"2021-08-12 12:33:17","updated_at":"2021-08-12 12:33:17","deleted_at":null,"pivot":{"mediable_id":27189,"media_id":17530,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":25656,"name":"Breath","sku":"9780241289082","description":"There is nothing more essential to our health and wellbeing than breathing- take air in, let it out, repeat 25,000 times a day. Yet, as a species, humans have lost the ability to breathe correctly, with grave consequences. Journalist James Nestor travels the world to figure out what went wrong and how to fix it.The answers aren't found in pulmonology labs, as we might expect, but in the muddy digs of ancient burial sites, secret Soviet facilities, New Jersey choir schools, and the smoggy streets of S o Paulo, Brazil. Nestor tracks down men and women exploring the hidden science behind ancient breathing practices like Pranayama, Sudarshan Kriya and Tummo and teams up with pulmonary tinkerers to scientifically test longheld beliefs about how we breathe.Modern research is showing us that making even slight adjustments to the way we inhale and exhale can jump-start athletic performance, rejuvenate internal organs, halt snoring, allergies, asthma and autoimmune disease, and even straighten scoliotic spines. None of this should be possible, and yet it is.Drawing on thousands of years of medical texts and recent cutting-edge studies in pulmonology, psychology, biochemistry and human physiology, Breath turns the conventional wisdom of what we thought we knew about our most basic biological function on its head.You will never breathe the same again.","sale_price":1118,"quantity":0,"category_id":6,"enabled":1,"author":"James Nestor","edition":1,"is_used_book":0,"publisher":null,"published_at":"2020-05-21","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/14885","created_at":"2020-10-11 13:39:33","updated_at":"2022-04-23 06:18:58","deleted_at":null,"number_of_pages":304,"weight":320,"slug":"breath","is_hard_cover":0,"path":"\/books\/breath","shareable_url":"https:\/\/booksmandala.com\/books\/breath","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":14885,"disk":"uploads","directory":"1\/items","filename":"9780241289082","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":15996,"created_at":"2020-10-11 13:39:33","updated_at":"2020-10-11 13:39:33","deleted_at":null,"pivot":{"mediable_id":25656,"media_id":14885,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":25146,"name":"Running Like a Girl","sku":"U9780099558958","description":"Alexandra had high hopes: the arse of an athlete, the waist of a supermodel, the speed of a gazelle. Defeated by gyms and bored of yoga, she decided to run.\r\n\r\nHer first attempt did not end well. Six years later, she has run five marathons in two continents. But, as her dad says, you run with your head as much as with your legs. So, while this is a book about running, it's not just about running. You could say it's about ambition (yes, getting out of bed on a rainy Sunday morning counts), relationships (including talking to the intimidating staff in the trainer shop), as well as your body (your boobs don't have to wobble when you run). But it's also about realising that you can do more than you ever thought possible.\r\n\r\nVery funny, very honest, and very emotional, whether you're in serious training or thinking about running for the bus, this is a book for anyone who after wine and crisps for supper a few too many times thinks they might...just might...like to run like a girl.\r\n\r\nAlexandra Heminsley is a freelance journalist and broadcaster and a dedicated runner.","sale_price":250,"quantity":0,"category_id":6,"enabled":1,"author":"Alexandra Heminsley","edition":1,"is_used_book":1,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/13715","created_at":"2020-08-20 11:59:18","updated_at":"2021-11-10 08:43:07","deleted_at":null,"number_of_pages":226,"weight":185,"slug":"running-like-a-girl","is_hard_cover":0,"path":"\/books\/running-like-a-girl","shareable_url":"https:\/\/booksmandala.com\/books\/running-like-a-girl","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":13715,"disk":"uploads","directory":"1\/items","filename":"9780099558958","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":25013,"created_at":"2020-08-20 11:59:18","updated_at":"2020-08-20 11:59:18","deleted_at":null,"pivot":{"mediable_id":25146,"media_id":13715,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":25916,"name":"How to Build a Car","sku":"9780008196806","description":"The world's foremost designer in Formula One, Adrian Newey OBE is arguably one of Britain's greatest engineers and this is his fascinating, powerful memoir. How to Build a Car explores the story of Adrian's unrivalled 35-year career in Formula One through the prism of the cars he has designed, the drivers he has worked alongside and the races in which he's been involved. A true engineering genius, even in adolescence Adrian's thoughts naturally emerged in shape and form - he began sketching his own car designs at the age of 12 and took a welding course in his school summer holidays. From his early career in IndyCar racing and on to his unparalleled success in Formula One, we learn in comprehensive, engaging and highly entertaining detail how a car actually works. Adrian has designed for the likes of Mario Andretti, Nigel Mansell, Alain Prost, Damon Hill, David Coulthard, Mika Hakkinen, Mark Webber and Sebastian Vettel, always with a shark-like purity of purpose: to make the car go faster. And while his career has been marked by unbelievable triumphs, there have also been deep tragedies; most notably Ayrton Senna's death during his time at Williams in 1994. Beautifully illustrated with never-before-seen drawings, How to Build a Car encapsulates, through Adrian's remarkable life story, precisely what makes Formula One so thrilling - its potential for the total synchronicity of man and machine, the perfect combination of style, efficiency and speed.","sale_price":1758,"quantity":0,"category_id":6,"enabled":1,"author":"Adrian Newey","edition":1,"is_used_book":0,"publisher":"HarperCollins","published_at":"2017-11-01","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/15232","created_at":"2020-12-02 09:07:22","updated_at":"2021-06-03 07:08:32","deleted_at":null,"number_of_pages":400,"weight":1300,"slug":"how-to-build-a-car","is_hard_cover":1,"path":"\/books\/how-to-build-a-car","shareable_url":"https:\/\/booksmandala.com\/books\/how-to-build-a-car","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":15232,"disk":"uploads","directory":"1\/items","filename":"35657708._SX318_","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":23879,"created_at":"2020-12-02 09:07:22","updated_at":"2020-12-02 09:07:22","deleted_at":null,"pivot":{"mediable_id":25916,"media_id":15232,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":26175,"name":"Mascot","sku":"9780062911056","description":"Noah Savino has been stuck in a wheelchair for months. He hates the way people treat him like he’s helpless now. He’s sick of going to physical therapy, where he isn’t making any progress. He’s tired of not having control over his own body. And he misses playing baseball—but not as much as he misses his dad, who died in the car accident that paralyzed Noah.","sale_price":638,"quantity":0,"category_id":6,"enabled":1,"author":"Antony John","edition":1,"is_used_book":0,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/15898","created_at":"2021-02-08 08:48:41","updated_at":"2022-03-08 13:47:52","deleted_at":null,"number_of_pages":336,"weight":315,"slug":"mascot","is_hard_cover":0,"path":"\/books\/mascot","shareable_url":"https:\/\/booksmandala.com\/books\/mascot","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":15898,"disk":"uploads","directory":"1\/items","filename":"51wPA8UQ8JL._SX329_BO1,204,203,200_","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":34758,"created_at":"2021-02-08 08:48:41","updated_at":"2021-02-08 08:48:41","deleted_at":null,"pivot":{"mediable_id":26175,"media_id":15898,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":24905,"name":"I Am the Secret Footballer","sku":"U9781783350049","description":"This updated edition of the bestselling and wildly popular I Am the Secret Footballer features a new introduction and an additional chapter. The anonymous writer of the Guardian's 'Secret Footballer' column gives Premier League fans an insider's look into the unseen world of professional football. 'It is often said that 95% of what happens in football takes place behind closed doors. Many of these stories I shouldn't be telling you. But I will.' Who is The Secret Footballer? Only a few people know the true identity of the man inside the game. Whoever he is-and whatever team he plays for - TSF is always honest, fearless and opinionated. Here he takes readers past the locker-room door and reveals the inner workings of a professional club, the exhilarating highs and crushing lows, and what it's really like to do the job most of us can only dream of doing. TFS chronicles the exploits of his Premiership colleagues with a gimlet eye and frank humour. Managers, agents and players are not spared from his observations - their mindsets, their relationships with those outside the sport, their behaviour good and bad. In his inimitable style, TSF recounts entertaining and eyebrow-raising vignettes, naming names and dropping colourful details along the way.","sale_price":250,"quantity":0,"category_id":6,"enabled":1,"author":"Guardian Staff","edition":1,"is_used_book":1,"publisher":"Guardian Books","published_at":"2013-09-01","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/13476","created_at":"2020-08-18 11:55:29","updated_at":"2021-04-07 11:56:54","deleted_at":null,"number_of_pages":239,"weight":200,"slug":"i-am-the-secret-footballer","is_hard_cover":0,"path":"\/books\/i-am-the-secret-footballer","shareable_url":"https:\/\/booksmandala.com\/books\/i-am-the-secret-footballer","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":13476,"disk":"uploads","directory":"1\/items","filename":"9781783350049","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":39671,"created_at":"2020-08-18 11:55:29","updated_at":"2020-08-18 11:55:29","deleted_at":null,"pivot":{"mediable_id":24905,"media_id":13476,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":25188,"name":"Start the Car: The World According to Bumble","sku":"U9780007382873","description":"Welcome to the weird and wonderful world of \"Bumble\", the legendary SkySports cricket commentator who's one ball short of an over and delivers madcap moments galore in this ebullient, endearing and hilarious new book.\r\n\r\nDavid \"Bumble\" Lloyd is a legend in our living rooms, a genuine \"good bloke\" all cricket fans feel they know inside out because of his infectious, larger-than-life personality and that distinctive Lancashire burr.\r\n\r\nBumble has become the one constant for passionate English fans in cricket's rapidly changing landscape. He has earned cult status as a commentator and pundit, with viewers loving his unerring dedication to the game's great fables.\r\n\r\n'The World According to Bumble: Start the Car' revels in the quirkier and humorous side of cricket, while offering behind-the-scenes action of Lloyd's years spent following cricket around the globe, from Accrington to Lahore.\r\n\r\nBumble waxes lyrical on everything from the genius of Shane Warne to the merits of Lancashire’s premier pies … and the delights of finishing the day with a couple of pints and a curry.\r\n\r\nEnjoy the camaraderie that exists among the SkySports team - including former England captains Sir Ian Botham, Michael Atherton, Nasser Hussain and David Gower - and laugh out loud at the stories and anecdotes which have forged Bumble's character.\r\n\r\nWhether he is holding up play to retrieve lost balls from the top of sight-screens, or enacting mock pitch reports from car parks, Bumble is capable of stealing the limelight at all times.","sale_price":250,"quantity":0,"category_id":6,"enabled":1,"author":"David Lloyd","edition":1,"is_used_book":1,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/13757","created_at":"2020-08-21 09:01:11","updated_at":"2022-05-22 10:21:29","deleted_at":null,"number_of_pages":321,"weight":275,"slug":"start-the-car-the-world-according-to-bumble","is_hard_cover":0,"path":"\/books\/start-the-car-the-world-according-to-bumble","shareable_url":"https:\/\/booksmandala.com\/books\/start-the-car-the-world-according-to-bumble","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":13757,"disk":"uploads","directory":"1\/items","filename":"9780007382873","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":64643,"created_at":"2020-08-21 09:01:11","updated_at":"2020-08-21 09:01:11","deleted_at":null,"pivot":{"mediable_id":25188,"media_id":13757,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":24692,"name":"Fever Pitch","sku":"U9780575400153","description":"Free Delivery if order value from the seller is greater than 399. Used Book in good condition. No missing\/ torn pages. No stains. Note: The above used product classification has been solely undertaken by the seller. Amazon shall neither be liable nor responsible for any used product classification undertaken by the seller. A-to-Z Guarantee not applicable on used products.","sale_price":250,"quantity":0,"category_id":6,"enabled":1,"author":"Nick Hornby","edition":1,"is_used_book":1,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/13272","created_at":"2020-08-12 11:31:11","updated_at":"2020-09-03 10:45:14","deleted_at":null,"number_of_pages":247,"weight":190,"slug":"fever-pitch","is_hard_cover":0,"path":"\/books\/fever-pitch","shareable_url":"https:\/\/booksmandala.com\/books\/fever-pitch","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":13272,"disk":"uploads","directory":"1\/items","filename":"9780575400153","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":20318,"created_at":"2020-08-12 11:31:11","updated_at":"2020-08-12 11:31:11","deleted_at":null,"pivot":{"mediable_id":24692,"media_id":13272,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":24698,"name":"My Time","sku":"U9780224092142","description":"On 22 July 2012 Bradley Wiggins made history as the first British cyclist to win the Tour de France. Ten days later at the London Olympic Games he won the time trial to become his country's most decorated Olympian. In an instant 'Wiggo', the kid from Kilburn, was a national hero. Two years previously, however, Wiggins had been staring into the abyss. His much-hyped attempt to conquer the 2010 Tour de France had ended in public humiliation. Poor results and indifferent form left him facing the sack from Team Sky. And then he was hit with the tragic news of the death of his granddad, George, the man who had raised him as a young boy. At rock bottom, Wiggins had to reach deep inside himself and find the strength to fight his way back. Outspoken, honest, intelligent and fearless, Wiggins has been hailed as the people's champion. In My Time he tells the story of the remarkable journey that led him from his lowest ebb to win the world's toughest race. In his own words he reveals the personal anguish that has driven him on and what it's like behind the scenes at Team Sky: the brutal training regimes, the sacrifices and his views on his teammates and rivals. He talks too about his anger at the spectre of doping that pursues his sport, how he dealt with the rush of taking Olympic gold and above all what it takes to be the greatest.","sale_price":250,"quantity":0,"category_id":6,"enabled":1,"author":"Bradley Wiggins,William Fotheringham","edition":1,"is_used_book":1,"publisher":"Random House","published_at":"2013-01-01","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/13278","created_at":"2020-08-12 12:09:20","updated_at":"2022-03-11 11:19:56","deleted_at":null,"number_of_pages":320,"weight":295,"slug":"my-time","is_hard_cover":null,"path":"\/books\/my-time","shareable_url":"https:\/\/booksmandala.com\/books\/my-time","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":13278,"disk":"uploads","directory":"1\/items","filename":"9780224092142","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":28971,"created_at":"2020-08-12 12:09:20","updated_at":"2020-08-12 12:09:20","deleted_at":null,"pivot":{"mediable_id":24698,"media_id":13278,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":25211,"name":"Neutral Buoyancy","sku":"U9780140287301","description":"In Neutral Buoyancy, journalist and diver Tim Ecott takes you on a guided tour of the history of undersea exploration and the emergence of diving culture. He tells the extraordinary story of man's attempts to breathe underwater, from the sponge divers described by Aristotle, to the development of sixteenth-century diving bells, to the invention of modern scuba equipment. Along the way, Ecott intersperses the story with his own thrilling adventures, from the waters of the South Pacific to the remote islands of the Seychelles, from explorations in the clear, flowing tides of Sardinia to a near-death experience in the cold gray depths of the English Channel. Filled with engaging stories of humanity's conquest of the undersea world -- and heart-pounding action that will leave you breathless -- Neutral Buoyancy is a compelling blend of history and adventure, an exciting overview of the world of undersea diving. \"As elemental, entertaining, and stimulating as the environment it traces.\" -- Kirkus Reviews \"Engaging ... Neutral Buoyancy will certainly become cult reading for divers.\" -- Alexander Urquhart, The Times Literary Supplement \"Ecott's encyclopedic recounting of diving history ... should be awarded a place on any diver's reference shelf.\" -- Paul McHugh, San Francisco Chronicle","sale_price":250,"quantity":0,"category_id":6,"enabled":1,"author":"Tim Ecott","edition":1,"is_used_book":1,"publisher":"Penguin Group(CA)","published_at":"2002-01-01","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/13781","created_at":"2020-08-21 10:38:48","updated_at":"2021-08-02 13:09:15","deleted_at":null,"number_of_pages":345,"weight":285,"slug":"neutral-buoyancy","is_hard_cover":0,"path":"\/books\/neutral-buoyancy","shareable_url":"https:\/\/booksmandala.com\/books\/neutral-buoyancy","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":13781,"disk":"uploads","directory":"1\/items","filename":"9780140287301","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":19548,"created_at":"2020-08-21 10:38:48","updated_at":"2020-08-21 10:38:48","deleted_at":null,"pivot":{"mediable_id":25211,"media_id":13781,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":19582,"name":"The Little Book of Zlatan","sku":"9780008263508","description":"The Little Book of Zlatan is a celebration of one of the most charismatic, mercurial and talismanic footballers in the game, an individual so distinct, so talented and so perfect that he must refer to himself in the third person at all times.Throughout history, there have been many, many truly outstanding sportsmen and women. These are the individuals that have pushed the boundaries of their sport, set incredible new records or driven the human body to its physiological limits. Every day we celebrate the feats of the fastest, strongest and most brilliantly technical athletes on the planet.However, if we interrogate that history further, there are some individuals that stand head and shoulders above the others, modern day heroes who can be attributed with the status of 'icon' or 'legend' - and who are consequently bequeathed a peerless position in society. These individuals are not only differentiated by their awe-inspiring dominance of their own sport, but by the way in which we - the normal folk - reflect upon their contribution and indeed their cultural legacy.What makes Muhammad Ali, Ayrton Senna, Usain Bolt and Maradona the greatest of all time? Is it the success they achieved or the way in which they achieved it?The answer - perhaps reassuringly in an era of big data, football academies, sports science and media training - lies in the cult of personality. Zlatan is an icon not just because of his extraordinary records on the field, but because his personality has never had to take a back seat on the journey. Let's be honest, which other footballer would say - with an entirely straight face: \"One thing is for sure. A World Cup without Zlatan is nothing.\"There is only one Zlatan Ibrahimovic.","sale_price":478,"quantity":0,"category_id":6,"enabled":1,"author":"Malcolm Olivers","edition":0,"is_used_book":0,"publisher":"HarperCollins","published_at":"2017-11-02","thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/4640","created_at":"2019-02-13 11:40:27","updated_at":"2019-10-16 11:02:44","deleted_at":null,"number_of_pages":144,"weight":140,"slug":"the-little-book-of-zlatan","is_hard_cover":null,"path":"\/books\/the-little-book-of-zlatan","shareable_url":"https:\/\/booksmandala.com\/books\/the-little-book-of-zlatan","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":4640,"disk":"uploads","directory":"1\/items","filename":"9780008263508","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":29689,"created_at":"2019-08-20 07:51:16","updated_at":"2019-08-20 07:51:16","deleted_at":null,"pivot":{"mediable_id":19582,"media_id":4640,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]},{"id":1166,"name":"My life","sku":"9788184001914","description":"Brett Lee is one of cricket’s most prolific personalities. Recipient of the prestigious Allan Border Medal and a former Test Player of the Year—the blond speedster has amassed over 300 test wickets, and continues to add more feathers to his cap. Tearing in at over 160 kilometres an hour, ‘Binga’ has dented many a helmet and inspired fear in the best batsmen.\r\n\r\nMy Life is his story—honest, engaging, and laced with charming wit. The book takes you inside the dressing room and sheds light on the highs and lows of the game—the pride of possessing a baggy green, the camaraderie between the boys, superstardom, and the inevitable controversies. It provides a glimpse into the life of one of Australia’s most successful fast bowlers and his love for music, fashion, and above all India","sale_price":798,"quantity":0,"category_id":6,"enabled":1,"author":"Brett lee","edition":0,"is_used_book":0,"publisher":null,"published_at":null,"thumbnail_url":"https:\/\/pos.booksmandala.com\/images\/4559","created_at":"2016-08-21 11:26:53","updated_at":"2021-04-05 11:16:59","deleted_at":null,"number_of_pages":436,"weight":650,"slug":"my-life","is_hard_cover":0,"path":"\/books\/my-life","shareable_url":"https:\/\/booksmandala.com\/books\/my-life","favorite_quantity":1,"geo_price":".0.00","total_preorder":null,"media":[{"id":4559,"disk":"uploads","directory":"1\/items","filename":"9788184001914","extension":"jpg","mime_type":"image\/jpeg","aggregate_type":"image","size":22151,"created_at":"2019-08-19 10:49:22","updated_at":"2019-08-19 10:49:22","deleted_at":null,"pivot":{"mediable_id":1166,"media_id":4559,"mediable_type":"App\\Models\\Common\\Item","tag":"picture","order":1}}]}],"links":{"first":"https:\/\/booksmandala.com\/api\/books?page=1","last":"https:\/\/booksmandala.com\/api\/books?page=13","prev":"https:\/\/booksmandala.com\/api\/books?page=10","next":"https:\/\/booksmandala.com\/api\/books?page=12"},"meta":{"current_page":11,"from":161,"last_page":13,"path":"https:\/\/booksmandala.com\/api\/books","per_page":16,"to":176,"total":200}}